{"title":"The.Raven.Legacy.of.a.Master.Thief.FIX-RELOADED","uid":8730301,"size":1543235,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:004806cda16222d835317208597cf2336bc96fb1&amp;dn=The.Raven.Legacy.of.a.Master.Thief.FIX-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mr.Stifmeister","files":2,"time":1374588527,"description":"\nnERv\n\nThe Raven - Legacy of a Master Thief Launcher Fix (c) Nordic Games\n\n07/2013 :..... RELEASE.DATE .. PROTECTION .......: Steam\n1 :.......... DISC(S) .. GAME.TYPE ........: Adventure\n\nThe Raven - Legacy of a Master Thief' is a thrilling crime adventure in three\nepisodes from the creators of 'The Book of Unwritten Tales'. Full of twists\nand turns, it immerses you in both sides of the story, combining\nthrill-of-the-chase whodunit with the risk and reward of a heist story.\n\nParis, 1960. Europe is in the grip of the gentleman master thief The Raven\nHis burglaries are spectacular and he always emerges unscathed. Young hotshot\ninvestigator Nicolas Legrand stuns the public when he confronts the master\nthief and fatally wounds him.\n\nLondon, 1964. An ancient ruby  one of the legendary 'Eyes of the Sphinx\nis stolen from the British Museum. At the crime scene: a raven feather\nIs somebody trying to follow in the Raven's footsteps?  Legrand is back\non the case. At the same time in Zurich a phone rings. Constable Anton Jakob\nZellner looks up from behind a mountain of files. He has no idea what lies\nhidden in a bank vault, just a few hundred meters away from him. As he\nreaches for the receiver his life takes a crucial turn\n\nKey Features\n\nKing Art's thrilling crime adventure  full of twists and turns  immerses\nyou in both sides of the story, combining elements of classic whodunit\nand heist stories\n\nCinematic presentation with hundreds of camera angles and dozens of cutscenes\n\nOptional puzzles and scoring system for adventure game veterans\n\nNotebook and help function for adventure game newcomers\n\nBreathtaking real-time 3D graphics in full HD\n\nFix Note\n\nSorry we missed the launcher , overwrite the exe file in the launcher folder\nwith this one\n\nNote original release works fine since it just launches the exe much like the\nstart button in this launcher\n\nAlso this is the deluxe edition , you can find some soundtrack and other goodies\nin the deluxe folder\n\n1. Copy launcher exe to the launcher folder in the installed gamedir\n5. Play the game\n6. Support the software developers. If you like this game, BUY IT\n\n","torrent":{"xt":"urn:btih:004806cda16222d835317208597cf2336bc96fb1","amp;dn":"The.Raven.Legacy.of.a.Master.Thief.FIX-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"004806cda16222d835317208597cf2336bc96fb1","infoHashBuffer":{"type":"Buffer","data":[0,72,6,205,161,98,34,216,53,49,114,8,89,124,242,51,107,201,111,177]},"announce":[],"urlList":[]}}