{"title":"Michael McDonald - I Keep Forgettin' (2nafish)","uid":5856953,"size":133330948,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:004ff1a0408520ea548c96261b1f3989a713ea3e&amp;dn=Michael+McDonald+-+I+Keep+Forgettin%5C%27+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1285662370,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;I Keep Forgettin' (Every Time You're Near)&quot; (also known as &quot;I Keep Forgettin'&quot;) is a 1982 popular song written by Michael McDonald and Ed Sanford. Its similarity to the earlier song &quot;I Keep Forgettin'&quot;, by Jerry Leiber and Mike Stoller, resulted in Leiber and Stoller also being given a songwriting credit.\n\nMichael McDonald recorded it as a duet with his sister Maureen for If That's What It Takes, his first solo album away from The Doobie Brothers, and it reached #4 on the Billboard Pop Singles charts, and #7 on the R&amp;B chart. Greg Phillinganes, Steve Lukather and Jeff Porcaro of the band Toto played the clavinet, guitar and drums respectively.\n\nMcDonald's song was heavily sampled by Warren G on his hit 1994 single &quot;Regulate&quot;, featuring Nate Dogg, and by Jadakiss on &quot;Kiss Is Spittin'&quot;, which also features Nate Dogg. 'Regulate' also samples the title cut from Bob James' 1981 album Sign of The Times.\n\nThe bassline is also sampled in the track &quot;Bistro&quot; by critically-acclaimed MF Doom/Madlib collaboration Madvillain.\n\nThe chorus is covered by Moloko in an acoustic mix to their hit single from 2003, &quot;Familiar Feeling&quot;.\n\nThere is also a version by Patti LaBelle and recently McDonald sang it as a duet with Julia Fordham.\n\nIf That's What It Takes is the name of Michael McDonald's debut solo album, released in 1982.\n\nMichael McDonald (born February 12, 1952) is a five-time Grammy Award winning American singer and songwriter. Sometimes described as a &quot;blue-eyed soul&quot; singer, McDonald has a distinctive &quot;husky, soulful&quot; baritone voice. He is known for his work as a member of the Doobie Brothers and Steely Dan, and for several hits as a solo artist.\n\nMcDonald was recruited by the band The Doobie Brothers in April 1975 when lead singer Tom Johnston  became ill during a national tour. His time with the band proved so successful that they decided to retain him as a full time member.\n\nAs a member of the Doobies, he recorded some of his most well-known songs, such as &quot;Takin' It to the Streets&quot;, &quot;Little Darling&quot;, &quot;It Keeps You Runnin'&quot; &quot;Minute by Minute&quot; and &quot;What a Fool Believes&quot; (which became a number one single in the U.S. and earned him a 1978 Grammy Award for Song of the Year). At the same time he appeared as a session singer and piano player for artists like Christopher Cross, Jack Jones, Bonnie Raitt, the rock band Toto and Kenny Loggins.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:004ff1a0408520ea548c96261b1f3989a713ea3e","amp;dn":"Michael+McDonald+-+I+Keep+Forgettin%5C%27+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"004ff1a0408520ea548c96261b1f3989a713ea3e","infoHashBuffer":{"type":"Buffer","data":[0,79,241,160,64,133,32,234,84,140,150,38,27,31,57,137,167,19,234,62]},"announce":[],"urlList":[]}}