{"title":"Trafficked Young People: Breaking the Wall of Silence (2013) by","uid":10791096,"size":668672,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:007e6e18fb82034d982880215af94d4984a91b0f&amp;dn=Trafficked+Young+People%3A+Breaking+the+Wall+of+Silence+%282013%29+by+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Sunghabib","files":1,"time":1408249021,"description":"!! Due to bayimg.com error, here for the book cover : http://imgur.com/bhICFRH\n\n\n\nBook Description:\n\nHuman trafficking constitutes one of the most serious human rights violations of our time. However, many social work practitioners still have a poor and incomplete understanding of the experiences of children and young people who have been trafficked. In Trafficked Young People, the authors call for a more sophisticated, informed and better developed understanding of the range of issues facing trafficked young people.\n\nIn the first work of its kind to combine an up-to-date overview of the current policy context with related theoretical concerns and practitioner experiences, Pearce, Hynes &amp; Bovarnick demonstrate how the trafficking of children and young people should be regarded as a child protection, rather than an immigration concern. Drawing on focus group and interview research with 72 practitioners and covering the cases of 37 individuals, Trafficked Young People explores the way child care practitioners identify, understand and work with the problems faced by people who have been trafficked. The book looks at how practitioners interpret and use definitions of trafficking in their day to day work; at their experiences of exposing the needs of trafficked children and young people and at their efforts to find appropriate resources to meet these needs.\n\nTrafficked Young People will be of interest to practitioners working in support housing and social work, along with solicitors and sociologists, particularly those working within discourses of child agency, self determination and victimhood. With its emphasis on the legal and policy framework, and integrated throughout with case histories, practitioner interviews and recommendations for best practice, Trafficked Young People is essential reading for anyone working within a Social Policy Development context.\n\nProduct Details:\n\nSeries: Adolescence and Society\nPDF: 200 pages\nPublisher: Routledge; 1 edition (March 14, 2013)\nLanguage: English\nISBN-10: 0415617545\nISBN-13: 978-0415617543\n\n\n-------\nSeed - Share - Enjoy - Give me Thumbs Up\n-------","torrent":{"xt":"urn:btih:007e6e18fb82034d982880215af94d4984a91b0f","amp;dn":"Trafficked+Young+People%3A+Breaking+the+Wall+of+Silence+%282013%29+by+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"007e6e18fb82034d982880215af94d4984a91b0f","infoHashBuffer":{"type":"Buffer","data":[0,126,110,24,251,130,3,77,152,40,128,33,90,249,77,73,132,169,27,15]},"announce":[],"urlList":[]}}