{"title":"Britt Nicole - Believe (Xvid-2nafish)","uid":6035901,"size":65346214,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:00e388cdaa78f883c11cd650b20be7200f62d05a&amp;dn=Britt+Nicole+-+Believe+%28Xvid-2nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1292231671,"description":"File Info:\n\nValid : Yes [AVI]\nDuration : 00:03:38\n\n[Video]\nResolution : 640x344\nCodec : XviD MPEG-4 codec\nFPS : 29.97\nBitRate : 2263 Kbps\nQuality Factor : 0.35 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 44100 Hz\nBitRate : 128 Kbps\n\n\nThis video has no logos or titles.\n\n\nSay It is the debut album from Britt Nicole. It was released May 22, 2007 and features the hit songs, &quot;You&quot;, &quot;Believe&quot; and &quot;Set the World On Fire&quot;\n\nBrittany Nicole Waddell (born August 2, 1985) is a Christian music artist who performs under the name Britt Nicole. She is signed to EMI CMG/Sparrow. She sings Contemporary Christian music.\n\nWaddell turned down a scholarship from Belmont University in Nashville, Tennessee, to pursue a full-time music career. She felt that God was calling her to concentrate on music instead of going to college. In 2004, she signed a management deal with Vertical Entertainment, and then signed a development deal with Word Records. Sparrow Records signed her in 2006, and her first album Say It was released on May 22, 2007. Britt Nicole was the opening act on the Winter Jam Tour with Sanctus Real, Hawk Nelson, Jeremy Camp, Steven Curtis Chapman, and Newsong.\n\nHer song &quot;Indestructible&quot; was featured on the WOW Next 2007 compilation CD, and her summer festival plans include Creation East/West, Spirit West Coast Monterey/Del Mar, and Celebrate Freedom. She was featured on Christian hip-hop group GRITS' 2006 release, Redemption, on the song Right Back (credited as &quot;Brittany Waddell&quot;.)\n\nOn May 22, 2007 she released her debut album Say It. It peaked at #40 on Billboard's Christian Albums \n\nThe debut single from the album, &quot;You&quot;, was released on March 27, 2010. It hit the Top 10 on the R&amp;R chart. It was the 12th most played song on Christian Hit Radio stations in 2007, according to R&amp;R magazine. It also peaked at #6 on Billboard's Hot Christian Songs, her highest charting song to date. \n\nBritt Nicole's song &quot;Sunshine Girl&quot; was featured on MTV's teen reality show Newport Harbor: The Real Orange County on September 5, 2007.\n\nBritt's first music video, for the song &quot;Believe&quot;, premiered on the Gospel Music Channel on September 22, 2007. The song was later released as the album's second single on October 30, 2007. It was the 21st most-played song of 2008 on U.S. Contemporary Christian music radio stations according to R&amp;R magazine's Christian CHR chart.\n\nOn November 20, 2007, Britt released her first extended play titled Holiday Trio. The EP Christmas-themed and was only released digitally. It featured her song &quot;Holiday&quot;, plus two never before released songs; one is an original titled &quot;Come What May&quot;, and the other is a cover song of the holiday hit &quot;Last Christmas&quot;.\n\n&quot;Set the World On Fire&quot; was released as Say It's third and final United States single in early 2008. The song peaked at #11 on Billboard's Hot Christian Songs. In 2007 and 2008, &quot;Holiday&quot; and &quot;When She Cries&quot; were both released as UK singles, while &quot;Don't Worry Now&quot; was serviced to radio in Australia.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:00e388cdaa78f883c11cd650b20be7200f62d05a","amp;dn":"Britt+Nicole+-+Believe+%28Xvid-2nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00e388cdaa78f883c11cd650b20be7200f62d05a","infoHashBuffer":{"type":"Buffer","data":[0,227,136,205,170,120,248,131,193,28,214,80,178,11,231,32,15,98,208,90]},"announce":[],"urlList":[]}}