{"title":"Catherine Russell - 2014 - Bring It Back (24 88.2) FLAC","uid":10219705,"size":908544075,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:010f75c0aadf52e4d395e5cdb4b43a05e35e5255&amp;dn=Catherine+Russell+-+2014+-+Bring+It+Back+%2824+88.2%29+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"eika256","files":-1,"time":1401024529,"description":"Catherine Russell - 2014 - Bring It Back\n24 bits, 88.2 KHz\n\nNew York City vocalist Catherine Russell is the brilliant eutection of two bright tones. Her father, the late Luis Russell, collaborated with Louis Armstrong as his bandleader and arranger. Russell's mother was the inestimable Carline Ray who concluded her seven decade career with her debut as a leader Vocal Sides (Self Produced, 2013) before passing away at aged 88 July 27, 2013). Russell was intimately involved in the project with her mother. These spirits mixed to create the formidable talent that is Russell. Bring It Back is Russell's fifth recording and her first for the Harmonia Mundi Jazz Village imprint.\nRussell creatively stretches with both a larger ten-piece band and an equally enlarged repertoire spanning from the dawn of jazz to the heyday of rhythm and blues. Russell and her cadre of arrangers opted for a more earthy presentation, giving the music a sepia hue without turning it into an all-out period piece. There is a comfortable and familiar 1930s cinematic feel to this music sans the rudimentary sonic technology. This is that honest music made by Esther Phillips, Al Hibbler, Wynonie Harris, Johnny Otis and Little Willie John, music that existed in the interface between jazz and R &amp; B, where the two genres and all that made them linger and embrace.\nThe disc's true center is the first full performance of Russell's father's composition, &quot;Lucille,&quot; which was recently found in the Louis Armstrong archives as a demo. It is a shimmering ballad that migrates into a Count Basie riff-fest. Russell addresses the slow blues in &quot;After the Lights Go Down Low&quot; complete with Glenn Patscha's Hammond and Matt Munisteri's thin, metallic guitar fills raise the song above gutbucket into the Chittlin' Circuit realm. &quot;I'm Sticking to You Baby&quot; is a Henry Glover jump blues. Perfectly wedged in is Fats Waller's &quot;Strange as it Seems&quot; and the Koehler/Arlen hidden swing treasure, &quot;Public Melody Number One.&quot;\nRussell's title Bring It Back is a call for reconsideration. The primary focus in jazz, or music in general, need not be the ever- expanding trajectory outward. It can also be inward, old forms well considered. Russell provides essential and emphatic interpretations of songs close to her life and spirit making this an exceptional recording. (allaboutjazz)\n\nTrack list:\n01 - Bring It Back\n02 - I'm Shooting High\n03 - I Let A Song Go Out Of My Heart\n04 - You Got To Swing And Sway\n05 - Aged And Mellow\n06 - The Darktown Strutters' Ball\n07 - Lucille\n08 - You've Got Me Under Your Thumb\n09 - After The Lights Go Down Low\n10 - I'm Sticking With You Baby\n11 - Strange As It Seems\n12 - Public Melody Number One\n13 - I Cover The Waterfront\n\nPersonnel: Catherine Russell: vocals, percussion (6, 10); \nMatt Munisteri: guitar; \nMark Shane: piano; \nLee Hudson: bass (1-5, 7-13); \nNicki Parrott: bass (6); \nMark McLean: drums, percussion (6); \nAndy Farber: tenor saxophone; \nJon-Erik Kellso: trumpet; \nBrian Pareschi: trumpet (2-13); \nDan Block: alto saxophone, tenor saxophone (5), clarinet (4); \nJohn Allred: trombone; \nMark Lopeman: baritone saxophone; \nGlen Patscha: Hammond B-3 (6, 9, 10). \n\nEnjoy and share!","torrent":{"xt":"urn:btih:010f75c0aadf52e4d395e5cdb4b43a05e35e5255","amp;dn":"Catherine+Russell+-+2014+-+Bring+It+Back+%2824+88.2%29+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"010f75c0aadf52e4d395e5cdb4b43a05e35e5255","infoHashBuffer":{"type":"Buffer","data":[1,15,117,192,170,223,82,228,211,149,229,205,180,180,58,5,227,94,82,85]},"announce":[],"urlList":[]}}