{"title":"The Seer Series - Linda Joy Singleton","uid":8620218,"size":2976033,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:014cb0ac8eced98dbab47767a2a7e1b488d65999&amp;dn=The+Seer+Series+-+Linda+Joy+Singleton&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"Mohammad_AT","files":6,"time":1372349989,"description":"The Seer Series is a paranormal young adult book series written by American novelist Linda Joy Singleton.\n\nDon't Die, Dragonfly\n\nAfter getting kicked out of school and sent to live with her grandmother, Sabine Rose is determined to become a &quot;normal&quot; teenage girl. She hides her psychic powers from everyone, even from her grandmother Nona, who also has &quot;the gift.&quot; Having a job at the school newspaper and friends like Penny-Love, a popular cheerleader, have helped Sabine fit in at her new school. She has even managed to catch the eye of the adorable Josh DeMarco. Yet, Sabine can't seem to get the bossy voice of Opal, her spirit guide, out of her head . . . or the disturbing images of a girl with a dragonfly tattoo. Suspected of a crime she didn't commit, Sabine must find the strength to defend herself and, later, save a friend from certain danger.\n\nLast Dance\n\nSabine can't wait to show off her new boyfriend at the upcoming school dance, but she's also worried about her grandmother, Nona, who's suffering from a fatal hereditary illness. The only cure lies within a remedy book, lost long ago. Determined to save Nona, Sabine goes to Pine City to visit a distant relative who may have clues. But there's someone else clamoring for Sabine's attention: a fifty-year-old ghost named Chloe who's been appearing in her dreams. Celebrated by Pine City every year on the anniversary of her tragic death, Chloe has become a town legend. Despite death threats and missing the school dance, Sabine must use her psychic skills to solve the mystery surrounding Chloe's untimely demise . . . and lay her soul to rest.\n\nWitch Ball\n\nSabine is finally starting to feel accepted at her new high school. She's friends with the popular girls and even has a cute boyfriend. But Sabine also has a dark secret-she's psychic, and was forced to leave her old school after she accurately predicted the death of a football player. Volunteering with her friends to help run the psychic booth at their school's fundraising carnival, Sabine discovers too late that the fake crystal ball she meant to bring has been mysteriously switched. In its place is the strange &quot;witch ball&quot; she locked away after her grandmother refused to have it in the house. Now the haunted witch ball's predictions are coming true, and Sabine must solve the mystery before its final prediction-her own death-becomes a deadly reality.\n\nSword Play\n\n&quot;Help her,&quot; insists the spirit of Kip, the jock from her old school who died in a car accident. But his cryptic message is the last thing on Sabine's mind as she packs up to move back home. She's not happy about leaving her friends, her boyfriend, and Nona who's gravely ill, but won't dare challenge her mother's orders. Besides, Sabine's also harboring hope that she can become close to her family again. Reuniting with her fencing club brings back painful memories of getting kicked out of school and betrayed by her former best friend Brianne, now too entangled with her boyfriend to notice Sabine . . . unlike Kip's ghost who continues to nag her about someone in trouble. But Kip died alone, so who needs her help? As Sabine researches the events of that tragic night, she pieces together a shocking revelation-knowledge that leads to a dangerous duel with a surprising foe.\n\nFatal Charm\n\nIn this vivid fifth volume of The Seer series, Sabine Rose is reunited with her ill grandmother Nona and her friends at Sheridan Valley. But the excitement of curing Nona-and discovering love with someone new-doesn't outweigh the burden of her father's dark secret: a daughter no one but Sabine knows about. Riddled with curiosity, Sabine uses astral projection to spy on her half sister Jade. And then one night-while out of body-she witnesses a gruesome murder! The victim appears to be Jade's mother, but the next day reveals she is very much alive. Was it all a terrible nightmare? A puzzling psychic message, feelings for two different guys, building resentment towards her father and Jade-it's almost too much to bear. And when the killer from her nightmare turns out to be real, Sabine finds she must open her heart to the person she trusts the least.\n\nMagician's Muse\n\nAfter a difficult breakup with her boyfriend, Josh, Sabine is relieved that life seems to be settling down to some semblance of normalcy. Now Josh can find an adoring girlfriend that will appreciate his magician skills, while Sabine can be with her true love, Dominic, who does not treat her psychic abilities as a freak of nature. This illusion is shattered when she receives a frantic phone call from Josh's mother. He is missing, and Sabine becomes plagued with disturbing visions of his fate. To further complicate matters, her half-sister, Jade, has betrayed her by dating Sabine's arch-enemy, Evan, and new threats against her beloved Dominic prevent her from turning to him for comfort. Sabine must summon both her wits and her supernatural abilities to save Josh and thwart the dangers that seem to be approaching those she loves from every direction.","torrent":{"xt":"urn:btih:014cb0ac8eced98dbab47767a2a7e1b488d65999","amp;dn":"The+Seer+Series+-+Linda+Joy+Singleton","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"014cb0ac8eced98dbab47767a2a7e1b488d65999","infoHashBuffer":{"type":"Buffer","data":[1,76,176,172,142,206,217,141,186,180,119,103,162,167,225,180,136,214,89,153]},"announce":[],"urlList":[]}}