{"title":"[PS3] Rapala Fishing Frenzy","uid":9590712,"size":1509886337,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:01d43938ea97a34fb87cee5a432a03924955b34a&amp;dn=%5BPS3%5D+Rapala+Fishing+Frenzy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"fuckface69","files":-1,"time":1391894506,"description":"* Put your angling skills to the test in the best bass locations in North America\n* Features 9 species of monster bass and 14 other trophy fish, such as trout, salmon, northern pike, catfish and walleye\n* Fish in 6 great lakes: Lake Wylie, Clear Lake, Lake of the Ozarks, Lake Amistad, Logan Martin Lake, and Lake Okeechobee\n* Compete in 20 events, as well as Open Fishing and Quick Challenge modes\n\nPut your angling skills to the test in the best bass locations in North America. Cabela's Monster Bass puts you in the middle of heart-pounding fishing action as you compete in 20 events to fill your live well with only the biggest bass. But time is limited, so don't be late for the weigh-in!\n\nCabela's Monster Bass lets you test your skills on six of America's greatest fishing lakes, including Lake Wylie, Clear Lake, Lake of the Ozarks, Lake Amistad, Logan Martin Lake, and Lake Okeechobee. You'll fish for nine species of monster bass, such as large mouth, small mouth, spotted, striped and more. There are also 14 other trophy species, such as trout, salmon, northern pike, catfish and walleye.\n\nCasting the line is initiated by flicking the analog stick or -- for less patient players -- by inputting specific commands to attract fish. Once a fish starts biting, the fight begins. Following the on-screen visual cues, players must carefully balance reeling in the fish while keeping an eye on the line's tension so it doesn't break. Button combinations can also be used to weaken the fish's resolve, allowing for an easier catch. As players progress, additional rods, lures, and live bait become available to improve the odds of landing the &quot;big one.&quot; Other play options include an Open Fishing mode and a Quick Challenge. The former has players fishing on their choice of lakes, while the latter involves racking up high scores in timed events. \n________________________________\n\nUSE WINRAR 5 TO EXTRACT ARCHIVE!","torrent":{"xt":"urn:btih:01d43938ea97a34fb87cee5a432a03924955b34a","amp;dn":"%5BPS3%5D+Rapala+Fishing+Frenzy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01d43938ea97a34fb87cee5a432a03924955b34a","infoHashBuffer":{"type":"Buffer","data":[1,212,57,56,234,151,163,79,184,124,238,90,67,42,3,146,73,85,179,74]},"announce":[],"urlList":[]}}