{"title":"Bloons TD 4 v2.1.0 Final By bobiras2009","uid":7555255,"size":48199505,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:02967f5173f6f5fee80532eeb4b6d385fea10571&amp;dn=Bloons+TD+4+v2.1.0+Final+By+bobiras2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bobiras2009","files":-1,"time":1345592401,"description":"                                  By bobiras2009\n\n\nThe monkeys are getting serious and are ready to take down the enemy from the land, air and sea in the style of classic tower defense. Utilising a ranking system you can build up your experience and gain access to powerful towers and upgrades. Call in mortar strikes, deploy the monkey aces and harness the power of banana farms as you bid to take down the enemy in true bloon popping fashion.\n\nBloonsÂ® TD 4 Android features a mix of classic tracks from the online game as well as a whole host of new tracks for you to master. The medal ranking system adds an extra level of difficulty to the challenge. Can you battle through all 75 rounds to earn the gold medal?\n\nOf course, even if you do, the fun doesn't stop there and you can continue the madness in freeplay mode. Discover how many rounds can you survive before the enemy overpowers you.\n\nBloonsÂ® TD 4 has some special bonuses which you can discover and unlock by mastering the tracks!\n\nFeatures:\n\n    All of your BloonsÂ® TD 4 favourites, including the all powerful Sun God.\n    15 different tracks.\n    3 difficulty settings on each map, Easy, Medium and Hard for varying degrees of challenge.\n    Continue the popping frenzy in freeplay mode once you master a track.\n    Special bonus unlocks.\n\nWhat's in this version : (Updated : Aug 21, 2012)\n\n    Update 2.0 is here and this time we are bringing you a bumper update! A new track has been laid out on the battlefield, Bee Hive and prepare for the all new EXTREME CHALLENGE MODE! With all of this new content the monkeys needed a way to retaliate so we are sending in reinforcements. We airdropped a mystery package to aid you in the battle against the Bloons. Unfortunately the Bloons managed to intercept the package before it made its way to you and they've secured it with a special lock!\n\nRequired Android O/S : 1.6+\n\n\n                                  By bobiras2009","torrent":{"xt":"urn:btih:02967f5173f6f5fee80532eeb4b6d385fea10571","amp;dn":"Bloons+TD+4+v2.1.0+Final+By+bobiras2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"02967f5173f6f5fee80532eeb4b6d385fea10571","infoHashBuffer":{"type":"Buffer","data":[2,150,127,81,115,246,245,254,232,5,50,238,180,182,211,133,254,161,5,113]},"announce":[],"urlList":[]}}