{"title":"Faces - Stay with Me- Anthology - 2CD 2012","uid":8056502,"size":977450446,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:03ace9f35f93556518bb8d707ad8b5901412921b&amp;dn=Faces+-+Stay+with+Me-+Anthology+-+2CD+2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"barber9","files":-1,"time":1358979998,"description":"When Steve Marriott left the Small Faces in 1969, the three remaining members brought in guitarist Ron Wood and lead singer Rod Stewart to complete the lineup and changed their name to the Faces, which was only appropriate since the group now only slightly resembled the mod-pop group of the past. Instead, the Faces were a rough, sloppy rock &amp; roll band, able to pound out a rocker like Had Me a Real Good Time, a blues ballad like Tell Everyone, or a folk number like Richmond, all in one album. Stewart, already becoming a star in his own right, let himself go wild with the Faces, tearing through covers and originals with abandon. While his voice didn't have the power of Stewart, bassist Ronnie Lane's songs were equally as impressive and eclectic. Wood's rhythm guitar had a warm, fat tone that was as influential and driving as Keith Richards' style.\n\nNotorious for their hard-partying, boozy tours and ragged concerts, the Faces lived the rock &amp; roll lifestyle to the extreme. When Stewart's solo career became more successful than the Faces, the band slowly became subservient to his personality. After their final studio album, Ooh La La, in 1973, Lane left the band. After a tour in 1974, the band called it quits. Wood joined the Rolling Stones, drummer Kenny Jones eventually became part of the Who, and keyboardist Ian McLagan became a sought-after supporting musician. Stewart became a superstar, although he never matched the simple charm of the Faces.\n\nWhile they were together, the Faces never sold that many records and were never considered as important as the Stones, yet their music has proven extremely influential over the years. Many punk rockers in the late '70s learned how to play their instruments by listening to Faces records, in the '80s and '90s, guitar rock bands from the Replacements to the Black Crowes took their cue from the Faces as much as the Stones. Their reckless, loose, and joyous spirit stayed alive in much of the best rock &amp; roll of the subsequent decades.\n(Stephen Thomas Erlewine)\n\n- - -\n\nFaces - Stay with Me- Anthology 1970-1975\n(2CD Rhino 2012)\n\n\n     1. Stay With Me\n     2. Miss Judy's Farm\n     3. Cindy Incidentally\n     4. You're So Rude\n     5. Flying\n     6. That's All You Need\n     7. My Fault\n     8. Had Me A Real Good Time\n     9. Richmond\n    10. Too Much Woman For A Henpecked Man (Live)\n    11. Love Lives Here\n    12. Debris\n    13. Just Another Honky\n    14. On The Beach\n    15. Wicked Messenger\n    16. Too Bad\n    17. Rear Wheel Skid\n    18. Love In Vain (Live)\n    19. Ooh La La\n    20. Maybe I'm Amazed\n    21. Memphis, Tennessee\n    22. Pool Hall Richard\n    23. Bad 'n' Ruin\n    24. You Can Make Me Dance, Sing Or Anything\n    25. Last Orders Please\n    26. Around The Plynth\n    27. Three Button Hand Me Down\n    28. As Long As You Tell Him\n    29. Glad And Sorry\n    30. Pineapple And The Monkey\n    31. Flags And Banners\n    32. Sweet Lady Mary\n    33. Silicone Grown\n    34. Shake, Shudder Shiver\n    35. Borstal Boys\n    36. Gasoline Alley (Live)\n","torrent":{"xt":"urn:btih:03ace9f35f93556518bb8d707ad8b5901412921b","amp;dn":"Faces+-+Stay+with+Me-+Anthology+-+2CD+2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"03ace9f35f93556518bb8d707ad8b5901412921b","infoHashBuffer":{"type":"Buffer","data":[3,172,233,243,95,147,85,101,24,187,141,112,122,216,181,144,20,18,146,27]},"announce":[],"urlList":[]}}