{"title":"Theme Hospital","uid":7493820,"size":175431174,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:053113f90af165f3f015496d9a933c9ac53fa68a&amp;dn=Theme+Hospital+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jamonkob","files":5,"time":1343779232,"description":"Theme Hospital \n\n\nOverview:\nIt's a matter of laugh or death in Theme Hospital, another installment of the Theme series. Design, maintain and manage a hi-tech hospital facility, making the most of limited resources and turning cures into cash. The Grim Reaper stalks the corridors, the ill have some very odd ailments, and the staff want to play doctors and nurses together. No matter how you look at it, you're in control of a very sick hospital.\n\nf there is one word that describes Theme Hospital then it has to be ilarious Almost everything in this game is made with great dose of humour. You might think that someone's illness is not a laughing matter but wait till you see a patient with KingComplex dressed as Elvis or serious case of Hairyitis caused from prolonged exposure to the moon. Finding treatments for such diseases is a part of your job, but theres no prescription to cure the insanity that may result from trying to figure out those cures. You start off small with an empty building, a few doctors, a general diagnostic, a pharmacy, a reception desk, and a few other necessities. From there its up to you to move your way up in the health care industry.\n\nA hospital simulator is not something you might consider a good theme for a game but the guys from Bullfrog Productions were famous for creating innovative and fun titles from the craziest idea--and Theme Hospital no exception. This game is a piece of art and definitely the best hospital simulation so check it out. Our diagnosis: fun!\n\nBonus content included for FREE with purchase:\n    * manual\n    * 2 avatars","torrent":{"xt":"urn:btih:053113f90af165f3f015496d9a933c9ac53fa68a","amp;dn":"Theme+Hospital+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"053113f90af165f3f015496d9a933c9ac53fa68a","infoHashBuffer":{"type":"Buffer","data":[5,49,19,249,10,241,101,243,240,21,73,109,154,147,60,154,197,63,166,138]},"announce":[],"urlList":[]}}