{"title":"Tarma InstallMate v9.15.0","uid":10829239,"size":11835206,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:053adcda175197d7f2c0cb851ed2bc17b4e55546&amp;dn=Tarma+InstallMate+v9.15.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ZarkBit","files":2,"time":1408604685,"description":"InstallMateÂ® 9 \n\nInstallMate 9 creates software installers for all Windows 32-bit and 64-bit desktop and server platforms, with complete customization of all installer actions and dialogs.\n\nInstallMate 9 contains many features that you otherwise only find in products 10-20 times its price, plus some features that you will not find anywhere else. Below is a partial list; for a complete list of features\n\n*Windows Logo compliance\n*InstallMate complies with the latest Microsoft Windows Logo requirements for software installation so your installers operate smoothly in the Windows environment. More information... \n*Installation on all Windows 32-bit and 64-bit Desktop and Server systems\n*In contrast to most other installers and MSI, InstallMate is compatible with all 32-bit and 64-bit Microsoft Windows desktop and server systems from Windows 95 through to Windows 7, including all Server editions (plus Core) and the Windows Preinstallation Environment (WinPE). You therefore only need one installer package, no matter which platforms you target. \n*Fully self-contained, compact installers\n*All InstallMate installers are fully self-contained and require no additional support files or runtime installation, thus greatly simplifying your product deployment. Compression is excellent and overhead very low, which makes your installation packages smaller than a .zip file. \n*Supports full GUI, progress-only, and hidden installation\n*All InstallMate installers can be run with a full graphical user interface (the familiar Setup wizard steps), or with only a progress box visible, or even completely hidden. This allows you to deploy your product both in interactive and in automated environments. \n*Flexible packaging for easy deployment\n*Each installer can be built as a single .exe package, as a small .exe loader with separate installation archives, with automatic download of installation components, or any combination thereof. Disk spanning is also supported. This lets you deploy your product in any manner that suits you and your customers.\n*Fully localized \n*InstallMate installers come pretranslated in 19 languages, use Unicode through-and-through, and allow localization of all installer aspects for any language, including right-to-left languages such as Arabic and Hebrew. Your installers are ready for world-wide deployment from the start. \n*Total control over all installation actions and dialogs\n*InstallMate allows you full access to all aspects of the installer with its build-in dialog editor and action sequence editor. This enables you to customize your installers exactly as you need them, with no scripting required. \n*Extensive preflight checks\n*More than 500 different preflight checks are performed each time you build an installer package to alert you to potential installation problems before they happen. This helps you build better installers and reduces your support costs.\n &lt;a href=&quot;\nhttp://s19.postimg.org/4q8hnvhib/screenshot_12.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s19.postimg.org/4q8hnvhib/screenshot_12.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.tarma.com/im9/features.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tarma.com/im9/features.htm&lt;/a&gt;","torrent":{"xt":"urn:btih:053adcda175197d7f2c0cb851ed2bc17b4e55546","amp;dn":"Tarma+InstallMate+v9.15.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"053adcda175197d7f2c0cb851ed2bc17b4e55546","infoHashBuffer":{"type":"Buffer","data":[5,58,220,218,23,81,151,215,242,192,203,133,30,210,188,23,180,229,85,70]},"announce":[],"urlList":[]}}