{"title":"EnigmaT Set Rips { Cuts } - December 4th, 2014","uid":11631292,"size":663603131,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:06197026b9d4dde14920fd272cabc18a4212d4f9&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+December+4th%2C+2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EnigmaT","files":75,"time":1417676749,"description":"9west - Decay (David Durango Undeep Remix) (Cut From Graham Set)-enTc\nAbandoned Rainbow - Sorry For My Eyes (Original Mix) (Cut From Random X Set)-enTc\nActive Visions - Skyline (Cut From Uplift Set)-enTc\nAdam Oland - Back From Vienna (Pete K Remix) (Cut From Salinas Set)-enTc\nAirzoom - The Wolf (Cut From Abstract Set)-enTc\nAlberto Ruiz &amp; Joe Blake - Ride It Out (Cut From Graham Set)-enTc\nAlberto Ruiz &amp; Joe Blake - You've Got To (Cut From Graham Set)-enTc\nAlex Di Stefano - Black Panther (Cut From Graham Set)-enTc\nAllaby - Hiding to Nothing (Cut From Graham Set)-enTc\nAllen &amp; Envy feat. Jess Morgan - The Heart That Never Sleeps (Amir Hussain Dub) (Cut From Uplift Set)-enTc\nAndy Blueman - Elements of Nature (Original 2005 Mix) (Cut From Uplift Set)-enTc\nAndy Blueman - Porque Pas (Original 2005 Mix) (Cut From Uplift Set)-enTc\nAndy Cain - The Silence (Original Mix) (Cut From Sty Set)-enTc\nANNA - Fits Foil (Cut From Graham Set)-enTc\nAWD - Wintertide (Cut From Ferry Set)-enTc\nBilly Rutts - Dark Secrets (Public Domain Remix) (Cut From Sty Set)-enTc\nBluSkay - A Smile To Remember (Original Mix) (Cut From Sneijder Set)-enTc\nBluSkay - ReUnited (Original Mix) (Cut From Sneijder Set)-enTc\nCari Lekebusch &amp; Zoe Xenia - Fly (Vincenzo Remix) (Cut From Graham Set)-enTc\nCarlos Manaca - Pharmatech (Cut From Graham Set)-enTc\nChanges - MDMA (Cut From Skyver Set)-enTc\nChris Domingo - Steady (Cut From Graham Set)-enTc\nCiro Visone - A True Story (Cut From Metcalfe Set)-enTc\nDani V - Exelyum (Emrah Unturk Intro Edited) (Set Rip)-enTc\nDaniel Skyver - Panic Stations (Chris Metcalfe Remix) (-SHORT- Set Rip)-enTc\nDart Rayne &amp; Yura Moonlight - Incomplete (Allen &amp; Envy Remix) (Cut From PvD Set)-enTc\nDI-RECT - Invincible (Ducked Ape Remix) (Cut From Armada Set)-enTc\nDreamy pres. Divisional Phrase - Last Farewell (Cut From A&amp;F Set)-enTc\nFairmont - The Biggest Eyes In The World (Matthies Remix) (Cut From Solarstone Set)-enTc\nGazzo &amp; Will K feat. Kyle Richardson - Forth &amp; Back (Original Mix) (Cut From Armada Set)-enTc\nGlover - Faces (Cut From Page Set)-enTc\nHans Zimmer - Our Destiny Lies Above Us [Interstellar] (Tucandeo Rework) (Set Rip)-enTc\nHansgod - Charvet Peaks (Original Mix) (Cut From Akar Set)-enTc\nHazem Beltagui - Sticks &amp; Stones (Cut From Solarstone Set)-enTc\nHello Machines &amp; Nerina Pallot - Rousseau (Cut From KvA Set)-enTc\nJames Holden feat. Julie Thompson - Nothing (Cream and Deep Fog Unofficial 2014 Remix) (Set Rip)-enTc\nJohnny Norberg - Free (Dub Mix) (Cut From Ferry Set)-enTc\nKam Delight - Scandinavia (Cut From Abstract Set)-enTc\nKardinal &amp; Lowkey - Switch Girl (Digital Session Mix) (Cut From Graham Set)-enTc\nKobo - Lion (Cut From Jules Set)-enTc\nLas Salinas - The Drunken Clam (Original Mix) (Cut From Salinas Set)-enTc\nLostly - No Direction Home (Gary Maguire Remix) (Cut From Thrillseekers Set)-enTc\nLow Steppa - Take Me Up (Original Mix) (Cut From Armada Set)-enTc\nMatt Chowski - Soundscape (Original Mix) (Cut From Temple One Set)-enTc\nMatyash - Encryption (Cut From Abuzz Set)-enTc\nMaywave - Voice Calling (Matt Chowski Remix) (Cut From Saux Set)-enTc\nMehmet Gulec - Orange Truth (Bilal Cetiner Remix) (Cut From KvA Set)-enTc\nMichael A - Kate (Cut From Graham Set)-enTc\nMiroslav Vrlik &amp; Abide - Lights In The Heaven (Cut From Uplift Set)-enTc\nMyde - Canvas (Original Mix) (Cut From Saux Set)-enTc\nNoMosk &amp; Alpha Force - High Contrast (Cut From Abstract Set)-enTc\nPablo Artigas - Ragnarik (Cut From PvD Set)-enTc\nPaul Thomas &amp; Chris Bekker - Zoundz (Full Intention Mix) (Cut From PvD Set)-enTc\nPhilosopher - Photon (Original Mix) (Cut From Tucandeo Set)-enTc\nPhynn - Mach 5 (Cut From Ferry Set)-enTc\nQuivver - Paper Lunch (Cut From Solarstone Set)-enTc\nRadiohead - Reckoner (Cubicolor Remix) (Cut From Salinas Set)-enTc\nRoman Babanov - Flamingo (Cut From KvA Set)-enTc\nSean Matthews - Rays of Aten (Cut From PvD Set)-enTc\nSean Murphy feat. Elinor Wahl - Amplify (Cut From Jules Set)-enTc\nShelter - Rock Steady (Cut From Graham Set)-enTc\nSlimShaky - Crystal Love (Cut From Graham Set)-enTc\nSlimShaky - Dirty Martini (Cut From Graham Set)-enTc\nSollito - Javelin (Original Mix) (Cut From Salinas Set)-enTc\nSteve Angello - Wasted Love feat Dougy (Rivaz Remix) (Cut From Page Set)-enTc\nSteve Jablonsky - Arrival To Earth (BluEye Bootleg Mix) (Cut From Saux Set)-enTc\nStoneface &amp; Terminal feat. Ellie Lawson - For You (Pingpong Remix) (Cut From KvA Set)-enTc\nTangle - Positron (Original Mix) (-FiXeD- Cut From Sty Set)-enTc\nThomas Vink - Ten (Cut From Graham Set)-enTc\nTolga Uzulmez  Serenade (Original MIx) (Cut From Random X Set)-enTc\nTom Rogers - Frozen (Original Mix) (Cut From Saux Set)-enTc\nTony Dee - Noise Of Shadow (Hollen Remix) (Cut From Graham Set)-enTc\nTundo and Landry - Sydney (Cut From PvD Set)-enTc\nVitodito feat. LaMeduza - Set Sail (Cut From KvA Set)-enTc\nYears - Initial (Cut From Jules Set)-enTc","torrent":{"xt":"urn:btih:06197026b9d4dde14920fd272cabc18a4212d4f9","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+December+4th%2C+2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"06197026b9d4dde14920fd272cabc18a4212d4f9","infoHashBuffer":{"type":"Buffer","data":[6,25,112,38,185,212,221,225,73,32,253,39,44,171,193,138,66,18,212,249]},"announce":[],"urlList":[]}}