{"title":"Thief The","uid":11081141,"size":21822129,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:0748169cefda0536072666239a514ac0ccdcb9f5&amp;dn=Thief+The&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Syncaine","files":-1,"time":1411408455,"description":"The best thief in the woods - it's a raccoon. He is cunning, strong and very greedy. At this time, a raccoon decided to rob the forest and collect all the gold coins. Many dangers in his way, sharp spikes, bottomless abyss, and deep rivers. But the raccoon - the best thief, he has nothing to fear, strong and greedy. A lot of gold in the forest, and the thief can not sit on their paws. Forest thief needs your help to rob the forest and become the most wealthy and happy raccoon in the world. Forward. At a meeting of joy and adventure. And do not forget to collect the gold, while no one is looking.\nThief - a joyful and cheerful adventure greedy raccoon.\nBelieve me, you will sit down on it. Simply tap the screen to jump.\nSweet and good graphics and warm subtle colors that will help you relax and get the most pleasant sensations.\nMusic in the style of rock will give you an adrenaline rush to feel real forest thief.\n\n- = Features = -\n- Stunning graphics and cartoons warm subtle colors.\n- Bring you joy and make you happy.\n- Make a double jump for the best results.\n- Dance tracks accompany you in the adventures.\n- Funny sounds studio quality.\n- Collect coins.\n- Pause to rest before the new records.\n- Get a new unusual experience.","torrent":{"xt":"urn:btih:0748169cefda0536072666239a514ac0ccdcb9f5","amp;dn":"Thief+The","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0748169cefda0536072666239a514ac0ccdcb9f5","infoHashBuffer":{"type":"Buffer","data":[7,72,22,156,239,218,5,54,7,38,102,35,154,81,74,192,204,220,185,245]},"announce":[],"urlList":[]}}