{"title":"Infinite Stratos (Season 1 Dubbed)","uid":8290229,"size":635759493,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:076c924394c344437759f6d79cda2428cc41c85d&amp;dn=Infinite+Stratos+%28Season+1+Dubbed%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"AfroDalek","files":14,"time":1364034993,"description":"In the near future, a Japanese scientist engineers a powered exoskeleton called &quot;Infinite Stratos&quot; (IS). Possessing technology and combat capabilities far more advanced than any other weapon system, the IS threatens to destabilize the world. Faced with such an overpowering weapon, the nations of the world enact the &quot;Alaska Treaty&quot;, which states that IS will never be used for military combat and that existing IS technology must be equally distributed to all nations, to prevent any one nation from dominating the others. The introduction of the IS does, however, have a major effect on society. As IS can only be operated by women, there is a shift in the power balance between men and women, where women now dominate society over men.\nTen years after IS was initially introduced, the world has entered a new age of peace. The peace is shattered, however, by Ichika Orimura, a 15-year-old Japanese boy able to operate an IS. Realizing the potential, the Japanese government forces the bewildered young man to attend the prestigious Infinite Stratos Academy, an international academy where IS pilots from all over the world are trained. Thus, he starts a busy high school life surrounded by nothing but girls who can use IS.","torrent":{"xt":"urn:btih:076c924394c344437759f6d79cda2428cc41c85d","amp;dn":"Infinite+Stratos+%28Season+1+Dubbed%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"076c924394c344437759f6d79cda2428cc41c85d","infoHashBuffer":{"type":"Buffer","data":[7,108,146,67,148,195,68,67,119,89,246,215,156,218,36,40,204,65,200,93]},"announce":[],"urlList":[]}}