{"title":"Letters to Juliet (2010) [DVD5][PAL][Eng-Spa][Subs Spa-Cat]","uid":6129081,"size":4680839168,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:07e1da3bc1fa59dafee9e6af722f8df7464b49cc&amp;dn=Letters+to+Juliet+%282010%29+%5BDVD5%5D%5BPAL%5D%5BEng-Spa%5D%5BSubs+Spa-Cat%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"webchella","files":23,"time":1296056843,"description":"Cartas a Julieta (2010) [DVD5][PAL][Eng-Spa][Subs Spa-Cat]\n &lt;a href=&quot;\nhttp://www.tripictures-spain.com/cartasajulieta/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tripictures-spain.com/cartasajulieta/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0892318/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0892318/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.elseptimoarte.net/peliculas/letters-to-juliet-3487.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.elseptimoarte.net/peliculas/letters-to-juliet-3487.html&lt;/a&gt;\n\n============\n::English::\n===========\nOriginal title: Letters to Juliet\nGenre: Drama, Romance\nLength: 104 min\nCountry: USA\nUSA release: 14/05/2010\nReleased in Spain: 08/10/2010\nReleased on DVD (rental): 26/01/2011\nDVD release (sale): 26/01/2011\nBlu-ray release: 26/01/2011\nCompany: Tripictures\nDirector: Gary Winick\nWriter: Jose Rivera, Tim Sullivan\nStarring: Amanda Seyfried, Vanessa Redgrave, Gael Garcia Bernal, Christopher Egan, Franco Nero, Oliver Platt, Luisa Ranieri\nRating: Suitable for all audiences\n\nSynopsis:\nThe simple idea of what is romantic love can lead some people to doubt its viability, its importance and, ultimately, about the courage it takes to not be afraid to take risks and decide to change your life.\n\nHall Sophie (Amanda Seyfried) is an aspiring writer of a magazine, along with her boyfriend Victor (Gael Garcia Bernal), flies from New York to Italy to experience something of the romance that really need it do to the relationship. While Victor is out, taking care of some business matters, Sofia is located in the famous courtyard of Verona lovers Juliet Capulet in Romeo and Juliet, where women from all over the world will leave Juliet Letters of lost love and unrequited . She discovers a letter written 50 years before Juliet by Claire Smith (Vanessa Redgrave) looking for a young Italian who captivated her as a teenager.\n\nTo the surprise of Sophie, your letter inspires Claire, now a grandmother, to travel to Verona in search of his lost love (Franco Nero). Accompanied by his grandson Charlie (Christopher Egan), the trio are looking all over Tuscany and discovers that they all need courage to face the love is not something easily obtained.\n\nHowever, she believes that what drives her to embark on this adventure is to advance your career. Move from being responsible for verifying the facts to become a journalist, is a big change and Sophie detects a story that could help boost her career. To be caught helping Claire to have a second chance, he discovers that reality is pursuing this story because it is running from the stories of his own life.\n\nProduction notes:\n- Movie based on the novel of the sisters Lise and Ceil Friedman.\n===========================================================\nPAL System\nAudio: Spanish Dolby Digital 5.1, English Dolby Digital 5.1\nSubtitles: Spanish, Catalan\n\nExtras:\nInteractive Menus, Scene Selection\n===========================================================\n===========\n::Spanish::\n===========\nTÃƒÂ­tulo: Cartas a Julieta\nTÃƒÂ­tulo original: Letters to Juliet\nGenero: Drama, Romance\nDuracion: 104 Min\nPaÃƒÂ­s: USA\nEstreno en USA: 14/05/2010\nEstreno en EspaÃƒÂ±a: 08/10/2010\nLanzamiento en DVD (alquiler): 26/01/2011\nEstreno en DVD (venta): 26/01/2011\nEstreno en Blu-ray: 26/01/2011\nProductora: TriPictures\nDirector: Gary Winick\nGuiÃƒÂ³n: Jose Rivera, Tim Sullivan\nReparto: Amanda Seyfried, Vanessa Redgrave, Gael Garcia Bernal, Christopher Egan, Franco Nero, Oliver Platt, Luisa Ranieri\nCalificaciÃƒÂ³n: Apta para todos los pÃƒÂºblicos\n\nSinopsis:\nLa simple idea de lo que representa el amor romÃƒÂ¡ntico puede llevar a ciertas personas a dudar acerca de su viabilidad, su importancia y, en ÃƒÂºltima instancia, acerca del valor que hace falta tener para no sentir miedo para arriesgarse y decidir cambiar tu vida.\n\nSophie Hall (Amanda Seyfried) es una aspirante a escritora de una revista que, junto con su novio VÃƒÂ­ctor (Gael Garcia Bernal), vuela desde Nueva York a Italia para vivir algo del romance que mucha falta le hace a la relaciÃƒÂ³n. Mientras VÃƒÂ­ctor estÃƒÂ¡ fuera, ocupÃƒÂ¡ndose de unos asuntos de trabajo, SofÃƒÂ­a se encuentra en el famoso patio de Verona de los amantes de Julieta Capuleto de Romeo y Julieta, donde mujeres de todas partes del mundo le dejan a Julieta cartas de amores perdidos y no correspondidos. Ella descubre una carta escrita 50 aÃƒÂ±os antes a Julieta por Claire Smith (Vanessa Redgrave) buscando a un joven italiano que la cautivÃƒÂ³ siendo adolescente.\n\nPara sorpresa de Sophie, su carta inspira a Claire, ahora abuela, para viajar a Verona en busca de su amor perdido (Franco Nero). AcompaÃƒÂ±ada por su nieto Charlie (Christopher Egan), el trÃƒÂ­o busca por toda la Toscana y descubre que la valentÃƒÂ­a que todos ellos necesitan para enfrentar el amor no es algo que se obtenga fÃƒÂ¡cilmente.\n\nSin embargo, ella cree que lo que la impulsa a embarcarse en esta aventura es avanzar en su carrera. Pasar de ser responsable de verificar los hechos a convertirse en periodista, representa un gran cambio y Sophie detecta una historia que pudiera ayudarla a impulsar su carrera. Al verse atrapada ayudando a Claire a tener una segunda oportunidad, descubre que en realidad estÃƒÂ¡ persiguiendo esa historia porque estÃƒÂ¡ huyendo de las historias de su propia vida.\n\nNotas de ProducciÃƒÂ³n:\n- PelÃƒÂ­cula basada en la novela de las hermanas Lise y Ceil Friedman.\n===========================================================\nSistema: PAL\nAudio: EspaÃƒÂ±ol Dolby Digital 5.1, InglÃƒÂ©s Dolby Digital 5.1\nSubtitulos: EspaÃƒÂ±ol, CatalÃƒÂ¡n\n\nExtras:\nMenus Interactivos, Seleccion de Escenas \n===========================================================","torrent":{"xt":"urn:btih:07e1da3bc1fa59dafee9e6af722f8df7464b49cc","amp;dn":"Letters+to+Juliet+%282010%29+%5BDVD5%5D%5BPAL%5D%5BEng-Spa%5D%5BSubs+Spa-Cat%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07e1da3bc1fa59dafee9e6af722f8df7464b49cc","infoHashBuffer":{"type":"Buffer","data":[7,225,218,59,193,250,89,218,254,233,230,175,114,47,141,247,70,75,73,204]},"announce":[],"urlList":[]}}