{"title":"Sexually Broken--Hot Filipina Mia Li Bound, Oiled, Face Fucked a","uid":10121916,"size":1474854173,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:08035ba1311495969721dcc374eae117bb124b8e&amp;dn=Sexually+Broken--Hot+Filipina+Mia+Li+Bound%2C+Oiled%2C+Face+Fucked+a&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"merzedes","files":-1,"time":1399684503,"description":"\n\n\nHot Filipina Mia Li is Bound, Oiled, Brutally Face Fucked and drilled with cock! Made to Cum and Cum | Mia Li | Matt Williams\n\nMay 9, 2014\n\n\niPod, Low and High bitrate MP4 + Pics.\n\n\nSexually Broken is happy to bring you yet another fresh face to its growing list of superstar models. Welcome Mia Li, this tan, sexy, big titted Filipina is as hot as they come. With amazing puffy blow job lips, an ass to die for and a throat for sucking cock, she is the total package.\n\nWe have Mia bound in custom leather cuffs, bent over, with her oiled tan legs spread while wearing her sexy high heels. Mia's hands are bound to a pole and her neck is attached so she can not back away or move from the cock that is about to deeply fuck her face. Her perfect ass is sticking out just begging for attention as she struggles in futility.\n\nHard cock steps up and a quick slap to the face puts her in the right frame of mind. We make her jack off the hard cock with oil as she watches it grow in her hands. Mia knows she is making the cock harder and harder and soon it is going to brutally fuck her pretty face into subspace. The cock pushes pass her huge blow job lips and into the back of her throat as a huge black cock starts fucking her helpless pussy from behind. As she moans we push the cock deeper down her throat and now it is on!\n\nCompletely helpless in leather and metal bondage, we destroy Mia with cock. We brutally fuck her pretty face, while destroying her wet pussy with hard big cock. She moans and gags on cock, she fights for air and soon deepthroat spit covers her pretty face as the cock wrecks her brain. Her eyes focus and unfocus as the cocks continue to fuck up our helpless Pacific Island girl. Both studs breed her pussy hole as the cocks cum and come hard inside our broken slut. In the end liquid is oozing out of every hole and poor Mia stars off into subspace, still shaking from the orgasms that we just stole from her powerless body. Cock.\n\nScreens &lt;a href=&quot;\nhttp://sexuallybroken.com/sexual/bondage/2014/05_09mli3/SexuallyBroken-Mia-Li-Matt-Williams-Hot-Filipina-Mia-Li-is-Bound-Oiled-Brutally-Face-Fucked-and-drilled-with-cock-Made-to-Cum-and-Cum.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://sexuallybroken.com/sexual/bondage/2014/05_09mli3/SexuallyBroken-Mia-Li-Matt-Williams-Hot-Filipina-Mia-Li-is-Bound-Oiled-Brutally-Face-Fucked-and-drilled-with-cock-Made-to-Cum-and-Cum.php&lt;/a&gt;\n\n14 000 down, but how much more to come ?? You decide ;) \n\nThe more you appreciate it, the more we want to do it. Can we get to 15k ??? \n\nWell, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)\n\n\nAny Questions ?? Read our FAQ!!\n &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:08035ba1311495969721dcc374eae117bb124b8e","amp;dn":"Sexually+Broken--Hot+Filipina+Mia+Li+Bound%2C+Oiled%2C+Face+Fucked+a","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"08035ba1311495969721dcc374eae117bb124b8e","infoHashBuffer":{"type":"Buffer","data":[8,3,91,161,49,20,149,150,151,33,220,195,116,234,225,23,187,18,75,142]},"announce":[],"urlList":[]}}