{"title":"Study of the Gospel of John - Dr. Samuel C. Gipp","uid":11773627,"size":414172,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:088fc47e1655af46436145ad7599ea0b9cc9ff12&amp;dn=Study+of+the+Gospel+of+John+-+Dr.+Samuel+C.+Gipp&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"starxteel","files":1,"time":1427178843,"description":"THE THEME OF THE GOSPEL OF JOHN is to believe on Jesus Christ and through that belief obtain your eternal salvation. John makes this very clear in his statement on why he wrote the book as quoted above from John 20:31.\n\nIn order to direct his readers to salvation, John emphasizes the deity of Jesus Christ. For this reason, of the four gospels, this gospel is the one which most upsets Liberals. They like to group Matthew, Mark and Luke together in what they call the ?synoptic gospels.? This leaves John to stand alone as though it?s pedigree was tarnished. Nothing could be farther from the truth.\n\nThey have another reason to prefer the other gospels to John. The word ?believe,? in some form appears vastly more times in John?s gospel than it does in the other three...\n\nThis book is a Bible believer's investigation into both the light and the deeper truths of John's gospel. A great tool for Bible study, this book is ring-bound for easy side-by-side use with the scripture.\n\n\nAbout the author:\nDr. Gipp is a former pastor, an evangelist, teacher, author and Bible conference speaker. He has the unique ability to digest large amounts of information and then present it in an analytical, understandable, format. His humerous, informative and forceful preaching style make him popular with all ages and keeps him in demand as a Revivalist and Bible conference speaker","torrent":{"xt":"urn:btih:088fc47e1655af46436145ad7599ea0b9cc9ff12","amp;dn":"Study+of+the+Gospel+of+John+-+Dr.+Samuel+C.+Gipp","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"088fc47e1655af46436145ad7599ea0b9cc9ff12","infoHashBuffer":{"type":"Buffer","data":[8,143,196,126,22,85,175,70,67,97,69,173,117,153,234,11,156,201,255,18]},"announce":[],"urlList":[]}}