{"title":"Horse Nutrition Coursera","uid":8230332,"size":671948497,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:09e0ced45bf3b18b83f677bf6c188003e7524cfc&amp;dn=Horse+Nutrition+Coursera&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":null,"files":24,"time":1362713082,"description":"Equine Nutrition\nProf. Jo-Anne Murray\nUniversity of Edinburgh\n\n\nThis course will cover many aspects of equine nutrition ranging from anatomy and physiology of the gastrointestinal tract to dietary management of horses/ponies affected with nutrition-related disorders. This is course is designed for self-directed study with minimal tutor input, and as such emphasis is placed upon peer discussions of the topics presented in each section of the course. This course is not designed to have a large amount of tutor input as this is an open access course that attracts tens of thousands of participants. However, tutors will endeavour to answer the main queries relating to the understanding of the lecture materials and to provide a summary of the key questions raised in each of the weekly topics and clarification of any misunderstandings.\n\n\nCourse Syllabus\n\nWeek 1: Anatomy and physiology of the equine gastrointestinal tract\n The expectation is that the course participants will come from varied backgrounds in relation to their previous experience of gastrointestinal tract anatomy and physiology.  Consequently, this course begins with consideration of digestive anatomy and physiology in equids.  The learning materials provided are directed towards ensuring a good understanding of equine digestive anatomy and physiology. \n\n\nWeek 2: Nutrient digestion in the equine gastrointestinal tract\n The learning materials during this period will focus on nutrient digestion in equids and will consider nutrient digestion in the various segments of the gastrointesintal tract.  Discussion should focus on considering the limitations of the equid gastrointestinal tract in relation to nutrient digestion. \n\n\nWeek 3: Equine nutrient sources and feeding management\n This part of the course will consider various nutrient sources for equids. Learning materials will be provided on various feedstuffs utilised in equine diets.  These various nutrient sources for horses will be discussed, with emphasis placed on the health and welfare issues surrounding the inclusion of various types of feedstuffs in horse diets. Discussions should involve considering how nutrients are digested within the gastrointestinal tract and how knowledge of this can enhance the dietary management of equids to ensure good health, maximise performance and prevent nutrition-related diseases/disorders. \n\n\nWeek 4: Equine dietary management\n This week of the course will explore the nutrient requirements of equids and the dietary management of these animals. Discussions should focus around considering how modern feeding practices do not always consider the anatomy and physiology of the equid digestive tract. \n\n\nWeek 5: Equine clinical nutrition\n This part of the course will focus on evaluating feeding strategies for the management and prevention of some nutrition-related diseases/disorders in equids; for example, obesity, laminitis, older horses with dental issues etc. Discussions should focus on the dietary management of individuals affected with nutrition-related problems.","torrent":{"xt":"urn:btih:09e0ced45bf3b18b83f677bf6c188003e7524cfc","amp;dn":"Horse+Nutrition+Coursera","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09e0ced45bf3b18b83f677bf6c188003e7524cfc","infoHashBuffer":{"type":"Buffer","data":[9,224,206,212,91,243,177,139,131,246,119,191,108,24,128,3,231,82,76,252]},"announce":[],"urlList":[]}}