{"title":"Art Tatum - The Tatum Group Masterpieces - Vol. 7 - FLAC","uid":5370804,"size":238007603,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0c5736e3cfa2723faae96c5eb6b7c0b78f7fbf33&amp;dn=Art+Tatum+-+The+Tatum+Group+Masterpieces+-+Vol.+7+-+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"aiel1","files":13,"time":1266417179,"description":"Art Tatum\nThe Tatum Group Masterpieces, Vol. 7\n1991\nFLAC\n\n\nPersonnel:\nArt Tatum\nBuddy DeFranco\nRed Callendar\nBill douglass\n\n\n  1. Deep Night (Album Version)\n  2. This Can't Be Love\n  3. Memories Of You\n  4. Once In A While\n  5. A Foggy Day\n  6. Lover Man\n  7. You're Mine You\n  8. Makin' Whoopee\n  9. Deep Night (Alternate Take)\n10. Once In A While (Alternate Take)\n11. This Can't Be Love (Alternate Take 2)\n\n\nThank you.  enjoy!\n\n--\nArt Tatum was among the most extraordinary of all jazz musicians, a \n\npianist with wondrous technique who could not only play ridiculously \n\nrapid lines with both hands (his 1933 solo version of &quot;Tiger Rag&quot; sounds \n\nas if there were three pianists jamming together) but was harmonically 30 \n\nyears ahead of his time; all pianists have to deal to a certain extent \n\nwith Tatum's innovations in order to be taken seriously. Able to play \n\nstride, swing, and boogie-woogie with speed and complexity that could \n\nonly previously be imagined, Tatum's quick reflexes and boundless \n\nimagination kept his improvisations filled with fresh (and sometimes \n\nfuturistic) ideas that put him way ahead of his contemporaries.\n\nBorn nearly blind, Tatum gained some formal piano training at the Toledo \n\nSchool of Music but was largely self-taught. Although influenced a bit by \n\nFats Waller and the semi-classical pianists of the 1920s, there is really \n\nno explanation for where Tatum gained his inspiration and ideas from. He \n\nfirst played professionally in Toledo in the mid-'20s and had a radio \n\nshow during 1929-1930. In 1932 Tatum traveled with singer Adelaide Hall \n\nto New York and made his recording debut accompanying Hall (as one of two \n\npianists). But for those who had never heard him in person, it was his \n\nsolos of 1933 (including &quot;Tiger Rag&quot;) that announced the arrival of a \n\ntruly major talent. In the 1930s, Tatum spent periods working in \n\nCleveland, Chicago, New York, Los Angeles, and (in 1938) England. \n\nAlthough he led a popular trio with guitarist Tiny Grimes (later Everett \n\nBarksdale) and bassist Slam Stewart in the mid-'40s, Tatum spent most of \n\nhis life as a solo pianist who could always scare the competition. Some \n\nobservers criticized him for having too much technique (is such a thing \n\npossible?), working out and then keeping the same arrangements for \n\nparticular songs, and for using too many notes, but those minor \n\nreservations pale when compared to Tatum's reworkings of such tunes as \n\n&quot;Yesterdays,&quot; &quot;Begin the Beguine,&quot; and even &quot;Humoresque.&quot; Although he was \n\nnot a composer, Tatum's rearrangements of standards made even warhorses \n\nsound like new compositions.\n\nArt Tatum, who recorded for Decca throughout the 1930s and Capitol in the \n\nlate '40s, starred at the Esquire Metropolitan Opera House concert of \n\n1944 and appeared briefly in his only film in 1947, The Fabulous Dorseys \n\n(leading a jam session on a heated blues). He recorded extensively for \n\nNorman Granz near the end of his life in the 1950s, both solo and with \n\nall-star groups; all of the music has been reissued by Pablo on a six-CD \n\nbox set. His premature death from uremia has not resulted in any loss of \n\nfame, for Art Tatum's recordings still have the ability to scare modern \n\npianists. ~ Scott Yanow, All Music Guide","torrent":{"xt":"urn:btih:0c5736e3cfa2723faae96c5eb6b7c0b78f7fbf33","amp;dn":"Art+Tatum+-+The+Tatum+Group+Masterpieces+-+Vol.+7+-+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c5736e3cfa2723faae96c5eb6b7c0b78f7fbf33","infoHashBuffer":{"type":"Buffer","data":[12,87,54,227,207,162,114,63,170,233,108,94,182,183,192,183,143,127,191,51]},"announce":[],"urlList":[]}}