{"title":"Greenland is Melting - Our Hearts are Gold, Our Grass is Blue (2","uid":7966646,"size":65764525,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0ed3a2b3d60440b7ba774cdc9150fdda939439df&amp;dn=Greenland+is+Melting+-+Our+Hearts+are+Gold%2C+Our+Grass+is+Blue+%282&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mr_Kurtz","files":-1,"time":1356703143,"description":"Greenland is Melting - Our Hearts are Gold, Our Grass is Blue (2009) mp3\n\n\nGreenland is Melting is the Gainesville, Florida trio of Karl Seltzer, Will Dueease and Shaun Pereira and Our Hearts Are Golden is their sophomore release. Soundwise, the best way for me to describe this band would be to say that they sound like what I wanted to hear the first time I heard The Avett Brothers. They play a ragged form of folk country with a punk attitude that seems so loose and relaxed that it always seems like its on the edge of coming apart. The bands shares vocal duties on all the songs, and like the music the voices are so different that the harmonies seem like they could devolve into dischord at any minute. The thing is that the album never fell apart, and as it wore on I just kept getting pulled further and further in until what seemed strange and challenging on first listen became quirky and charming\n\nIm usually not a bluegrass fan, the closest I get is folk-punk that leans more heavily on the folk part, but Greenland Is Melting really gets me for some reason. Maybe its because they are on Paper + Plastick, which has some pretty awesome bands, but I think its more the fact that they just sound so... sincere. Their music is just so overpowering without using any drums, or electric guitar (they have an electric bass, but you've got to hear it somehow right?), their voices all harmonize perfectly together... theres really nothing bad that I can say about Greenland Is Melting, except for maybe that they arent playing anywhere near me in the coming months. Definitely check this out if you like folk, bluegrass, banjos, guitars, or heartfelt music, I promise youll love it\n\nGreenland is Melting hails from the sweaty, swampy city of Gainesville, Florida. Built on a solid foundation of folk music and combined with a shared love of harmonies and a DIY attitude, the trio dishes out their brand of honest, accessible, and singable tunes. Karl Seltzer, Shaun Pereira and Will Dueease make up the band, armed with banjos, guitars, and improvised instruments.","torrent":{"xt":"urn:btih:0ed3a2b3d60440b7ba774cdc9150fdda939439df","amp;dn":"Greenland+is+Melting+-+Our+Hearts+are+Gold%2C+Our+Grass+is+Blue+%282","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ed3a2b3d60440b7ba774cdc9150fdda939439df","infoHashBuffer":{"type":"Buffer","data":[14,211,162,179,214,4,64,183,186,119,76,220,145,80,253,218,147,148,57,223]},"announce":[],"urlList":[]}}