{"title":"Benedict Cumberbatch - Transition Completed - Lynnette Porter","uid":11685302,"size":1260256,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:11136494b774f848b98eb93914227a39c3eaf475&amp;dn=Benedict+Cumberbatch+-+Transition+Completed+-+Lynnette+Porter&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1423294580,"description":"Star Trek: Into Darkness, The Fifth Estate, 12 Years a Slave, August: Osage County, The Hobbit: The Desolation of Smaug-these would be milestones in most actors' entire career. For Benedict Cumberbatch, roles in these films are merely a year's additions to his already-vast resume. 2013 proved to be the final step in Cumberbatch's transition from respected working actor to bona fide worldwide celebrity and recipient of BAFTA Los Angeles' Britannia Award for British Artist of the Year. Like its predecessor, Benedict Cumberbatch, In Transition (MX Publishing, 2013), Benedict Cumberbatch, Transition Completed: Films, Fame, Fans explores the nature of Cumberbatch's fame and fandom while analysing his most recent roles. This in-depth performance biography does more than critique the actor's radio, stage, film, and television performances-especially his star turn in the long-awaited yet controversial third series of Sherlock. It also analyses how and why the actor's work is so memorable in each role, a perspective unique to this performance biography. Cumberbatch's role in popular culture, as much as his acting in multiple media, is well worth such scrutiny to illustrate that Benedict Cumberbatch represents both the best of acting and of the power of celebrity","torrent":{"xt":"urn:btih:11136494b774f848b98eb93914227a39c3eaf475","amp;dn":"Benedict+Cumberbatch+-+Transition+Completed+-+Lynnette+Porter","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11136494b774f848b98eb93914227a39c3eaf475","infoHashBuffer":{"type":"Buffer","data":[17,19,100,148,183,116,248,72,185,142,185,57,20,34,122,57,195,234,244,117]},"announce":[],"urlList":[]}}