{"title":"Tlatelolco Las claves de la masacre Documental with English subt","uid":4664250,"size":1065627706,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:14c438b386e8edc6bf238a5f50946ebf8be7d0e4&amp;dn=Tlatelolco+Las+claves+de+la+masacre+Documental+with+English+subt&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Humrights","files":1,"time":1232506998,"description":"Tlatelolco Las claves de la masacre \n\nde canalseisdejulio \n  &lt;a href=&quot;\nhttp://www.canal6dejulio.com/tcm.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.canal6dejulio.com/tcm.html&lt;/a&gt;\n\nA reexamination of the events surrounding the 1968 massacre of student demonstrators in La Plaza de las Tres Culturas at Tlatelolco, Mexico City\n\n\nFruto de la investigaciÃƒÂ³n de Carlos Mendoza y del equipo del Canal Seis de Julio, A.C., este video es un documental que reÃƒÂºne todos los testimonios cinematogrÃƒÂ¡ficos que se conocen sobre los sucesos del 2 de octubre y que La Jornada ha decidido poner al alcance de sus lectores a partir del 27 de septiembre en los puestos de periÃƒÂ³dicos\n\n \n\nQuizÃƒÂ¡ porque se nos advierte cuando empieza a correr la cinta que el sonido que acompaÃƒÂ±a a las escenas no es una ambientaciÃƒÂ³n a modo, sino el silbar de las balas y el bullicio angustioso que se escuchÃƒÂ³ la tarde del 2 de octubre de 1968 en la plaza de las Tres Culturas, es precisamente ese rumor de descargas una de las cosas que mÃƒÂ¡s impresionan de Tlatelolco, las claves de la masacre. El video es tambiÃƒÂ©n el primer material de una serie de tres documentales sobre episodios que han marcado la historia reciente de MÃƒÂ©xico, que La Jornada, en asociaciÃƒÂ³n con el Canal 6 de Julio, A.C., pondrÃƒÂ¡n, a partir de este viernes, en sus manos. Tlatelolco es un capÃƒÂ­tulo especialmente ominoso aÃƒÂºn no resuelto, y la intenciÃƒÂ³n es que la recopilaciÃƒÂ³n de escenas, acompaÃƒÂ±ada de la investigaciÃƒÂ³n y el anÃƒÂ¡lisis, sea una aportaciÃƒÂ³n en momentos en los que el tema ha vuelto a la agenda nacional con la apertura de los archivos y la creaciÃƒÂ³n de una fiscalÃƒÂ­a especial que investiga el lado oscuro de los movimientos sociales y polÃƒÂ­ticos de esa ÃƒÂ©poca.\n\n\nLa bÃƒÂºsqueda de estas claves tuvo como antecedente los videos BatallÃƒÂ³n Olimpia y OperaciÃƒÂ³n Galeana, dos trabajos que Carlos Mendoza y su equipo, apoyados por el escritor Carlos Montemayor -quien ha dedicado varios textos al tema, sobre todo a desmenuzar lo que al fondo de ciertas revelaciones deja ver el general Marcelino GarcÃƒÂ­a BarragÃƒÂ¡n en sus memorias-, hicieron en 1999 y 2000. En esos trabajos se muestra la presencia de los hombres del &quot;guante blanco&quot; en distintos escenarios de la matanza: la explanada, el tercer piso del edificio Chihuahua, la iglesia de Santiago Tlatelolco y en varios departamentos de los distintos inmuebles del complejo habitacional. TambiÃƒÂ©n son un esbozo de cÃƒÂ³mo se cerrÃƒÂ³ la pinza sobre los estudiantes.\n\n\nTlatelolco, las claves de la masacre, va mÃƒÂ¡s allÃƒÂ¡: identifica a jefes militares y de fuerzas especiales que participaron en los hechos y presenta un panorama de aquel complot. Reconstruye los movimientos del EjÃƒÂ©rcito aquella tarde y la actuaciÃƒÂ³n del BatallÃƒÂ³n Olimpia y de otro grupo de hombres tambiÃƒÂ©n vestidos de civil que usan la misma contraseÃƒÂ±a, el guante o paÃƒÂ±uelo blancos en la mano izquierda a lo largo de todo el movimiento estudiantil. El BatallÃƒÂ³n Olimpia, cuya participaciÃƒÂ³n en el movimiento estudiantil algunos llegaron a considerar parte del mito por la escasa informaciÃƒÂ³n oficial que habÃƒÂ­a sobre sus actividades, fue uno de los comandos que actuaron en el fuego cruzado. Su participaciÃƒÂ³n en esos sucesos fue plenamente reconocida por la SecretarÃƒÂ­a de la Defensa Nacional 25 aÃƒÂ±os despuÃƒÂ©s, es decir, en 1993.\n\nUna narraciÃƒÂ³n y un anÃƒÂ¡lisis es lo que nos entrega Tlatelolco, las claves de la masacre, cuando describe el recorrido que siguen los tres contingentes del EjÃƒÂ©rcito que tomaron posiciones en las inmediaciones de la zona; nos ubica en el lugar exacto desde donde se hicieron los primeros disparos y el desconcierto de los militares uniformados que, ante el ataque, quieren proteger a algÃƒÂºn niÃƒÂ±o, se colocan en posiciÃƒÂ³n de ataque desde pecho a tierra... buscan ubicar el origen de las rÃƒÂ¡fagas.\n\nEl video documenta los disparos que se hacen desde la sede de la Suprema Corte de Justicia de la NaciÃƒÂ³n. Es imposible que en este lugar se hubieran apostado francotiradores sin la autorizaciÃƒÂ³n de funcionarios del mÃƒÂ¡s alto nivel.Hay sustento suficiente para afirmar -se establece en el documental- que en 1968, desde el EMP y las altas esferas del gobierno se auspiciÃƒÂ³ la operaciÃƒÂ³n de grupos clandestinos que ejercieron la violencia y perpetraron actos de provocaciÃƒÂ³n contra el movimiento estudiantil.\n\nTreinta y cuatro aÃƒÂ±os despuÃƒÂ©s, es decir, este aÃƒÂ±o, Luis EcheverrÃƒÂ­a fue el primer servidor pÃƒÂºblico citado a declarar en relaciÃƒÂ³n con la matanza. En Tlatelolco, las claves de la masacre, el equipo del canalseisdejulio incluyÃƒÂ³ la filmaciÃƒÂ³n de los momentos en que el ex presidente sale de la fiscalÃƒÂ­a especial que investiga esos hechos, sobre avenida JuÃƒÂ¡rez.Un EcheverrÃƒÂ­a con rostro crispado, descompuesto, suplicÃƒÂ³ con la mirada a su equipo de seguridad que lo rescatara y de su boca saliÃƒÂ³ una ÃƒÂºnica frase: &quot;Ã‚Â¡diles que se callen!, Ã‚Â¡diles que se callen!, Ã‚Â¡cÃƒÂ¡llenlos!&quot;\n\n\nIndymedia Indypeer Noam Chomsky EZLN Zapatista Bourdieu Che Guevara Barack Obama Naomi Klein Globalisation globalization emancipation marxism anarquism human rights\nsocial justice freedom rebellion left attac critique resistance revolution Socialism politics sociology society repression social movement uprising hope change democracy capitalism solidarity history\n\nIndymedia Indypeer Noam Chomsky EZLN Zapatista Bourdieu Che Guevara Barack Obama Naomi\nKlein GlobalizaciÃƒÂ³n rebeliÃƒÂ³n resistencia revoluciÃƒÂ³n\nderechos humanos justicia social libertad rebeliÃƒÂ³n marxismo anarquismo critico izquierda\nattac socialismo politica sociologia sociedad represiÃƒÂ³n movimiento social insurrecciÃƒÂ³n cambio change capitalismo esperanza solidaridad historia \n","torrent":{"xt":"urn:btih:14c438b386e8edc6bf238a5f50946ebf8be7d0e4","amp;dn":"Tlatelolco+Las+claves+de+la+masacre+Documental+with+English+subt","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14c438b386e8edc6bf238a5f50946ebf8be7d0e4","infoHashBuffer":{"type":"Buffer","data":[20,196,56,179,134,232,237,198,191,35,138,95,80,148,110,191,139,231,208,228]},"announce":[],"urlList":[]}}