{"title":"Poets of the Fall","uid":4097205,"size":3936279506,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:15472d1293b9f8e55d44d6ff2247fb826dbd3138&amp;dn=Poets+of+the+Fall&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"potf","files":533,"time":1206383982,"description":"Finnish rockers Poets of the Fall - singer Marko, guitarist Olli and keyboardist Captain - started out their musical adventure from scratch in 2003. Marko sold everything he had to invest in pursuing the love of his life, music, with his buddies Olli and Captain. He moved into his folks&amp;#039; basement, when he couldn&amp;#039;t keep a place of his own any longer. The guys then built a little studio of their own in Captain&amp;#039;s living room for the recording and producing sessions, and kept an office \nin Olli&amp;#039;s beat up old car. The result of the recording sessions was a novel blend of pop, rock, metal and industrial sounds.\n\nThe band&amp;#039;s first single was Late Goodbye, written for the acclaimed computer game Max Payne 2. Reaching millions of people through the game, the song went number one in Finland, and earned the guys international recognition and the first prize at the G.A.N.G. Awards in 2004.\n\nTheir debut album Signs of Life went straight to #1 on the Finnish album chart in January 2005, and stayed on the chart for over a year. The next album Carnival of Rust, released in April 2006, also hit the number one spot on it&amp;#039;s first week, with the debut album still on the official Top40 chart. To date, both albums have sold platinum in Finland. The eight singles (including two radio promos) released from the albums have dominated Finnish radios, with the song Carnival of Rust being the most played Finnish song in 2006.\n\nAmong others, the trio has received the following awards:\n\n    * Best Finnish Act at MTV Europe Music Awards 2006\n    * Best Finnish Music Video of all time in TV2&amp;#039;s Musiikki-TV and Best Music Video of 2006 at The Voice (video Carnival of Rust)\n    * Two Emma Awards (the Finnish Grammys) in 2005 - the best debut album and the best new act\n    * The Bronze Muuvi and People&amp;#039;s Choice Muuvi 2006 Awards (video Carnival of Rust)\n    * Best Finnish band at the NRJ Radio Awards 2006\n    * Commercial Radio Stations&amp;#039; Newcomer of the Year Award in 2005\n\nPoets of the Fall have played successful tours in Finland, Sweden, Norway, Denmark, Germany, Estonia, Russia, Lithuania and India. The band is currently preparing for the release of their third album Revolution Roulette and the subsequent tour. \n\n\n\n- Audio\n\n00 - Playground (Marko Saaresto solo, demo album 1990-200x)\n01 - Late Goodbye (30.07.2004 Single)\n02 - Lift (09-16.09.2004 Single)\n03 - Maybe Tomorrow is a Better Day (18.12.2004 Net download)\n04 - Signs of life (19.01.2005 Album)\n05 - Carnival of Rust (22.03.2006 Single)\n06 - Carnival of Rust (12.04.2006 Album)\n07 - Sorry Go &amp;#039;Round (16.08.2006 Single)\n08 - Locking Up The Sun (29.10.2006 Single)\n09 - The Ultimate Fling (06.02.2008 Single)\n\n- Lyrics\n\n- Music Videos\n-- Clip\n-- Other\n\n- Bonus\n\nMarkus Kaarlonen (Captain)","torrent":{"xt":"urn:btih:15472d1293b9f8e55d44d6ff2247fb826dbd3138","amp;dn":"Poets+of+the+Fall","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"15472d1293b9f8e55d44d6ff2247fb826dbd3138","infoHashBuffer":{"type":"Buffer","data":[21,71,45,18,147,185,248,229,93,68,214,255,34,71,251,130,109,189,49,56]},"announce":[],"urlList":[]}}