{"title":"Johnny Winter-Live Bootleg Series, Vol. 2(2008)[EAC-FLAC][TWR122","uid":4847799,"size":409692049,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:165bcf2c6c16903eb2605b19bdd72d4312c781da&amp;dn=Johnny+Winter-Live+Bootleg+Series%2C+Vol.+2%282008%29%5BEAC-FLAC%5D%5BTWR122&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"thewall68","files":18,"time":1239752557,"description":"Releaser: thewall\n\nExtractor: EAC 0.99 prebeta 4  \nRead Mode: Secure with NO C2, accurate stream, disable cache.\nCodec: Flac 1.2.1;  Level 8  \nSource: Original CD \nArtwork:  Full Scans 300dp \n\n\nProduct Description\n\nLive Bootleg Series Vol. 2 features Winter's take on songs by legends like B.B. King, Mose Allison, Jimi Hendrix, and Robert Johnson as well as a song by obscure bluesman Willie Brown, and a lone Winter original. Winter's performances here are reckless, rockin', and a heck of a lot of fun. Winter's own &quot;Black Cat Bone,&quot; for instance, is a Chicago-style rave-up with dancing fretwork and a steady shuffling beat, complimented by Paris' solid harp playing. Paris and Bobby T add a wide, loping groove to Allison's &quot;Parchman Farm,&quot; Johnny laying his excited leads atop the rhythm.\n\nThe classic B.B. King song &quot;Rock Me Baby&quot; features Winter's bluesy Texas drawl belting out the lyrics, supported by some frenetic riffing and booming drumbeats. It's the obscure Willie Brown cover, &quot;Mississippi Blues,&quot; that acts as the centerpiece of Live Bootleg Series Vol. 2, however. With Paris blastin' away at the harp, Winter uses every inch of the 15-minute performance to paint a complex portrait of the blues, combining his passionate vocals with a variety of single-note leads, incredible slidework, and tough riffs. Robert Johnson's &quot;Crossroads&quot; is guitar-driven romp across the Delta, while Hendrix's &quot;Red House&quot; is the perfect showcase for Winter's explosive guitar technique.\n\n\nThe Reverend's Bottom Line\n\nAlthough Live Bootleg Series Vol. 2 only features six songs, all of 'em are real barn-burners, and only one clocks in at less than seven-minutes-plus, leaving plenty of time for Winter's extended slide-guitar jams. The album lives up to its &quot;bootleg&quot; status with less-than-pristine sound quality ... OK, so most songs sound like they're being played in a tin can ... and the album itself offers little or no information on the performances included, such as date or venue. Minor notes, to be sure, 'cause the music is what matters. Fans of guitar blues and blues-rock certainly won't be disappointed ... just turn up the volume and let Johnny Winter rock the house! \n\n(Friday Music)\n\n\nIf you are a fan of the Blues - or simply a Guitar fan in general, GET THIS DISC, as well as &quot;Live Bootleg Series Vol. 1&quot;. You will NOT be disappointed - trust me! Johnny's rare/live version of the Jimi Hendrix classic &quot;Red House&quot;, is worth the modest (Amazon) price of the disc itself. Johnny's playing is on fire here performing the blues classics &quot;Parchman Farm&quot; &amp; &quot;Mississippi Blues&quot;. If you know nothing about Johnny Winter - this set would be a fantastic place to start. Warning: Once you get hooked on Mr. Winter's legendary slide guitar style (and you will), you'll want to collect everything he has officially released for your personal library...\n\n[Amazon user]\n\n\n\nTracks\n\n1.: Black Cat Bone\n2.: Parchman Farm\n3.: Rock Me Baby\n4.: Mississippi Blues\n5.: Crossroads\n6.: Red House (bonus track)","torrent":{"xt":"urn:btih:165bcf2c6c16903eb2605b19bdd72d4312c781da","amp;dn":"Johnny+Winter-Live+Bootleg+Series%2C+Vol.+2%282008%29%5BEAC-FLAC%5D%5BTWR122","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"165bcf2c6c16903eb2605b19bdd72d4312c781da","infoHashBuffer":{"type":"Buffer","data":[22,91,207,44,108,22,144,62,178,96,91,25,189,215,45,67,18,199,129,218]},"announce":[],"urlList":[]}}