{"title":"Regular Polytopes H.S.M. Coxeter (Dover)","uid":11723957,"size":6301335,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1884a4b6e9a43b73ca6deab331c99e3260649a7c&amp;dn=Regular+Polytopes+H.S.M.+Coxeter+%28Dover%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"heliiaruy","files":3,"time":1424982419,"description":" 350 pages\n\nPublisher: Dover Publications; 3rd edition (June 1, 1973)\n \n\nPolytopes are geometrical figures bounded by portions of lines, planes, or hyperplanes. In plane (two dimensional) geometry, they are known as polygons and comprise such figures as triangles, squares, pentagons, etc. In solid (three dimensional) geometry they are known as polyhedra and include such figures as tetrahedra (a type of pyramid), cubes, icosahedra, and many more; the possibilities, in fact, are infinite! H. S. M. Coxeter's book is the foremost book available on regular polyhedra, incorporating not only the ancient Greek work on the subject, but also the vast amount of information that has been accumulated on them since, especially in the last hundred years. The author, professor of Mathematics, University of Toronto, has contributed much valuable work himself on polytopes and is a well-known authority on them.\nProfessor Coxeter begins with the fundamental concepts of plane and solid geometry and then moves on to multi-dimensionality. Among the many subjects covered are Euler's formula, rotation groups, star-polyhedra, truncation, forms, vectors, coordinates, kaleidoscopes, Petrie polygons, sections and projections, and star-polytopes. Each chapter ends with a historical summary showing when and how the information contained therein was discovered. Numerous figures and examples and the author's lucid explanations also help to make the text readily comprehensible.\nAlthough the study of polytopes does have some practical applications to mineralogy, architecture, linear programming, and other areas, most people enjoy contemplating these figures simply because their symmetrical shapes have an aesthetic appeal. But whatever the reasons, anyone with an elementary knowledge of geometry and trigonometry will find this one of the best source books available on this fascinating study.\n\nwithout further ado","torrent":{"xt":"urn:btih:1884a4b6e9a43b73ca6deab331c99e3260649a7c","amp;dn":"Regular+Polytopes+H.S.M.+Coxeter+%28Dover%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1884a4b6e9a43b73ca6deab331c99e3260649a7c","infoHashBuffer":{"type":"Buffer","data":[24,132,164,182,233,164,59,115,202,109,234,179,49,201,158,50,96,100,154,124]},"announce":[],"urlList":[]}}