{"title":"TRESemmé presents A Cut Above - Episode 1 .avi","uid":8209853,"size":473233850,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:19902c44a64b1e8094d32611f17b2f5f0b423089&amp;dn=TRESemm%26eacute%3B+presents+A+Cut+Above+-+Episode+1+.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"joshugun","files":1,"time":1362217598,"description":"For the first time ever in India, a talent hunt show based on hairstyling is being launched by zoOm. A Cut Above on zoOm, will give budding stylists a chance to prove that they are a cut above the rest in the world of hairstyling. Renowned celebrity hairstylists Aalim Hakim, Rod Anker and Natasha Naegamvala will lead the hunt for the most talented young fingers across the country, mentoring and judging the shortlisted contestants to finally select a winner who is a cut above. \nRaised on a glamorous diet of Movies, Media and Fashion the urban Indian youth are more style conscious today than ever and believe in looking their best to face the world. Hairstyling has evolved over the years to become a serious profession that is considered both stylish and aspirational. From contemporary runway looks to classic cuts, a hairstylist is ever learning and adapting new trends to keep their clients looking great!\nContestants of the show stand a chance to get shortlisted for the show on the basis of their their technical skills, knowledge &amp; creativity. Their only aim - cut through the competition and make a grand entry into the glamorous world of fashion and styling.","torrent":{"xt":"urn:btih:19902c44a64b1e8094d32611f17b2f5f0b423089","amp;dn":"TRESemm%26eacute%3B+presents+A+Cut+Above+-+Episode+1+.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"19902c44a64b1e8094d32611f17b2f5f0b423089","infoHashBuffer":{"type":"Buffer","data":[25,144,44,68,166,75,30,128,148,211,38,17,241,123,47,95,11,66,48,137]},"announce":[],"urlList":[]}}