{"title":"BROUSKO 138","uid":9897917,"size":1130277692,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:19d09a073d346a2fffb238d1267cd63e08332c5c&amp;dn=BROUSKO+138&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GioXara","files":-1,"time":1396735870,"description":"BROUSKO EPISODIO 138 DVD RIP\n\nPerilipsi:\n\nMegales anatropes sth seira mprousko afou o Shfhs tha einai akoma eksafanismenos apo olous kai apo olh thn oikogeneia tou kai me ton mono anthrwpo pou tha epikoinwnhsei einai h Melina.\nH Melina otan tha mathei apo ton Shfh th meria opou krybetai tha treksei amesws na ton brei kai meta apo mia seira problhmatwn alla kai gegonotwn tha anagkastei na meinei mia nyxta mazi tou.H ekplhksh tha erthei sth Melina apo ton Axillea afou einai toso erwteumenos kai tha parei thn apofash na paei thn brei aproeidopoihta sta Xania.\nOtan o Axilleas tha anakalypsei oti h Melina den exei meinei sth Basilikh h mia parekshghsh erxetai pisw apo thn allh opou kai sto telos tha katalabei oti emeine h Melina mia nyxta mazi me ton Shfh.Apo th meria ths Anastasias pleon ta pragmata den einai toso kala afou einai rakos me thn eksafanish tou aderfou ths.O Manwlios panw sta neura tou ksestomizei megales apeiles oti tha skotwsei thn Kwnstantina kai h Kwnstantina sthn apognwsh ths tha fwnaksei gia bohtheia th Dafnh mazi me to Marko.\nO Mhnas kai o Markos exoun ena poly asxhmo epeisodio metaksy tous afou tha sygkroustoun para poly asxhma kai to apotelesma auths ths sygkroushs tha einai oti tha perasoun mia nyxta sto astynomiko tmhma.\n To therio tou problhmatos ths yiothesias katakyrieuei to Nektario afou h Dhmhtra tha tou deiksei th fwtografia pou einai mono mazi me to didymo adelfo tou,auth h fwtografia tha katakermatisei to Nektario opou tha tou prokalesei para poly megalh sygkinhsh.","torrent":{"xt":"urn:btih:19d09a073d346a2fffb238d1267cd63e08332c5c","amp;dn":"BROUSKO+138","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"19d09a073d346a2fffb238d1267cd63e08332c5c","infoHashBuffer":{"type":"Buffer","data":[25,208,154,7,61,52,106,47,255,178,56,209,38,124,214,62,8,51,44,92]},"announce":[],"urlList":[]}}