{"title":"Undead - Kirsty McKay.epub","uid":8871607,"size":2368363,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1b0df37332272c238fde8b43d26e7ab90f2f536b&amp;dn=Undead+-+Kirsty+McKay.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"420weedman","files":1,"time":1378079172,"description":"Out of sight, out of their minds: It's a school-trip splatter fest and completely not cool when the other kids in her class go all braindead on new girl Bobby. \n\nThe day of the ski trip, when the bus comes to a stop at a roadside restaurant, everyone gets off and heads in for lunch. Everyone, that is, except Bobby, the new girl, who stays behind with rebel-without-a-clue Smitty. \nThen hours pass. Snow piles up. Sun goes down. Bobby and Smitty start to flirt. Start to stress. Till finally they see the other kids stumbling back. \n\nBut they've changed. And not in a good way. Straight up, they're zombies. So the wheels on the bus better go round and round freakin' fast, because that's the only thing keeping Bobby and Smitty from becoming their classmates' next meal. It's kill or be killed in these hunger games, heads are gonna roll, and homework is most definitely gonna be late. \n\nCombining the chill of THE SHINING, the thrill ride of SPEED, the humor of SHAUN OF THE DEAD, and the angst of THE BREAKFAST CLUB, Kirsty McKay's UNDEAD is a bloody mad mash-up, a school-trip splatter-fest, a funny, gory, frighteningly good debut!\nGenre: Horror, Humor, Young Adult","torrent":{"xt":"urn:btih:1b0df37332272c238fde8b43d26e7ab90f2f536b","amp;dn":"Undead+-+Kirsty+McKay.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1b0df37332272c238fde8b43d26e7ab90f2f536b","infoHashBuffer":{"type":"Buffer","data":[27,13,243,115,50,39,44,35,143,222,139,67,210,110,122,185,15,47,83,107]},"announce":[],"urlList":[]}}