{"title":"Thomas Wolfe - Look Homeward, Angel (pdf)","uid":8672697,"size":6850479,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1c791e0d12906f20abb69e8f4155772e927e997e&amp;dn=Thomas+Wolfe+-+Look+Homeward%2C+Angel+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pharmakate","files":-1,"time":1373527346,"description":"Thomas Wolfe - Look Homeward, Angel (Scribners, 1929). 522 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\n\ndescription:\n\nThe stunning, classic coming-of-age novel written by one of America's foremost Southern writers\n\nA legendary author on par with William Faulkner and Flannery O'Connor, Thomas Wolfe published Look Homeward, Angel, his first novel, about a young man's burning desire to leave his small town and tumultuous family in search of a better life, in 1929. It gave the world proof of his genius and launched a powerful legacy.\n\nThe novel follows the trajectory of Eugene Gant, a brilliant and restless young man whose wanderlust and passion shape his adolescent years in rural North Carolina. Wolfe said that Look Homeward, Angel is &quot;a book made out of my life,&quot; and his largely autobiographical story about the quest for a greater intellectual life has resonated with and influenced generations of readers, including some of today's most important novelists. Rich with lyrical prose and vivid characterizations, this twentieth-century American classic will capture the hearts and imaginations of every reader.\n\nReview\n\n&quot;Language as rich and ambitious and intensely American as any of our novelists has ever accomplished.&quot; -- Charles Frazier, author of Cold Mountain and Thirteen Moons\n\n&quot;Look Homeward, Angel is one of the most important novels of my life. . . . It's a wonderful story for any young person burning with literary ambition, but it also speaks to the longings of our whole lives; I'm still moved by Wolfe's ability to convey the human appetite for understanding and experience.&quot; -- Elizabeth Kostova, author of The Historian\n\n&quot;Wolfe made it possible to believe that the stuff of life, with all its awe and mystery and magic, could by some strange alchemy be transmuted to the page.&quot; -- William Gay, author of The Long Home\n\n&quot;As so many other American boys had before and have since, I discovered a version of myself in Look Homeward, Angel, and I became intoxicated with the elevated, poetic prose.&quot; -- Robert Morgan, author of Gap Creek","torrent":{"xt":"urn:btih:1c791e0d12906f20abb69e8f4155772e927e997e","amp;dn":"Thomas+Wolfe+-+Look+Homeward%2C+Angel+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c791e0d12906f20abb69e8f4155772e927e997e","infoHashBuffer":{"type":"Buffer","data":[28,121,30,13,18,144,111,32,171,182,158,143,65,85,119,46,146,126,153,126]},"announce":[],"urlList":[]}}