{"title":"Gold Fields - Black Sun (2013) [FLAC]","uid":8194746,"size":338503036,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1ca7f40339822664afa724551ee14d0422831c80&amp;dn=Gold+Fields+-+Black+Sun+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1361894313,"description":"\n  Gold Fields - Black Sun (2013) [FLAC]\n\n  Released: 2013\n  Duration: 44:36\n  Genre: Pop/Rock\n  Style: Indie Electronic\n  Codec: FLAC\n  Bit Rate: ~ 1,000 kbps\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n \n  01 Meet My Friends\n  02 Dark Again\n  03 Treehouse\n  04 Happy Boy\n  05 Thunder\n  06 Ice\n  07 Closest I Could Get\n  08 The Woods\n  09 Moves\n  10 You're Still Gone\n  11 Anxiety\n\n  Gold Fields' 2013 debut album, Black Sun, is an infectious, dance-oriented release that summons the new romantic spirit, if not the moussed hair and neon blush, of such '80s bands as Duran Duran, ABC, and Spandau Ballet. Centered around the lead vocals of Mark Robert Fuller and featuring a heavy dose of guitars, keyboards, and drums, both real and electronic, Gold Fields know how craft an instantly catchy pop hook. Any fan of '80s dance-rock will certainly recognize the way Gold Fields layer disco basslines, tribal drums, and pulsing keyboards over chiming guitar lines and Fuller's languid croon. With the band's heavy use of falsetto backing vocals and symphonic percussion flourishes, cuts like &quot;Dark Again,&quot; &quot;Treehouse,&quot; and especially the sparkling &quot;Thunder&quot; often sound like lost classics of the new wave era. \n\n  Which isn't to say Gold Fields are a completely retro ensemble. On the contrary, there is a heavy modern club vibe on Black Sun, with tracks like the sinewy, sexual &quot;The Woods&quot; and the equally danceclub-friendly &quot;Moves&quot; bringing to mind more of a post-'90s new rave and EDM vibe than anything specifically '80s. In that sense, with their awareness of both dance music and indie rock traditions, Gold Fields fit well alongside such similarly inclined contemporaries as Klaxons, Passion Pit, and MGMT. Ultimately, however, if upon listening to Black Sun you suddenly get the urge to feel the wind in your pompamullet as you ride the bow of your yacht &quot;Rio&quot;-style, Gold Fields probably won't mind one bit.","torrent":{"xt":"urn:btih:1ca7f40339822664afa724551ee14d0422831c80","amp;dn":"Gold+Fields+-+Black+Sun+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ca7f40339822664afa724551ee14d0422831c80","infoHashBuffer":{"type":"Buffer","data":[28,167,244,3,57,130,38,100,175,167,36,85,30,225,77,4,34,131,28,128]},"announce":[],"urlList":[]}}