{"title":"Tricky Woo","uid":8309436,"size":30352640,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1d0d129c0446c30760af97a86cb54e836f368d37&amp;dn=Tricky+Woo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"stormcld","files":10,"time":1364441188,"description":"Mp3 Format - 128 kbps\n \nTricky Woo is a Canadian indie rock band, based in Montreal. The band consists of vocalist and guitarist Andrew Dickson, guitarist Adrian Popovich, bass guitarist Alex Crowe and drummer Patrick Sayers. The band was nominated for a Juno Award for their 1999 album Sometimes I Cry.\n The name of the band is taken from the name of a fictional pampered dog featured in James Herriot's best-selling autobiographical novel All Creatures Great and Small, which tracks the life of a country veterinarian in pre-war England. Originally formed in 1996 by Andrew Dickson, Sasha Roiz (drums) and Jon Fazakerley (bass), the band released their debut album Rock and Roll Music, Part 1 in 1997[3] on Montreal's SSG Recordings.[4] Popovich soon joined on second guitar and Eric Larock took over bass duties for their follow up album The Enemy is Real. Pat Conan replaced Roiz on the drums for the band's critically acclaimed third album Sometimes I Cry.\n\n Their 1999 album Sometimes I Cry was a nominee for Best Alternative Album at the Juno Awards of 2000. Their song &quot;Easy&quot; was featured in the Buffy the Vampire Slayer episode &quot;The Zeppo&quot;.\n\n Popovich subsequently left the band in 2000, and the band released the album Les Sables Magiques in 2001 before breaking up in 2002. The band members subsequently participated in a new project, Soft Canyon, which also included former members of Local Rabbits.\n\n Dickson, Popovich and Larock reunited with new drummer Sayers in 2004 for a cross-Canada tour, and the band followed up with the new album First Blush in 2005 with Crowe replacing Larock","torrent":{"xt":"urn:btih:1d0d129c0446c30760af97a86cb54e836f368d37","amp;dn":"Tricky+Woo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d0d129c0446c30760af97a86cb54e836f368d37","infoHashBuffer":{"type":"Buffer","data":[29,13,18,156,4,70,195,7,96,175,151,168,108,181,78,131,111,54,141,55]},"announce":[],"urlList":[]}}