{"title":"Zero Down - With A Lifetime To Pay","uid":4024248,"size":45550697,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1d177df22b44d5725f54e3d9285aa8cd8e3bf2ce&amp;dn=Zero+Down+-+With+A+Lifetime+To+Pay&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"mid_alex","files":13,"time":1202834621,"description":"Zero Down was a punk rock trio formed by former Strung Out bassist Jim Cherry, former Down by Law drummer Milo Todesco and former War Called Peace guitarist John McCree. Frontman Cherry (who was also guitarist and songwriter for Epitaph Records band Pulley) enlisted the support of Fat Wreck Chords owner Fat Mike, who released the band&amp;#039;s first (and only) album, With a Lifetime to Pay in 2001. The music was a throwback to mid-90s melodic skate punk (no surprise given the pedigree of Zero Down&amp;#039;s members), and was well-received. The band added a fourth member in August 2001, ex-Lagwagon guitarist Shawn Dewey.\n\nZero Down came to a premature demise on July 7, 2002, with the death of Jim Cherry from a life-long heart condition. Early reports suggested that Cherry died from an accidental prescription drug overdose; Fat Wreck Chords released the following statement [1] [2]:\n\n? Jim lived his life as an honest and open person and we feel that it&amp;#039;s important to share the facts with the punk rock community. Although Jim had been clean in recent months, he battled addiction with prescription drugs for a couple of years. It would seem that his addiction got the best of him, as he died from an accidental overdose of Soma (a muscle relaxer) this past weekend. Again, we send our thoughts out to Jim&amp;#039;s family and loved ones. ? \n\nHowever, in December 2002 the label released a further statement concerning Cherry&amp;#039;s death [3]:\n\n? We have the final news regarding the tragic death of Jim Cherry this past summer. Although it was earlier reported that Jim&amp;#039;s passing came as a result of substance abuse, the autopsy revealed that Jim&amp;#039;s system was clean at the time of his death. Jim had a life-long heart condition which ultimately resulted in his death on July 7th. His family informs us that he suffered from hypertension and arrhythmia; and it was major blockage of an artery that eventually took his life while he was asleep. Jim was a big part of the Fat family as well as a member of Strung Out, Zero Down, and Pulley, and he will always be remembered for his passion and songwriting. He is greatly missed... \n\n\nRipped  as MP3 at 192kbps","torrent":{"xt":"urn:btih:1d177df22b44d5725f54e3d9285aa8cd8e3bf2ce","amp;dn":"Zero+Down+-+With+A+Lifetime+To+Pay","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d177df22b44d5725f54e3d9285aa8cd8e3bf2ce","infoHashBuffer":{"type":"Buffer","data":[29,23,125,242,43,68,213,114,95,84,227,217,40,90,168,205,142,59,242,206]},"announce":[],"urlList":[]}}