{"title":"Christof Koch - Consciousness: Confessions of a Romantic Reducti","uid":8845756,"size":1009924,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1eb49d916dce837aecf3fc3953535b5e635186e1&amp;dn=Christof+Koch+-+Consciousness%3A+Confessions+of+a+Romantic+Reducti&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1377377027,"description":"What links conscious experience of pain, joy, color, and smell to bioelectrical activity in the brain? How can anything physical give rise to nonphysical, subjective, conscious states? Christof Koch has devoted much of his career to bridging the seemingly unbridgeable gap between the physics of the brain and phenomenal experience. This engaging book -- part scientific overview, part memoir, part futurist speculation -- describes Koch's search for an empirical explanation for consciousness. Koch recounts not only the birth of the modern science of consciousness but also the subterranean motivation for his quest -- his instinctual (if &quot;romantic&quot;) belief that life is meaningful.\n\nKoch describes his own groundbreaking work with Francis Crick in the 1990s and 2000s and the gradual emergence of consciousness (once considered a &quot;fringy&quot; subject) as a legitimate topic for scientific investigation. Present at this paradigm shift were Koch and a handful of colleagues, including Ned Block, David Chalmers, Stanislas Dehaene, Giulio Tononi, Wolf Singer, and others. Aiding and abetting it were new techniques to listen in on the activity of individual nerve cells, clinical studies, and brain-imaging technologies that allowed safe and noninvasive study of the human brain in action.\n\nKoch gives us stories from the front lines of modern research into the neurobiology of consciousness as well as his own reflections on a variety of topics, including the distinction between attention and awareness, the unconscious, how neurons respond to Homer Simpson, the physics and biology of free will, dogs, Der Ring des Nibelungen, sentient machines, the loss of his belief in a personal God, and sadness. All of them are signposts in the pursuit of his life's work -- to uncover the roots of consciousness.","torrent":{"xt":"urn:btih:1eb49d916dce837aecf3fc3953535b5e635186e1","amp;dn":"Christof+Koch+-+Consciousness%3A+Confessions+of+a+Romantic+Reducti","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1eb49d916dce837aecf3fc3953535b5e635186e1","infoHashBuffer":{"type":"Buffer","data":[30,180,157,145,109,206,131,122,236,243,252,57,83,83,91,94,99,81,134,225]},"announce":[],"urlList":[]}}