{"title":"Braindead 13","uid":4905406,"size":533528623,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:1efc104ebb1644ab65620d86919b0bb3d3e90a4a&amp;dn=Braindead+13&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mageknight832","files":2,"time":1242861058,"description":"Braindead 13 or Brain Dead 13 is an Interactive movie game produced by ReadySoft that was released for DOS in 1995 and later ported to consoles in 1996. Unlike Dragon's Lair and Space Ace, some of the first interactive movies which began as laserdiscs, it was released for PCs and game consoles only.\n\nThe main character is a young computer expert (Lance), who is called to fix a computer at a scary, dilapidated castle one day. After repairing a large super-computer, Lance learns of a diabolical plan to take over the world. He quickly finds himself in trouble, being chased around the castle by Fritz, a psychotic servant of Dr. Nero Neurosis, the main villain of the story and a disembodied brain. The player must guide Lance in order to defeat Dr. Neurosis and escape the castle alive.\n\nDuring gameplay exploration of the castle is freer than in most previous interactive games by showing crossroads. This leaves the route for finding the Brain Chamber up to the player. Eventually the player will arrive in the chamber to face the disembodied doctor and Fritz-Lance traps Fritz in the water tank with Neurosis's brain and flushes its contents, then flees the castle as it collapses into rubble.\n\nAlso, much like in Dragons Lair, the player has to react quickly in order to live to see the next scene. If the player fails to do so, either Fritz or something in the room will kill Lance. These deaths include, dismbowelment, decapitation, decomposition, dismeberment, etc.\n\nHowever, the player has infinite lives in the game, and after the death sequence, there is a revival sequence, whereas Lance bursts out of a coffin, given blood, etc.\n\n[IMPORTANT]\nIn order to play you must copy the file WING32.DLL from the Folder WINSETUP inside the ISO into WindowsSystem32. It will NOT run unless you do so.\n\nAs far as I know, Windows Vista is the only operating system that has this problem.\n\n[Seed Please]","torrent":{"xt":"urn:btih:1efc104ebb1644ab65620d86919b0bb3d3e90a4a","amp;dn":"Braindead+13","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1efc104ebb1644ab65620d86919b0bb3d3e90a4a","infoHashBuffer":{"type":"Buffer","data":[30,252,16,78,187,22,68,171,101,98,13,134,145,155,11,179,211,233,10,74]},"announce":[],"urlList":[]}}