{"title":"Night Of The Living Dead -Death Valley #1-4. Avatar comics 2011","uid":6678459,"size":90938301,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:1faa252f81bc5fcf6fae491f0f2dcd3e88db054c&amp;dn=Night+Of+The+Living+Dead+-Death+Valley+%231-4.+Avatar+comics+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"wowcabbage","files":-1,"time":1316110224,"description":"Night Of The Living Dead - Death Valley 2011\n#1-4\nAvatar comics\ncbr\n\nFans have demanded more, so Mike Wolfer returns to the Night of the Living Dead, but this time takes it to California! Its 1969, and one year and 1,700 miles from the devastating plague that ravaged the Eastern Seaboard of the United States. In the arid expanse of the California desert, a group of young, weekend warriors have left behind the tensions of the times and hope to escape the mundane with three days of hot sun, wild bikinis and boss dune buggies. But the desert is a harsh environment, where the unsuspecting can find danger behind every pristine, white, sand dune. This is Death Valley, where the flesh-hungry living dead wait, baking in the sun, thirsty for the blood of the living. But something else is hiding among the rocks, a secret even more gut-wrenching than the reanimated corpses of the dead which roam the sands! Written by Mike Wolfer this blood-drenched five-issue series features the return of Dheeraj (Escape of the Living Dead) Verma. Dont miss all the terrifying covers, Michael Dipascale paints the Regular edition, Mike (Gravel) Wolfer horrifies with the Wraparound cover, and twisted Matt Martin splatters the Gore covers all over the page.  MATURE THEMES","torrent":{"xt":"urn:btih:1faa252f81bc5fcf6fae491f0f2dcd3e88db054c","amp;dn":"Night+Of+The+Living+Dead+-Death+Valley+%231-4.+Avatar+comics+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1faa252f81bc5fcf6fae491f0f2dcd3e88db054c","infoHashBuffer":{"type":"Buffer","data":[31,170,37,47,129,188,95,207,111,174,73,31,15,45,205,62,136,219,5,76]},"announce":[],"urlList":[]}}