{"title":"Elan (1947) Xvid 1cd_No Subs_Indian Cinema_The Early Years_Class","uid":8641212,"size":772350803,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:20329d7e0161262d59c42a29ae73b1ec96972fb6&amp;dn=Elan+%281947%29+Xvid+1cd_No+Subs_Indian+Cinema_The+Early+Years_Class&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SaM","files":-1,"time":1372881873,"description":"Elan (1947) Xvid 1cd_No Subs_Indian Cinema_The Early Years_Classic [DDR]\n\nCast: Surendra, Munawar Sultana, Shahnawaz, Himalayawala, Reehan, Leela Misra,  Zebunissa, W.M. Khan, Rita, Shaheda\n\nDirector: Mehboob Khan\nMusic Director: Naushad, assisted by Ghulam Mohammed\nLyrics by Zia Sarhadi\nPlayback Singers:- Zohra Ambala, Amirbai Karnataki, Surendra \n\nSongs are included in MP3s\nElan (1947) 00. Title Music and Screen Credits, Naushad\nElan (1947) 01. Mere Pehaloo Mein Hai, Zohrabai, Zia Sarhadi, Naushad\t\nElan (1947) 02. Dil Ke Arman Nikaloon Main, Zohrabai, Zia Sarhadi, Naushad\nElan (1947) 03. Ek Baar Phir Se Aa Ja, Surendra, Zia Sarhadi, Naushad\nElan (1947) 04. Aaine Mein Ek Chand Si Soorat Nazar Aayi, Amirbai, Surendra, Zia Sarhadi, Naushad\nElan (1947) 05. Dekh Khuda Ki Shaan Saheli, Zohrabai, Zia Sarhadi, Naushad\nElan (1947) 06. Tera Jahan Aabad Hai Mera Jahan Barbaad Hai, Surendra Zia Sarhadi, Naushad\nElan (1947) 07. Kuch Aur Sitam Honge, Amirbai, Zia Sarhadi, Naushad\nElan (1947) 08. Allah Nigahbaan Tera Allah Nigahbaan, Amirbai, Zia Sarhadi, Naushad\nElan (1947) 09. Ae Ajal Ye Zindagi Gham Ka Zamana Tal Gaya, Amirbai, Zia Sarhadi, Naushad\nElan (1947) 10. Insaan Ki Tehzeeb Pe Ehsaan Hamara, Amirbai, Zia Sarhadi, Naushad\n\nSYNOPSIS:- Elan (1947)\nAfter the passing away of his dad, Javed lives a poor lifestyle with his widowed mom in India. Since they cannot afford to live independently, they live with his mom's younger sister, Mrs. Haque, who lives a wealthy lifestyle with her husband and son, Sajjad. Mrs. Haque is very cruel toward her sister, compelling her to leave and bring Javed up on her own. Years later Javed has grown up, has acquired a sound education, returns home, to find that his mom is learning to read and write with the help of a beautiful young woman, Nazparvar, and soon both the youngsters fall in love with each other. Javed's mom approaches Nazparvar's dad to get them married, but at the same time her sister, who is now widowed, convinces Nazparvar's dad that Sajjad would be a better choice for his daughter, as a result the marriage takes place leaving both Javed and Nazparvar heartbroken, and they go separate ways. Years later they will meet again - this time Javed will be a lawyer - while Nazparvar, who is now a mother of a young son, Riaz, will be accused of killing her husband!\n\nThe film is the story of two half brothers, the good Javed (Surendra) and the evil Sajjad (Himalayawala). Thanks to Sajjad and his mother's (Zebunissa) wealth, Javed loses his beloved (Munawar Sultana) to Sajjad. Over the years the fates and fortunes of the two brothers undergo a major transformation. Sajjad gambles away all his wealth while Javed becomes a lawyer of repute. In a fit of desperation Sajjad tries to kill his son when the son is made the beneficiary of all the property but is himself killed by his mother. His wife, however, turns down Javed's marriage proposal and instead decides to start a school in her family mansion.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 672 kbp\nVideo Resolution: 640x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 29.970\nAudio Codec: 0x0055 MPEG-1 Layer 3\nAudio Bitrate: 99kb/s VBR 48000 Hz\nAudio Streams:  2\nAudio Languages: Hindi\nRunTime  2:04:18\nSubtitles: None\nRipped by: Trinidad [DDR]   \nDuration: 2:04:18","torrent":{"xt":"urn:btih:20329d7e0161262d59c42a29ae73b1ec96972fb6","amp;dn":"Elan+%281947%29+Xvid+1cd_No+Subs_Indian+Cinema_The+Early+Years_Class","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20329d7e0161262d59c42a29ae73b1ec96972fb6","infoHashBuffer":{"type":"Buffer","data":[32,50,157,126,1,97,38,45,89,196,42,41,174,115,177,236,150,151,47,182]},"announce":[],"urlList":[]}}