{"title":"Osho_The Hidden Splendor #10_Enlightenment.mp4","uid":15113918,"size":758136759,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:2158798ddb561f0d029be7b0563db9d6c322c1b4&amp;dn=Osho_The+Hidden+Splendor+%2310_Enlightenment.mp4&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"drugarica","files":1,"time":1467031659,"description":"Osho_The Hidden Splendor\r\nch 10 Enlightenment is not an experience\r\n17 March 1987 am in Chuang Tzu Auditorium\r\nQuestion 1\r\nBELOVED OSHO,\r\nWHENEVER YOU TALK ABOUT YOUR SURGERY, OR HITTING PEOPLE HARD,\r\nI CAN SENSE WHAT YOU MEAN BY IT. YET IN ALL THESE YEARS I HAVE NEVER\r\nEXPERIENCED IT MYSELF. TO ME, YOU ARE LIKE A POTTER: I FEEL YOUR\r\nHANDS MOLDING ME, GUIDING ME, LEADING ME, STRONG AND FIRM, BUT\r\nALSO WITH SUCH TENDERNESS AND LOVE AS I HAVE NEVER EXPERIENCED\r\nBEFORE. IT IS SUCH A JOY TO BE FORMED BY YOUR GORGEOUS HANDS.\r\nBELOVED MASTER, IN MY DOUBTING MIND A QUESTION ARISES: CAN IT\r\nREALLY BE TRUE THAT YOU ARE GUIDING ME EVER SO GENTLY?\r\nPrem Nandano, each individual needs a different treatment because each individual is so\r\nunique. On the path there can be no mass surgery. ...\r\nQuestion 3\r\nBELOVED OSHO,\r\nA YEAR AGO, ON MARCH 15TH, I WAS VISITING FRIENDS IN SANTA FE.\r\nEARLY THAT MORNING, MAHAMATI AND I WERE LYING IN THE BACK OF MY\r\nVAN WHEN IT WAS STRUCK FROM BEHIND. FOLLOWING THE IMPACT I\r\nCOULDN'T BREATHE. MY NECK AND BACK WERE AFLAME WITH PAIN, AND I\r\nPANICKED. MY HAND DISCOVERED MY MALA AND THE STRUGGLE DROPPED\r\nWITH THE DEEP REMEMBRANCE OF SANNYAS, AND I RELAXED TO BE AWARE\r\nFOR DEATH. IRONICALLY, I BEGAN TO GET AIR, JUST A LITTLE, AND TOLD\r\nMATI NOT TO FREAK OUT IF I DROPPED THE BODY, BECAUSE I WAS STILL\r\nINTACT. IN THE HOSPITAL EMERGENCY ROOM, WE BOTH, SIMULTANEOUSLY,\r\nFELT YOUR PRESENCE, AND ECSTATICALLY LAUGHED, TO THE DISMAY OF\r\nTHE DOCTORS AND NURSES. FOR SEVEN WEEKS I WAS FLAT ON MY BACK,\r\nAND MY HEART FLOWERED AS NEVER BEFORE. THE SPINE WAS FRACTURED\r\nIN TWO PLACES, AND THIS WHOLE YEAR I HAVE BEEN LAZY -- DOING ART,\r\nPORTRAITS OF YOU, AND A NOVEL DEPICTING MY EXPERIENCES WITH YOU.\r\nBELOVED MASTER, I AM SO GRATEFUL TO FIND I CAN LET GO WHEN DEATH\r\nKNOCKS ON MY DOOR, AND I FEEL SO FORTUNATE TO LOOK INTO YOUR EYES\r\nONCE MORE. THANK YOU. WOULD YOU LIKE TO COMMENT ON MY\r\nEXPERIENCE? WAS IT REALLY YOU WHO CAME TO THE EMERGENCY ROOM,\r\nOR JUST OUR LET-GO TO EXISTENCE AND LIFE?\r\nAtmo Shahid, my whole work -- day in, day out -- is going from one emergency room to\r\nanother emergency room. I don't have any other work. I have so many people in the world, and\r\nthey are so expert in creating emergencies, that I am running like crazy. Why do you think I\r\nhave told you now to drop the mala and orange clothes? Because it is getting too much! --\r\nrunning, without any rest....\r\nQuestion 4\r\nBELOVED OSHO,\r\nAT THE MOMENT, MY LIFE SEEMS TO BE AN ENDLESS DIVE INTO DEEP,\r\nDARK VALLEYS OF GREED, JEALOUSY, SELF-CONDEMNATION; DEEP PAIN, AND\r\nFEELING VERY LOST. COMING OUT OF THESE VALLEYS, I FEEL REFRESHED,\r\nMORE CLEAR -- LIKE AFTER A THUNDERSTORM IN HOT SUMMER. BUT THE\r\nNEXT VALLEY FOLLOWS SOON AFTERWARDS. ARE THESE DARK VALLEYS A\r\nSORT OF CLEANING, AND HAS THIS TO HAPPEN AGAIN AND AGAIN?\r\n\r\nask Google for this book free!","torrent":{"xt":"urn:btih:2158798ddb561f0d029be7b0563db9d6c322c1b4","amp;dn":"Osho_The+Hidden+Splendor+%2310_Enlightenment.mp4","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2158798ddb561f0d029be7b0563db9d6c322c1b4","infoHashBuffer":{"type":"Buffer","data":[33,88,121,141,219,86,31,13,2,155,231,176,86,61,185,214,195,34,193,180]},"announce":[],"urlList":[]}}