{"title":"RAM Manager PRO v6.1.0 [Paid] [APK]","uid":10186677,"size":329598,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:216b000a426232f7dc7a4cda0e6a4f5bf300ada6&amp;dn=RAM+Manager+PRO+v6.1.0+%5BPaid%5D+%5BAPK%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"AtomTPB","files":4,"time":1400591066,"description":"Description:\nThis application optimizes the RAM of all android devices and improves the performance in all directions. RAM Manager manages your memory, makes your system as fast as possible and sets the best balance between enough free memory and running applications in memory. This application is the best solution for all who have problem with the free memory, with the multitasking, with slow swapping between applications or with low performance.\n\n\nFeatures:\nâ˜…Balance - Option which makes your RAM to the best optimization, this option is for everyday use. Use this option if you want to have fast device without any lags.\nâ˜…More free memory - This option is on the same basis as Balance, but gives you more free memory and a bit reduces multitasking.\nâ˜…More multitasking - This option is on the same basis as Balance, but gives you more multitasking and a bit reduces free memory.\nâ˜…Hard gaming - Option which stabilizes your RAM for playing hardest games. Use this option for games which lag on your device. Your games will run smooth without lags.\nâ˜…Hard multitasking - Option for users who are really hard working on their devices. You can have a lot of running apps and quickly switch between them without any lags.\nâ˜…Default - This option reverts your RAM to your default settings, which you had before you installed this app.\nâ˜…Custom - This option allows you to set your own settings.\nâ˜…Set on boot - Saves all your settings on boot.\nâ˜…Lock launcher in memory - Prevents restarting your launcher.\nâ˜…Clean memory - Cleans your memory.\nâ˜…Clean drop caches - Cleans page cache, dentries and inodes.\nâ˜…VM Heap size - It is a maximal size in MB which application can use for its data.\nâ˜…Swap file - Improves performance but may degrade your SD card life.\nâ˜…Memory info - Shows information of your memory.\nâ˜…Memory graph - Shows your free and used memory.\nâ˜…Widget (Light or dark theme)\nâ˜…You can switch between all options without rebooting\nâ˜…Languages - English, Czech, Slovak, Korean, Italian, Croatian, Polish, French, Russian, Greek, Chinese, Simplified Chinese, Turkish, Spanish\n\n\nWhat's New:\n- Used new VM values\n- Added control for VM Min free KBytes\n- Added control for VM OOM kill allocating task\n- Caches are now dropped immediately when screen is off\n- Fixed minor issue during creating swap file\n\n\nRequired Android O/S : 2.1+","torrent":{"xt":"urn:btih:216b000a426232f7dc7a4cda0e6a4f5bf300ada6","amp;dn":"RAM+Manager+PRO+v6.1.0+%5BPaid%5D+%5BAPK%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"216b000a426232f7dc7a4cda0e6a4f5bf300ada6","infoHashBuffer":{"type":"Buffer","data":[33,107,0,10,66,98,50,247,220,122,76,218,14,106,79,91,243,0,173,166]},"announce":[],"urlList":[]}}