{"title":"Bob Marley~One Love at Studio One 1964-1966~2CD [VBR] {MKOP}","uid":7562422,"size":179206626,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2387664977f25f52b817e2eb0530d59fc5442ae7&amp;dn=Bob+Marley%7EOne+Love+at+Studio+One+1964-1966%7E2CD+%5BVBR%5D+%7BMKOP%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mudmashers","files":44,"time":1345776102,"description":"Bob Marley and The Wailers~One Love at Studio One 1964-1966~2CD (Heartbeat) [VBR] {MKOP}\n\nThis two-disc set from Heartbeat Records contains the earliest recordings of the Wailers (Bob Marley, Bunny Wailer, and Peter Tosh, plus, at this point in time, Junior Braithwaite and Beverly Kelso), and while its greatest value is probably archival, there is a wonderful sense of musical exploration and joy in these tracks, which include original compositions, ska covers of American hits, doo wop \nexercises, island mento standards, spirituals and gospel pieces, and even renditions of songs by Bob Dylan and the Beatles. \n\nBetween 1964 and 1966 the Wailers cut some 100 of these nascent sides at Clement Dodd's Studio One, most of them done on Dodd's Ampex 350 portable one-track tape machine, which means these are largely live-in-the-studio performances, many of them with backing from the Skatalites. Energetic and ragged, these recordings show a group that was not quite yet dominated by Marley, although his compositions were clearly the Wailers' strongest fare, beginning with his &quot;Simmer Down,&quot; the group's first Jamaican hit in 1964. Marley was by no means the best singer (just the most charismatic) in the group, as evidenced by Braithwaite's delicate and emotional lead vocal on the gorgeous &quot;It Hurts to Be Alone,&quot; which also features a nice guitar line from Ernest Ranglin (which telegraphs that the song was actually a clever rewrite of the Impressions' &quot;I'm So Proud&quot;). \n\nBy the time of 1965's &quot;One Love,&quot; Dodd had upgraded to a two-track machine, and songs like &quot;Rude Boy,&quot; the lovely soul ballad &quot;I'm Still Waiting,&quot; and &quot;I'm Gonna Put It On&quot; (featuring guitarist Dwight Pinkney and his band, the Sharks) began to hint at what the Wailers would become. With 1965's rude boy anthem &quot;Jailhouse,&quot; the Wailers began working with the new and slower rocksteady rhythms, and while there were still plenty of horn lines present, the manic, skipping ska pace becomes less prominent. In early 1966, with Marley temporarily living in the U.S., Tosh and Bunny recorded the ominous gospel gem &quot;Sinner Man,&quot; as well as Bunny's striking &quot;He Who Feels It Knows It&quot; and Peter's attempt at a straight rock recording, &quot;Can't You See.&quot; Also worth noting here is Bunny's version of Dylan's &quot;Like a Rolling Stone,&quot; which keeps only the song's chorus while rewriting the verses with lines like &quot;Time like a scorpion stings without warning.&quot; With Marley back from the States later in 1966, the group recorded his &quot;Bend Down Low,&quot; a song that prefigures the group's later work with producer Lee &quot;Scratch&quot; Perry. \n\nIn all, there are some 40 tracks here charting this formative period in the Wailers' creative development, and while casual Marley fans may find it all a bit half-baked and primitive, there is an undeniable joy in the music on display, and its pure archival value is immense. This set expands by a couple of tracks Heartbeat's earlier release under the same title from 1991. ~Steve Leggett (Allmusic)\n\nMusic Keep On Playing*Thank You Seeders","torrent":{"xt":"urn:btih:2387664977f25f52b817e2eb0530d59fc5442ae7","amp;dn":"Bob+Marley%7EOne+Love+at+Studio+One+1964-1966%7E2CD+%5BVBR%5D+%7BMKOP%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2387664977f25f52b817e2eb0530d59fc5442ae7","infoHashBuffer":{"type":"Buffer","data":[35,135,102,73,119,242,95,82,184,23,226,235,5,48,213,159,197,68,42,231]},"announce":[],"urlList":[]}}