{"title":"Women, Disability and Mental Distress (2015) {=IMPAVIDUS=}","uid":11934138,"size":862272,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:23d2589751c53910b7d652aa8ca2365598637acd&amp;dn=Women%2C+Disability+and+Mental+Distress+%282015%29+%7B%3DIMPAVIDUS%3D%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Sunghabib","files":1,"time":1431874849,"description":"Book Description:\n\nOver recent decades an increasing amount of attention has been paid to identifying and meeting the individual support needs of mental health service users and people with physical impairments in the UK. Evidence of this can be seen within the literature that considers mental health and physical impairment from a wide range of perspectives, as well as the increased range of service provision for individuals within both categories. However, the support needs of individuals who fall into both categories have largely been overlooked by social care and health service providers, practitioners, and organisations for whom the main focus is either mental health or physical impairment. The lack of attention that has been given in theory and in practice to the mental health support needs of disabled women who experience mental distress has resulted in an insufficient knowledge base of how to support disabled women who may require some form of mental health support. For this group of women this has meant that their needs have arguably continued to be neglected and subsequently left unmet. Writing from her position as both a social worker and a service user, Julia Smith has written an innovative and important text which both discusses a neglected area of personal experience and makes an original contribution to knowledge with regard to both policy and practice.\n\nProduct Details:\n\nPDF: 171 pages\nPublisher: Ashgate Pub Co; New edition edition (February 28, 2015)\nLanguage: English\nISBN-10: 1409454002\nISBN-13: 978-1409454007\nAmazon Link","torrent":{"xt":"urn:btih:23d2589751c53910b7d652aa8ca2365598637acd","amp;dn":"Women%2C+Disability+and+Mental+Distress+%282015%29+%7B%3DIMPAVIDUS%3D%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23d2589751c53910b7d652aa8ca2365598637acd","infoHashBuffer":{"type":"Buffer","data":[35,210,88,151,81,197,57,16,183,214,82,170,140,162,54,85,152,99,122,205]},"announce":[],"urlList":[]}}