{"title":"Coast to Coast AM June 20, 2013 - Money Laundering Reality Shift","uid":8621756,"size":70757966,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:2436b41684a4f8e6428e8b6d9dfb9b3377f5ea59&amp;dn=Coast+to+Coast+AM+June+20%2C+2013+-+Money+Laundering+Reality+Shift&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pyramid91","files":5,"time":1372388635,"description":"MP3 version wins!\nCourtesy of Coast to Coast Am's wonderful  &quot;Coast Insider&quot; service!\nShow description:\nDate:\n06-20-13\nHost:\nGeorge Noory\nGuests:\nRobert  Mazur,                   Cynthia Sue  Larson\nIn the first half, Robert Mazur, a decorated DEA undercover agent, detailed how billions in illicit drug and crime proceeds are kept hidden from governments through money laundering on a yearly basis. Even if marijuana was legalized in the US, it still wouldn't put much of a dent in the Mexican and Colombian cartels, whose main profits come from trafficking heroin, methamphetamine, and cocaine, he noted. Mazur said that such &quot;narco-terrorists&quot; feed off of the ability to corrupt the police, the military, the judicial and legislative systems that give them safe havens. This corruption is further enabled &quot;when the financial institutions of the world partake in the laundering of the mountains of cash that are generated by those organizations,&quot; he said. The banks turn the cash into wire transfers, which help to create legitimate seeming companies that operate globally, he explained, citing the Ayman Joumaa case as an example.  \nThe banks rely on the fact that they are repatriating cash back into the United States on behalf of a large number of correspondent banking relationships. &quot;Unfortunately, we're not asking enough questions about where that cash came from-- there's really no oversight with regards to the movement of bulk cash around the world,&quot; he noted. Yet, &quot;there's about a dozen banks in the last four or five years that have entered into what's called deferred prosecutions-- I call it the legal hand slap, admitting criminal guilt in connection with the illegal movement of monies around the world...HSBC is a good example,&quot; he reported.  \n------------------------------------\nIn the second half, author and intuitive coach Cynthia Sue Larson talked about the ways consciousness changes the physical world in a kind of &quot;reality shift,&quot; as well as her work with auras. Aura colors are often associated with tendencies that people have. For example, red is energetic and physical, violet is very spiritual, and blue is clear thinking, she outlined. Aura reading or energy sensing can improve people's lives, increasing their intuition about people and situations, and maybe even keep you out of danger, Larson remarked (check out her video on how to see auras). She cited a case Edgar Cayce publicized about a woman shopping at a department store who avoided getting on an elevator because the group of people on it seemed to have no aura. The elevator dropped straight down and some of the passengers were killed.  \nLarson described anomalous events that she refers to as &quot;reality shifts,&quot; which include dead people being seen alive again, &quot;glitch in the Matrix&quot; time loops, and most commonly, objects disappearing and then re-appearing in odd places. She posited that we could be accessing or seeing the effects of the multiverse, and &quot;through intention we can actually visualize a better possibility and find ourselves there.&quot; \nNews guests: Dr. Peter Breggin, Lauren Weinstein, Jeffrey Smith\nWebsite(s):\n realityshifters.com\n the-infiltrator.com\nBook(s):\n Aura Advantage\n Reality Shifts\n The Infiltrator\n","torrent":{"xt":"urn:btih:2436b41684a4f8e6428e8b6d9dfb9b3377f5ea59","amp;dn":"Coast+to+Coast+AM+June+20%2C+2013+-+Money+Laundering+Reality+Shift","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2436b41684a4f8e6428e8b6d9dfb9b3377f5ea59","infoHashBuffer":{"type":"Buffer","data":[36,54,180,22,132,164,248,230,66,142,139,109,157,251,155,51,119,245,234,89]},"announce":[],"urlList":[]}}