{"title":"Jazz and Blues on Edison Volume 1 (Document) [320KB] {MKOP}","uid":7671225,"size":177603997,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:269c84e21a5204191302250b85ed213094c921ec&amp;dn=Jazz+and+Blues+on+Edison+Volume+1+%28Document%29+%5B320KB%5D+%7BMKOP%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"mudmashers","files":28,"time":1348585896,"description":"Edison Colletion~Jazz and Blues on Edison Volume 1 (Document) [320KB] {MKOP}\n\nThomas Edison's pioneering Edison Company recorded seemingly everything under the sun between 1914 and 1929, including a host of vaudeville sketches, opera, and classical pieces, string bands, jazz dance bands, political speeches, and even the voice of Edison himself. The company ceased making records in 1929, and packed up its vast and varied catalog in boxes and stored them in an old warehouse until 1976, when Merritt Malvern began the process of transferring everything to archival tape. Most of this material has never been issued in any form, and Document Records has undertaken the daunting task of issuing the best of it on digital disc, including this set of jazz and blues sides, Edison Collection: Jazz and Blues on Edison, Vol. 1, Thomas Edison himself disliked jazz intensely, stating he always played jazz records backwards because &quot;they sounded better that way,&quot; but he must have been incredibly open-minded, since his company recorded several jazz outfits. \n\nA lot of what is collected here has mostly archival value, but there are some undeniable gems, including the simultaneously joyful and mournful &quot;St. Louis Gal&quot; by the Original Memphis Five (who were neither the original band nor from Memphis), Wilbur Sweatman's sinewy &quot;It Makes No Difference Now,&quot; Noble Sissle and Eubie Blake's carefully written and arranged &quot;Broken Busted Blues,&quot; and the mysterious Helen Gross' odd and willfully maudlin &quot;Undertaker's Blues.&quot; Sounding like they have come from a world far distant and lost to us, these sides have gained a kind of freshness because of it, and there is an unhinged joy inside the old grooves. Thanks to Document for taking on the task of bringing these little lost treasures -- all digitally shined up and ready to glow -- into the public arena of the 21st century. ~Steve Leggett (Allmusic)\n\n01. Dixie Land - Lopez &amp; Hamilton\n02. Baby's Got The Blues - Genevieve Gordon\n03. St. Louis Gal - Original Memphis Five\n04. You Gonna Wake Up Some Morning - Ethel Finney\n05. Hot Tamale Baby - Andy Razaf\n06. Hard Hearted Hannah - Marjorie Royer\n07. Temperamental Poppa - Josie Miles\n08. It Makes No Difference Now - Wilbur Sweatman's Brownies\n09. Undertaker's Blues - Helen Gross &amp; The Kansas City Five\n10. Memphis Bound - Viola McCoy\n11. Don't Advertise Your Man - Rosa Henderson\n12. Broken Busted Blues - Eubie Blake\n13. Loud Speakin' Papa - Elsie Clark\n14. Everybody Stomp! - Bud Lincoln &amp; His Orchestra\n15. I've Found A New Baby - Georgia Melodians\n16. Since Me Best Girl Turned Me Down - Winegar's Penn Boys\n17. Come On Home - Clarence Williams\n18. Wang Wang Blues - Mal Hallet's Orchestra\n\nMusic Keep On Playing*Thank You Seeders","torrent":{"xt":"urn:btih:269c84e21a5204191302250b85ed213094c921ec","amp;dn":"Jazz+and+Blues+on+Edison+Volume+1+%28Document%29+%5B320KB%5D+%7BMKOP%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"269c84e21a5204191302250b85ed213094c921ec","infoHashBuffer":{"type":"Buffer","data":[38,156,132,226,26,82,4,25,19,2,37,11,133,237,33,48,148,201,33,236]},"announce":[],"urlList":[]}}