{"title":"Railworks 3: Train Simulator 2012 Deluxe v.6.2c (2011/Multi4)","uid":6737342,"size":1827974282,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:26c59c5ff4d97d10b8f79153495a893cabd3bd73&amp;dn=Railworks+3%3A+Train+Simulator+2012+Deluxe+v.6.2c+%282011%2FMulti4%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Bilski","files":-1,"time":1318381484,"description":"Can you manage the 10,000-ton freight trains, flying over a mountain pass? Get if your passengers safe and sound to his home after a snowy night? Will you be able to cope with the express, flying at a speed of 200 km / h? Become a machinist. Defeat nature. Accurately recreated locomotives as our days, and the &quot;steam&quot; era. Incredible realism in 5 real and imaginary three routes with stunning scenery. You will be able to easily master the game, but the first kilometers you will have hard times. Hundreds of hours of gameplay. Learn to ride quickly and easily with RS Cab Control. Compete with other machinists from around the world through technology RS Career System.\n\n\n\n\nFeatures\n- Each of the 8 routes perfectly modeled with their real characters, and signaling.\n- Monitor actions can be from different angles, including from the cockpit, the passenger next to trains and a bird's-eye view.\n- Includes more than 50 scenarios to test your skills machinist.\n- Simple, intuitive interface allows you to gain experience in the management of the train.\n- System of a career make feel like a real engineer.\n- Five of these routes: Bath - Templkomb, Oxford - Paddington, New York - Newcastle, Hagen - Siegen and Kayonsky Pass.\n- Three imaginary routes: a large British marshalling yard, the path around Denver, Colorado, USA, and a set of routes in the alpine region of northern Europe.\n- Advanced tools for creating their own content.\n- The editor of the world allows users to easily create new routes or to modify existing ones.\n- Routes can be built from scratch, based on your choice of areas, trains, and scenic sites.\n- Ability to share user created content.\n- Additional materials are available for download, including locomotives, wagons, scripts, and routes.\n\nSystem requirements:\n- Operating system: Windows XP / Windows Vista / Windows 7\n- Processor: 1.7 GHz or better\n- Memory: 512 Gb Windows XP / 1 GB Vista / Windows 7\n- Video card: 128 Mb of video memory and support for Pixel Shaders 3.0\n- Sound Card: DirectX 9.0c compatible\n- Hard disk space: 7 Gb of free space + 3 Gb for downloadable content","torrent":{"xt":"urn:btih:26c59c5ff4d97d10b8f79153495a893cabd3bd73","amp;dn":"Railworks+3%3A+Train+Simulator+2012+Deluxe+v.6.2c+%282011%2FMulti4%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"26c59c5ff4d97d10b8f79153495a893cabd3bd73","infoHashBuffer":{"type":"Buffer","data":[38,197,156,95,244,217,125,16,184,247,145,83,73,90,137,60,171,211,189,115]},"announce":[],"urlList":[]}}