{"title":"The Chemistry of Metal-Organic Frameworks - Stefan Kaskel","uid":15557820,"size":40078519,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:277b63b91f5d44a84776b9273727dfdbf2fbf8c6&amp;dn=The+Chemistry+of+Metal-Organic+Frameworks+-+Stefan+Kaskel&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"clouderone","files":1,"time":1471088777,"description":"The Chemistry of Metal-Organic Frameworks - Stefan Kaskel (Wiley-VCH, 2016).pdf\r\n\r\nProviding vital knowledge on the design and synthesis of specific metal-organic framework (MOF) classes as well as their properties, this ready reference summarizes the state of the art in chemistry. \r\nDivided into four parts, the first begins with a basic introduction to typical cluster units or coordination geometries and provides examples of recent and advanced MOF structures and applications typical for the respective class. Part II covers recent progress in linker chemistries, while special MOF classes and morphology design are described in Part III. The fourth part deals with advanced characterization techniques, such as NMR, in situ studies, and modelling. A final unique feature is the inclusion of data sheets of commercially available MOFs in the appendix, enabling experts and newcomers to the field to select the appropriate MOF for a desired application. \r\nA must-have reference for chemists, materials scientists, and engineers in academia and industry working in the field of catalysis, gas and water purification, energy storage, separation, and sensors","torrent":{"xt":"urn:btih:277b63b91f5d44a84776b9273727dfdbf2fbf8c6","amp;dn":"The+Chemistry+of+Metal-Organic+Frameworks+-+Stefan+Kaskel","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"277b63b91f5d44a84776b9273727dfdbf2fbf8c6","infoHashBuffer":{"type":"Buffer","data":[39,123,99,185,31,93,68,168,71,118,185,39,55,39,223,219,242,251,248,198]},"announce":[],"urlList":[]}}