{"title":"Eddie Money - Shakin' [promo].VOB","uid":9012153,"size":86910976,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:2858ac03c253719a03bf46541fa680c4c3393a19&amp;dn=Eddie+Money+-+Shakin%27+%5Bpromo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1381120448,"description":"Eddie Money - Shakin' [promo].VOB\n\n\nHQ rare promo music video from a promo DVD. &quot;Shakin'&quot; is a song by American rock singer, Eddie Money, from his album No Control in 1982. It was co-written by Eddie Money, Elizabeth Myers, and Ralph Carter, and released as a single, reaching #63 on the Billboard Hot 100 chart and #9 on the Mainstream Rock Tracks.\n\nThe video for the single featured actress/model Patricia Kotero, better known as Apollonia, as the female doing the &quot;shakin&quot;. She would later go on to co-star in the film Purple Rain.\n\nEddie Money (born Edward Joseph Mahoney on March 21, 1949), is an American rock guitarist, saxophonist and singer-songwriter, who found success in the 1970s and 1980s with a string of Top 40 hits and platinum albums. Rock impresario Bill Graham said of Money, &quot;Eddie Money has it all.... Not only can he sing, write, and play, but he is a natural performer.&quot;\n\nEddie Money was born Edward Mahoney into a large Irish Catholic family in Brooklyn and raised in Plainedge on Long Island. His father, grandfather, and brother were all New York City Police Department (NYPD) policemen, and Eddie was an NYPD trainee and a police officer for two years. As his interest in music intensified, he eventually ended his law-enforcement career in favor of becoming a full-time musician. He moved to Berkeley, California, and became a regular at area clubs, where he secured a recording contract with Columbia Records. Later in the 1970s, he charted with singles such as &quot;Baby Hold On&quot; and &quot;Two Tickets to Paradise&quot;. Money continued his successes and took advantage of the MTV music video scene in the early 1980s with his humorous narrative videos for &quot;Shakin'&quot; and &quot;Think I'm in Love,&quot; but his career began to fail him after several unsuccessful releases in the mid-1980s, accompanied by his struggles with drug addiction. He joined a 12-step program in 2001 and has said of his addiction &quot;I came to the realization that I didn't really need [it] for my quick wit.&quot;\n\nMoney made a comeback in 1986 and returned to the mainstream rock spotlight with the album Can't Hold Back. The album's Ronnie Spector duet &quot;Take Me Home Tonight&quot; reached the Top 10, as did with the hit &quot;I Wanna Go Back.&quot; Money followed the album with another Top 10 hit, &quot;Walk on Water&quot; (1988), but his Top 40 career ended following the #21 placement of &quot;I'll Get By&quot; in 1992. During the 1990s and 2000s, Money continued to release numerous compilation albums along with several albums featuring new material. Today, he still tours regularly, often accompanied by other successful rock acts from the 1970s and 1980s, and has also made several television appearances on American sitcoms. He played himself in season 4, episode 23 of the sitcom, The King of Queens.\n(video has a semi-transparent white &quot;vh1classic&quot; logo at the bottom right)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Shakin'&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Shakin'&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/HaabBaaFJ&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/HaabBaaFJ&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic: \n   Video: MPEG2 Video 720x480 (4:3) 29.97fps 9800kbps\n   Audio: Dolby Digital AC3 48000Hz stereo 192kbps\n   Duration: 00:03:14\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.7.0\n\n\n*Media Player Classic Home Cinema*  &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\n\nSgtRlee (Sgt.R.Lee) \n\t","torrent":{"xt":"urn:btih:2858ac03c253719a03bf46541fa680c4c3393a19","amp;dn":"Eddie+Money+-+Shakin%27+%5Bpromo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2858ac03c253719a03bf46541fa680c4c3393a19","infoHashBuffer":{"type":"Buffer","data":[40,88,172,3,194,83,113,154,3,191,70,84,31,166,128,196,195,57,58,25]},"announce":[],"urlList":[]}}