{"title":"The Child Thief by Dan Smith","uid":9617853,"size":531760,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:29438361f95164758d4c9f5db2dbf17b97dd6c80&amp;dn=The+Child+Thief+by+Dan+Smith&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"PirateBook","files":1,"time":1392440076,"description":"\nDecember 1930, Western Ukraine.\nLuka is a veteran of the First World War and the Russian Civil War. All he wants now is a quiet life with his wife, twin sons and young daughter. Their small village has, so far, managed to remain hidden from the advancing Soviet brutality and labour camp deportations. But everything changes the day the stranger arrives, pulling a sled bearing the bodies of two children. In a fervour, the villagers lynch the stranger, despite Luka's protests. But when calm is restored, the mob leader, Dimitri, discovers his daughter has vanished. \n\nLuka is the only man with the skills to find who could have stolen a child in these frozen white wastelands - and besides, the missing girl is best friends with Luka's daughter Lara, and he promises her that he will find her friend and bring her home. Together with his sons and Dimitri, Luka sets out in pursuit across lands ravaged by war and gripped by treachery. Soon they realise that the man they are tracking is a no ordinary criminal, but a skilful hunter with the kidnapped child as the bait in his violent game. It will take all of Luka's strength to battle the harshest of conditions, and all of his wit to stay a step ahead of Soviet authorities. And though his toughest enemy is the man he tracks, his strongest bond is a whispered promise to his family back at home.\n\nGenre: Fiction | Mystery/Thriller","torrent":{"xt":"urn:btih:29438361f95164758d4c9f5db2dbf17b97dd6c80","amp;dn":"The+Child+Thief+by+Dan+Smith","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29438361f95164758d4c9f5db2dbf17b97dd6c80","infoHashBuffer":{"type":"Buffer","data":[41,67,131,97,249,81,100,117,141,76,159,93,178,219,241,123,151,221,108,128]},"announce":[],"urlList":[]}}