{"title":"EnigmaT Set Rips { Cuts } - June 20th, 2013","uid":8594617,"size":1553714655,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:29868638ddd31df2992595c95d109964acd8da28&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+June+20th%2C+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EnigmaT","files":163,"time":1371728438,"description":"A.M.R. feat. Ai Takekawa - Whispers (LTN Vocal Mix) (Cut From Palagano Set)-enTc.mp3\nA.R.D.I. - Mystery (Cut From Bobina Set)-enTc.mp3\nAcsent - The Cycle (Dave Cold Remix) (Cut From ReOrder Set)-enTc.mp3\nAevion &amp; Intens - Jupiter (Cut From Wizz Set)-enTc.mp3\nAfrojack - Esther 2K13 (HIIO Dark Mix) (Cut From Tydi Set)-enTc.mp3\nAgnelli &amp; Nelson pres. A&amp;N Project - Quest (Original Mix) (Cut From Solarstone Set)-enTc.mp3\nAirdraw - Olaen (Aleksey Yakovlev Remix) (Cut From Palagano Set)-enTc.mp3\nAkira Kayosa &amp; Hugh Tolland - Authentic 1.0 (Almar Remix) (Cut From Solarstone Set)-enTc.mp3\nAleksey Beloozerov feat. Jama - Give Me Your Faith (Evave Remix) (Cut From Anderson Set)-enTc.mp3\nAlex Drayling &amp; Maxim Klein - Europa (MoodFreak Remix) (Cut From Probity Set)-enTc.mp3\nAlex Kunnari - Lifter (Maison &amp; Dragen Remix) (Cut From Anderson Set)-enTc.mp3\nAlex M.O.R.P.H. feat. Christian Burns - Secret Universe (Woody van Eyden Remix) (-OvErSpAmMeD- Set Rip)-enTc.mp3\nAlexander Stribkov - Fat Phat (Original Mix) (Cut From Pobsky Set)-enTc.mp3\nAllen Watts - Fast Lane (Cut From GO Set)-enTc.mp3\nAlly Brown &amp; Filip Marak - Remote Access (Allen &amp; Envy Remix)  (Cut From Cold Set)-enTc.mp3\nAly &amp; Fila feat. Sue McLaren - Mysteries Unfold (Uplifting Mix) (Cut From A&amp;F Set)-enTc.mp3\nAnddriqui Bianchini - Suburbia (Original Mix) (Cut From Uplift Set)-enTc.mp3\nAnddriqui Bianchini - Suburbia (Synthaurion Remix) (Cut From Uplift Set)-enTc.mp3\nAndy Moor - I Be (Club Mix) (Cut From Nickson Set)-enTc.mp3\nAnhken - Always Look Back (Alternative Mix) (Cut From Shah Set)-enTc.mp3\nAriel &amp; Danilo feat. Alex Tunka - It Moves On (Original Mix) (Cut From Anderson Set)-enTc.mp3\nAscania - Supersymmetry (Original Mix) (Cut From Uplift Set)-enTc.mp3\nBeatman &amp; Ludmilla - Bazantar (Set Rip)-enTc.mp3\nBetsie Larkin &amp; Solarstone - Breathe You In (Sneijder Remix) (Cut From Dymond Set)-enTc.mp3\nBiotones &amp; Alexander Byrka - My Sleepy Cloud (Ewan Rill Remix) (Cut From Darey Set)-enTc.mp3\nBlue Silence &amp; Matt Chowski - Legendary (Matt Chowski Mix) (Cut From Shadows Set)-enTc.mp3\nBobby Tank - The Way (Original Mix) (Cut From Akagawa Set)-enTc.mp3\nBorgore - Legend (Carnage &amp; Borgore Remix) (Cut From W&amp;W Set)-enTc.mp3\nBring Bliss &amp; Katrin Souza - I Remember (Original Mix) (Cut From Anderson Set)-enTc.mp3\nCash Cash - Take Me Home (Cut From Levi Set)-enTc.mp3\nChristian Rusch feat. Chase - Set Me Free (Kim Svard Uplifting Remix)  (Cut From Solarstone Set)-enTc.mp3\nCintra &amp; Movoverse - Looper (Cut From Palagano Set)-enTc.mp3\nCiro Visone &amp; Rita Visone - The Final Battle (Original Mix) (Cut From Romel Set)-enTc.mp3\nCiro Visone - Alive (Ico Remix) (Cut From Cold Set)-enTc.mp3\nComing Soon - Bring The Action (Set Rip)-enTc.mp3\nComing Soon - Ether (Set Rip)-enTc.mp3\nCormac Murphy - Star Lake (Cut From Solarstone Set)-enTc.mp3\nCosmic Gate - Crushed (Rafael Frost Remix) (ABGT 032 Rip)-enTc.mp3\nD-Addiction - WTF (Coming Soon Remix) (Set Rip)-enTc.mp3\nDart Rayne &amp; Yura Moonlight and Sarah Lynn - Silhouette (Allen &amp; Envy Remix) (Cut From Photographer Set)-enTc.mp3\nDavid Gravell - Bulldozer (Cut From W&amp;W Set)-enTc.mp3\nDesknights - Firestone (Cut From Coastline Set)-enTc.mp3\nDigital Elements - Perfect Sense (Estigma Remix) (Cut From tranzLift Set)-enTc.mp3\nDigital Elements - Perfect Sense (Mike van Fabio Remix) (Cut From Angel Ace Set)-enTc.mp3\nDigital Elements - Perfect Sense (Mike van Fabio Remix) (Cut From Bukovski Set)-enTc.mp3\nDigital Horizon - Breathe (Evgeny Bardyuzha Remix) (Cut From Datt Set)-enTc.mp3\nDJ Feel feat. Aelyn - If You Feel Love (-SAMPLE- Cut From Feel Set)-enTc.mp3\nE.T Project - The Ocean (Original Mix) (Cut From tranzLift Set)-enTc.mp3\nEast &amp; Young feat. Tom Cane - Starting Again (Shapeshifters Remix) (Cut From Levi Set)-enTc.mp3\nEloquentia - Sunset In Manila (Morvan Remix) (Cut From Feel Set)-enTc.mp3\nEmanuele Congeddu - Letter To Anya (Mostfa &amp; Mostfa Remix) (Cut From A&amp;F Set)-enTc.mp3\nEmanuele Congeddu - Letter To Anya (Peter O'Ski Oriental Remix) (Cut From Space Garden Set)-enTc.mp3\nEric Prydz Presents Pryda - Layers (ABGT 032 Rip)-enTc.mp3\nEtasonic - No Words Can Tell This (Etasonic's Unspoken Mix) (Cut From Uplift Set)-enTc.mp3\nEtasonic - No Words Can Tell This (Etasonics Unspoken Mix) (Cut From Sty Set)-enTc.mp3\nEtasonic - Wonders Of The Planets (Glynn Alan Remix) (Cut From Vale Set)-enTc.mp3\nFedde Le Grand &amp; Sultan Ned Shepard - No Good (Extended Mix) (Cut From R3HAB Set)-enTc.mp3\nFon Leman - One Day (Original Mix) (Cut From Anderson Set)-enTc.mp3\nFon.Leman - Feel the Same (Original Mix)  (Cut From Kenji Set)-enTc.mp3\nFrank Traxx - Nebuchan (Jonas Stenberg Rework) (Cut From Coastline Set)-enTc.mp3\nGallagher, Lane &amp; Palagano - Galapagos (Hanski Remix) (Cut From Palagano Set)-enTc.mp3\nGreenflash Feat. Dyna - Taboem (Cut From Ferry Set)-enTc.mp3\nHanski feat. Natalie Gioia - Light Of My Life (Mode Pelar Remix) (Cut From Anderson Set)-enTc.mp3\nHanski feat. Natalie Gioia - Light Of My Life (Mode Pelar Remix) (Cut From Angel Ace Set)-enTc.mp3\nHanski feat. Natalie Gioia - Light Of My Life (Mode Pelar Remix) (Cut From Suzy Set)-enTc.mp3\nIkerya Project - Orion's Belt (Original Mix) (Cut From A&amp;F Set)-enTc.mp3","torrent":{"xt":"urn:btih:29868638ddd31df2992595c95d109964acd8da28","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+June+20th%2C+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29868638ddd31df2992595c95d109964acd8da28","infoHashBuffer":{"type":"Buffer","data":[41,134,134,56,221,211,29,242,153,37,149,201,93,16,153,100,172,216,218,40]},"announce":[],"urlList":[]}}