{"title":"Lalola 1x39[DVB][Spanish].avi","uid":4369596,"size":367005696,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:29a6d2cb93c2cf9a7f76aa02b3bd7c96d5aae247&amp;dn=Lalola+1x39%5BDVB%5D%5BSpanish%5D.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"webchella","files":1,"time":1220065324,"description":"Esta comedia trata sobre un hombre machista llamado Ramiro &quot;Lalo&quot; Padilla (Juan Gil Navarro), exitoso en todos sus aspiraciones: es director de la empresa &quot;High Five&quot;, editora de la famosa revista &quot;Don&quot;, y tiene a su alrededor a muchas mujeres, con las que negarÃƒÂ¡ cualquier tipo de compromiso. Romina (Marcela Kloosterboer), quien estÃƒÂ¡ enamorada de Lalo, decide vengar la falta de compromiso para con ella a travÃƒÂ©s de una bruja, quien le realizÃƒÂ³ un hechizo y lo convirtiÃƒÂ³ en mujer, una mujer muy hermosa, como Romina deseaba, para que sienta lo desesperante que es para una mujer ser acosada con la mirada.\n\nAhora este hombre encerrado en un cuerpo de mujer debe hacerse pasar en su trabajo por otra persona ya que nadie le creerÃƒÂ­a que es ÃƒÂ©l tras haber sufrido la metamorfosis. Por esto dice en la empresa ser Dolores &quot;Lola&quot; Padilla (Carla Peterson), la prima de Lalo, quien tuvo que realizar un viaje urgente a Alemania porque su padre enfermÃƒÂ³ y por ello la dejÃƒÂ³ a ella en su puesto.\n\nA partir de esto comienzan a suceder situaciones muy divertidas en las cuales Lalo comienza a descubrir, de la mano de Grace (Muriel Santa Ana), su mejor amiga, todas las cosas que hacen a la mujer distinta del hombre: Usar tacones, vestir polleras, menstruar, etcÃƒÂ©tera. Poco a poco, comienza a notar lo falsas que eran algunas personas con Lalo, como su mejor amigo, GastÃƒÂ³n (Rafael Ferro). Sin darse cuenta, comienza a acercarse involuntariamente a un compaÃƒÂ±ero de trabajo, Facundo (Luciano Castro), del que cuanto mÃƒÂ¡s quiere alejarse, mÃƒÂ¡s se acerca.\n\nA partir del viernes 28 de septiembre, se incorporÃƒÂ³ a esta comedia Reina Reech quien interpreta a Carola, la esposa del Sr. Aguirre, presidente de la editorial &quot;High Five&quot;, siendo","torrent":{"xt":"urn:btih:29a6d2cb93c2cf9a7f76aa02b3bd7c96d5aae247","amp;dn":"Lalola+1x39%5BDVB%5D%5BSpanish%5D.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29a6d2cb93c2cf9a7f76aa02b3bd7c96d5aae247","infoHashBuffer":{"type":"Buffer","data":[41,166,210,203,147,194,207,154,127,118,170,2,179,189,124,150,213,170,226,71]},"announce":[],"urlList":[]}}