{"title":"The Beat - Special Beat Service [1982][EAC,log,cue. FLAC]","uid":8128444,"size":260513673,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2a120e8fb8653f4e5cc93fbf54f04fbd4022f866&amp;dn=The+Beat+-+Special+Beat+Service+%5B1982%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":15,"time":1360536334,"description":"MOJO Magazine: Buried Treasure &quot;Album That Time Forgot.&quot;\n\n\n\nIn Britain, The (English) Beat were moving very much in the wrong direction, as their chart placements made clear. &quot;Save It for Later&quot; released in April 1982, barely made the Top 50, &quot;Jeanette,&quot; their new album's taster, just brushed Number 45, &quot;I Confess&quot; didn't even chart, probably because it's flip &quot;Sole Salvation&quot; was also culled off the album, while &quot;Ackee 1 2 3&quot; played outside the Top 50.\n\nThe slippage had started with Wha'ppen, as the group had veered sharply away from their frenetic roots, Special Beat Service would take them even further from their early punk-fired fury. Still, Wha'ppen still boasted cultural themes, its angry and angsty lyrics sharply edging the set. Service didn't even have that, and after two Top Three albums, the group were forced to settle for a placement just outside the Top Twenty.\n\nBut in the US their sun was on the ascendant, and a band who had yet to place a platter into the Top 100 suddenly found itself with a Top Forty hit album. The singles that barely scratched the charts in the UK found happy homes in the clubs, slotting nicely around the mix of New Wave and burgeoning New Romantic numbers American clubbers craved.\n\nAnd so &quot;I Confess&quot; with its Joe Jackson-esque piano line, Dave Wakeling's sweet vocals soaring towards heaven, the jazzy sax, all cossetting the insistent drums and bouncing tablas; the fast and furious &quot;Jeanette&quot; with its French street flair and ever more surreal rhymes; &quot;Save It&quot;'s superb blend of jangly Byrd- esque guitars and stomping beats; &quot;Salvation&quot;'s nod to mod that hints at The Jam's &quot;Beat Surrender&quot; which arrived the same month; and the calypso party atmosphere of &quot;Ackee,&quot; all set listeners feet tapping.\n\nThese were the ones that hit with the DJs, but the whole set was equally worthy, and moves onto the dancefloor with abandon. Producer Bob Sargeant gives it all a bright and brash sound, which may not have favored more reggae-heavy numbers like &quot;Spar Wid Me&quot; and &quot;Pato and Roger a Go Talk,&quot; but The Beat were diving into the New Wave with gusto, and the production emphasizes those currents. Songs like &quot;Sugar &amp; Stress&quot; where the sax storms across the driving rhythm, whilst still retaining the Brit-Beat flavor of the guitars and keyboards were a revelation. Even a more downbeat number like the gorgeous &quot;End of the Party&quot; glows under his attentions.\n\nIn it's own way Service was just as musically adventurous as its predecessor, and boded well for the group's future. Or would have if The Beat hadn't celebrated their success by promptly calling it a day. The music however lives on in all its glory.\n &lt;a href=&quot;\nhttp://dickthespic.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/&lt;/a&gt;","torrent":{"xt":"urn:btih:2a120e8fb8653f4e5cc93fbf54f04fbd4022f866","amp;dn":"The+Beat+-+Special+Beat+Service+%5B1982%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a120e8fb8653f4e5cc93fbf54f04fbd4022f866","infoHashBuffer":{"type":"Buffer","data":[42,18,14,143,184,101,63,78,92,201,63,191,84,240,79,189,64,34,248,102]},"announce":[],"urlList":[]}}