{"title":"Cass McCombs - Big Wheel and Others [2013][FLAC]","uid":9038267,"size":481044141,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2a2c91aa2dd1d483a449b9aa90cb8f50b48800ca&amp;dn=Cass+McCombs+-+Big+Wheel+and+Others+%5B2013%5D%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":24,"time":1381557690,"description":"Artist: Cass McCombs\nRelease: Big Wheel and Others\nReleased:  2013\nLabel:Domino\nCatalog#: WIG 305\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: USA\nStyle: indie folk rock\n\n01. Sean I\n02. Big Wheel\n03. Angel Blood\n04. Morning Star\n05. The Burning of the Temple 2012\n06. Brighter\n07. There Can Be Only One\n08. Name Written in Water\n09. Joe Murder\n10. Everything Has To Be Just-So\n11. It Means a Lot To Know You Care\n12. Dealing\n13. Sooner Cheat Death Than Fool Love\n14. Satan Is My Toy\n15. Sean II\n16. Home on the Range\n17. Brighter (feat Karen Black)\n18. Untitled Spain Song\n19. Sean III\n20. Honesty Is No Excuse\n21. Aeon Of Aquarius Blues\n22. Unearthed\n\nFollowing a remarkably prolific 2011, which saw the release of not one but two strong-in-their-own-right full-length records (Wit's End and Humor Risk) from indie troubadour Cass McCombs, things got relatively quiet for the ever-evolving songwriter. His complexly poetic lyricism and subtly textured musicianship were in prime form on both albums, reaching into different places of darkness and humor. Two years later, Big Wheel and Others arrived; a sprawling 22-track collection that clocks in at almost 90 minutes and shows McCombs trying on different hats in his own established way of slowly unraveling his patient, aching compositions. It's an odd one. Beginning with a home-recorded spoken interview with a four-year-old, the album launches with a trio of repetitive Americana-seeped road rockers. The dusty churn of &quot;Big Wheel,&quot; pedal steel-glazed softness of &quot;Angel Blood,&quot; and dark lumbering tones of &quot;Morning Star&quot; set the listener up for an understated album of cowboy songs and clean, country-tinged melodies delivered from a distance. Before sinking into any one mode, however, McCombs quickly shifts gears with the saxophone-aided amble of &quot;The Burning of the Temple, 2012,&quot; breezy dad-rock with the Graceland-esque instrumentation of &quot;There Can Be Only One,&quot; and eventually the disorientingly lengthy sermon/poem/song cycle of &quot;Everything Has to Be Just-So.&quot; This song riffs on for almost nine minutes, with a Dylan-via-Lou Reed monotone delivery on race, society, and individual perception. The song's mismatched segments persist for so long that they go from potentially grating to strangely lulling, not unlike Gillian Welch's ghostly epic &quot;I Dream a Highway&quot; or Dylan's &quot;Sad-Eyed Lady of the Lowlands,&quot; songs that stick around so much longer than expected that they become meditations unto themselves. It's an unexpected highlight of the album, and is followed immediately by the head-scratching instrumental pseudo-smooth jazz of &quot;It Means a Lot to Know You Care.&quot; That's not the only bizarre sidestep of the extensive set. The lyrics of the almost unlistenable sleaze rock romp of &quot;Satan Is My Toy&quot; experiment with the meeting of religious and sexual themes only a few notches above AC/DC's locker-room innuendo, and almost every time the arrangements veer away from sleepy acoustic instruments, the shifts can be jarring. The issue with Big Wheel is that the standout tracks are as brilliant as the filler is confusing, and both are represented more or less equally. A loving cover of Thin Lizzy's &quot;Honesty Is No Excuse&quot; is delivered with the same shambling feel as Dylan's Self Portrait material, and Karen Black contributes lead vocals to one of two versions here of the especially strong &quot;Brighter!,&quot; but every fantastic song is cushioned by an anonymous-feeling mediocre one. While those already enamored with McCombs' lyrical approach and subdued songwriting might find more of immediate value here than the uninitiated, there's a lot to sift through, even for fans, and it might be difficult to keep focus through the entire sometimes befuddling set.","torrent":{"xt":"urn:btih:2a2c91aa2dd1d483a449b9aa90cb8f50b48800ca","amp;dn":"Cass+McCombs+-+Big+Wheel+and+Others+%5B2013%5D%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a2c91aa2dd1d483a449b9aa90cb8f50b48800ca","infoHashBuffer":{"type":"Buffer","data":[42,44,145,170,45,209,212,131,164,73,185,170,144,203,143,80,180,136,0,202]},"announce":[],"urlList":[]}}