{"title":"Electronic - Twisted Tenderness [1999]","uid":9548726,"size":481445713,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2a55537e2fd29bfad620168e01ebd6124ac6c976&amp;dn=Electronic+-+Twisted+Tenderness+%5B1999%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GenXRock","files":-1,"time":1391186519,"description":"Review by MacKenzie Wilson  [-]\nJohnny Marr and Bernard Sumner have a unique musical companionship. Both artists bred the '80s British music scene into pop candy delight thanks to Marr's charming guitar hooks while fronting the Smiths, and Sumner, whose ingenuous lyrical poetry pushed New Order's dance-oriented sound into the new wave mainstream. But since their musical collaboration began back in 1991, the duo continues to make music for themselves, uninhibited by current norms and marketing success. Twisted Tenderness, the band's third album, is certainly a vast improvement over their sophomore effort, 1996's Raise the Pressure. Twisted Tenderness steps back into Marr's talented guitar work: carefree, a bit rollicking at times, but in classic Electronic fashion. The obvious rock-laden riffs carry the typical synth-generated backdrops, and Sumner's cheeky lyrics are stylish and breezy. Sumner, who experienced writer's block during the mid-'90s and resorted to Prozac to break his creative blindness, isn't exquisitely sharp or wholly impressive when it comes to being a songwriter. He's simple, and that's what makes Electronic and his work with his original band so alluring. But it's Marr's maddening style that carries things along. Songs like &quot;Late at Night&quot; and &quot;Breakdown&quot; fiercely showcase his spiraling guitar loops, not overshadowing Sumner's storybook visions of love, deceit, passion, and desire. And what makes Twisted Tenderness so vibrant is how Electronic placated their lushness for more of a moody demeanor, mysteriously similar to the likes of U2's electric distortion found on 1997's Pop. &quot;Make It Happen&quot; is nearly an eight-minute sonic bombast of churning basslines and swirling techno beats, and Marr's layering is raucous. He is so underrated as a master player, but outlets like Electronic and his new band the Healers make it easy for him to fully deliver his great skills. &quot;Haze&quot; showcases Sumner's snarling sauciness, which comes out occasionally, and is darkly wistful. But that's what New Order/Smiths fans are looking for. Electronic don't have to prove that they can write decent pop songs. Their musical brashness is expected, and Twisted Tenderness is their best yet. Marr and Sumner have already laid down the gravel in their previous musical lives -- Electronic is just an extra treat. (4/5)","torrent":{"xt":"urn:btih:2a55537e2fd29bfad620168e01ebd6124ac6c976","amp;dn":"Electronic+-+Twisted+Tenderness+%5B1999%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a55537e2fd29bfad620168e01ebd6124ac6c976","infoHashBuffer":{"type":"Buffer","data":[42,85,83,126,47,210,155,250,214,32,22,142,1,235,214,18,74,198,201,118]},"announce":[],"urlList":[]}}