{"title":"Charlie Byrd - Blues Sonata (1961) [Jazz][mp3 320][h33t][schon55","uid":4732341,"size":98960059,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2a9aab92d6ddbe27bb80324e10ea72662e2f6618&amp;dn=Charlie+Byrd+-+Blues+Sonata+%281961%29+%5BJazz%5D%5Bmp3+320%5D%5Bh33t%5D%5Bschon55&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"schon55","files":13,"time":1235091704,"description":"Charlie Byrd - Blues Sonata\nYear: 1961:  Riverside\nLabel: OJC: 2001, 20bit remastered\nTotal time: 40:46\nBitrate: 320 kbps\n\nThough recorded on one day, at standard length for an LP, this is really two albums in one sleeve, showcasing two rather different formats for this highly original guitarist to pursue.  &quot;The Blues Sonata&quot; is set up in a pseudo-classical three-movement manner, with a polonaise, ballad, and scherzo, and the liner notes refer to a sonata form of development.  Well, sorry, but the classical trappings, if any exist, are worn very lightly by Byrd, his bassist Keter Betts, and drummer Buddy Deppenschmidt. &quot;Polonaise Pour Pietro&quot; t'ain't nothin' the blues, and a very fluid blues workout at that.  &quot;Ballade in B Minor&quot; is Chopinesque in melodic influence only, including the brush-stroked improvisation segment, and &quot;Scherzo for an Old Shoe&quot; sets up as a Latinish number, then stays on one chord with an Andalusian strain.  On side two, the scene abruptly becomes very urbane as Byrd switches to electric guitar, takes on Barry Harris' comping, bopping piano, and engages in straightforward swinging and balladeering without any textbook definitions getting in the way.  &quot;Alexander's Ragtime Band,&quot; &quot;Jordu,&quot; and &quot;Zing! Went the Strings on My Heart&quot; are the merry swingers, &quot;That Ole Devil Called Love&quot; the relaxed ballad showcase.  Whatever you call the music, the whole CD goes down easily and musically. ~ Richard S. Ginell, AMG\n\nThis is an album I owned in vinyl in the early 60's. I hadn't heard it in decades but, on coming across a reminder of its existance, I remembered it clearly and bought the cd.  The title of the album refers to a 3 part piece composed by Byrd which combines classical and jazz guitar styles - it's unique, with a slightly Spanish flavor, with interwoven crystal-clear musical lines, and is immensely enjoyable.  It is also totally unlike the bossa nova music which Byrd popularized in Jazz Samba, his collaboration with Stan Getz. ~ J. Klugman\n\nPersonnel:\nCharlie Byrd (Guitar) \nBarry Harris (Piano) - 4-7 \nKeter Betts (Double Bass) \nBuddy Deppenschmidt (Drums) \n\nCharlie Byrd - Blues Sonata Tracks:\n01  Polonaise Pour Pietro (Charlie Byrd) 7:03 \n02  Ballad In B Minor (Charlie Byrd) 5:04 \n03  Scherzo For An Old Shoe (Charlie Byrd) 9:10 \n04  Alexander's Ragtime Band (Irving Berlin) 5:27 \n05  Jordu (Duke Jordan) 4:39 \n06  That Old Devil Called Love (Doris Fisher/Allan Roberts) 4:53 \n07  Zing! Went The Strings Of My Heart (James F. Hanley) 4:30 \n","torrent":{"xt":"urn:btih:2a9aab92d6ddbe27bb80324e10ea72662e2f6618","amp;dn":"Charlie+Byrd+-+Blues+Sonata+%281961%29+%5BJazz%5D%5Bmp3+320%5D%5Bh33t%5D%5Bschon55","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a9aab92d6ddbe27bb80324e10ea72662e2f6618","infoHashBuffer":{"type":"Buffer","data":[42,154,171,146,214,221,190,39,187,128,50,78,16,234,114,102,46,47,102,24]},"announce":[],"urlList":[]}}