{"title":"The Twisted dream - 3rd Reich Series (History Ebook).pdf","uid":11504055,"size":41962353,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2aad0bb37a760739e197e988e79c7c393ae5d1e4&amp;dn=The+Twisted+dream+-+3rd+Reich+Series+%28History+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"STBGD","files":-1,"time":1416353953,"description":"Pdf / English / 1990 by Time-Life Books / 3rd Reich Series / 192 pages / 40 MB\n\nThis is the first of the 21 volume series &quot;The Third Reich&quot; by Time-Life, which I consider to be THE definitive collection on the subject, bar none. I cannot recommend this collection highly enough, once you have one volume, you'll want them all! I recommend you start at the beginning and follow the series in chronological order to fully appreciate it. The series as a whole includes very effective photographs and sidebars and is written in a user friendly rather than textbook style, but is in no way at all a lightweight discussion of the subject.\n\nThe origins of Nazi ideology are revealed in great detail here, as well as the humble and dreary existence of Adolf Hitler until his unheard of rise to power. This series makes it easier to comprehend how the German people could be so desperate and vulnerable as to listen to such a messianic radical for salvation after the crushing defeat and depression following World War I. Of course, he wasn't honest about his true long term goals or how he intended to make them reality, but it is a chilling reminder of what can happen when a government has unlimited power and eliminates the rights of its citizens, still very relevant today.\n\nAmazon","torrent":{"xt":"urn:btih:2aad0bb37a760739e197e988e79c7c393ae5d1e4","amp;dn":"The+Twisted+dream+-+3rd+Reich+Series+%28History+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2aad0bb37a760739e197e988e79c7c393ae5d1e4","infoHashBuffer":{"type":"Buffer","data":[42,173,11,179,122,118,7,57,225,151,233,136,231,156,124,57,58,229,209,228]},"announce":[],"urlList":[]}}