{"title":"Joe Henderson - 1973 - Multiple (1992) FLAC","uid":8525758,"size":313303421,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2bfbd384d839150bd7638c6371890c5528450c49&amp;dn=Joe+Henderson+-+1973+-+Multiple+%281992%29+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"eika256","files":-1,"time":1370025161,"description":"Joe Henderson - 1973 - Multiple (1992)\n\nMultiple is a bellwether album for jazz fans. You can tell a lot about listeners' ear and where their tastes reside based on whether they're big fans of Multiple, indifferent toward it, or don't like it at all. Joe Henderson's career arc has three major nodes -- his hard bopping '60s era, his '70s fusion stint, and his later reincarnation as a Grammy-winning, critically acclaimed, standard-blowing sage. Of these three, Henderson's '70s run is often underappreciated or, in some cases, dismissed and even mildly maligned. The detractors are usually those with more traditional and, at times, stodgy ears. Hip cats -- &quot;with-it cats,&quot; as they said in the '70s -- loved Multiple Joe, Afrocentric Joe, semi-militant Joe, grooving Joe, burnin' Joe. Multiple is probably Henderson's greatest album from this era and its fans share a cult-kinship. Whereas most fusion artists of the day were spiking their jazz with rock guitar and &quot;elements&quot; of funk, there was a certain set (Gary Bartz, for example) who offered concentrated, pungent funk. You won't find a bassline like Dave Holland's &quot;Turned Around&quot; on a Return to Forever album. It's the Multiple rhythm section (Holland, a maniacally drumming Jack DeJohnette, and pianist Larry Willis) that makes it such a nasty set. The album's classic cut, &quot;Tress-Cum-Deo-La,&quot; doesn't walk or bop; it struts with a pronounced limp, like the fellas who swaggered up urban avenues with tilted fedoras. And then there's Henderson, blowing some of the most impassioned solos of his career. There's an activism to his phrasing; you could hear it on Sly Stone records, but you could feel it here. That songs as majestic as &quot;Bwaata&quot; almost feel like afterthoughts is a tribute to this album's thorough mean streak. Those ignorant to the import of Henderson's Milestone albums -- especially Multiple -- might scoff at such high praise for what is viewed by some as a nonessential album thrown into the Henderson discography. Such is life for the unhip. (AllMusic)\n\nTrack list:\n01 - Tress-Cun-Deo-La\n02 - Bwaata\n03 - Song For Sinners\n04 - Turned Around\n05 - Me, Among Others\n\nPersonnel:\nJoe Henderson - tenor sax (1-5), soprano sax (1), percussion (1, 3), flutes (1), vocals (1, 3)\nLarry Willis - electric piano, ring modulator, Echoplex\nJames Ulmer - guitar (1)\nJohn Thomas - guitar (3) - guitar\nDave Holland - bass, electric bass\nJack DeJohnette - drums\nArthur Jenkins - congas, percussion\n\nEnjoy and share! ","torrent":{"xt":"urn:btih:2bfbd384d839150bd7638c6371890c5528450c49","amp;dn":"Joe+Henderson+-+1973+-+Multiple+%281992%29+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2bfbd384d839150bd7638c6371890c5528450c49","infoHashBuffer":{"type":"Buffer","data":[43,251,211,132,216,57,21,11,215,99,140,99,113,137,12,85,40,69,12,73]},"announce":[],"urlList":[]}}