{"title":"The Huntress (Batman DC Comics)","uid":5334965,"size":614248447,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:2c7b505dd096555619c3c13dd0d234bdaccbb0aa&amp;dn=The+Huntress+%28Batman+DC+Comics%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"brodahisou","files":-1,"time":1265288955,"description":"This pack contains the solo adventures of both the Helena Wayne and Helena Bertinelli versions of the Huntress, both of whom are members of the Batman Family.\n\nHelena Wayne was the Bronze Age Huntress, the daughter of the Batman and Catwoman of Earth-Two, an alternate universe established in the early 1960s as the world where the Golden Age stories took place.  She was initially killed off in Crisis on Infinite Earths #12 (1986), but has since reappeared following the limited series 52.\nHer original solo adventures were collected in the The Huntress: Darknight Daughter trade paperback which is included in this pack.\n\nFollowing the 1985 miniseries, Crisis on Infinite Earths, the Helena Wayne version of the Huntress was removed from continuity. DC Comics introduced a new version of the Huntress with the same first name and physical appearance, and with a similar costume, but with an entirely different backstory and different personality.\n\nThe Modern Age Huntress is Helena Rosa Bertinelli, the daughter of one of Gotham's mafia bosses who, after witnessing the mob-ordered murder of her entire family at the age of 19, crusades to put an end to the Mafia.\nBatman considers her to be too unpredictable and violent but others in the Batman family feel differently.  The Huntress has often teamed up with Nightwing and Robin (Tim Drake) and was also a member of Birds of Prey and the Justice League.\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:2c7b505dd096555619c3c13dd0d234bdaccbb0aa","amp;dn":"The+Huntress+%28Batman+DC+Comics%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c7b505dd096555619c3c13dd0d234bdaccbb0aa","infoHashBuffer":{"type":"Buffer","data":[44,123,80,93,208,150,85,86,25,195,193,61,208,210,52,189,172,203,176,170]},"announce":[],"urlList":[]}}