{"title":"Death in Vegas - The Contino Sessions [1999]","uid":9501881,"size":302095286,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2cc02ef234eadfaa74add32bdd43f857469d8cc0&amp;dn=Death+in+Vegas+-+The+Contino+Sessions+%5B1999%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GenXRock","files":-1,"time":1390241896,"description":"Review by Ned Raggett  [-]\nThe amount of hype that greeted this album upon release was notable even by U.K. press terms, leading to quite an unexpected amount of overall attention upon the band's second release. Justified? Not quite -- it's important to approach this CD on its own terms, and on that level it's a good album, but not a great one. Claimed goals at being inspired by Primal Scream's Screamadelica aside, Contino doesn't achieve anything near the same sense of reach and sweep as that album did, not to releases like My Bloody Valentine's Loveless and other cited role models. The Richard Fearless/Tim Holmes combination here seems to restrict itself to production and arrangement, commissioning a variety of players, notably a key duo of guitarist Ian Button and bassist Mat Flint, to interpret their songs under their overall guidance. Button and Flint are quite good at what they do -- the two get to shine right at the start on the crawling build and freakout of &quot;Dirge&quot; -- but sometimes an overall mood is set without much being added to it. Slow, steady beats and breaks flesh out things reasonably enough. The band's ace in the hole lies with the series of guest vocalists, starting (perhaps unsurprisingly) with Primal Scream's Bobby Gillespie. Jesus and Mary Chain singer Jim Reid, Scottish singer Dot Allison, and punk legend Iggy Pop also take a bow, the latter guesting on the album's undoubted highlight, the aggressive, energetic &quot;Aisha.&quot; Perhaps the most interesting move, though, is on &quot;Aladdin's Story,&quot; with the London Community Gospel Choir taking a bow in the same way they did with Spiritualized. At base, Contino is a reasonably entertaining and sometimes quite compelling combination of slower dance aesthetics translated into rock &amp; roll terms and sounds. It just isn't the end of the world, that's all. (4/5)","torrent":{"xt":"urn:btih:2cc02ef234eadfaa74add32bdd43f857469d8cc0","amp;dn":"Death+in+Vegas+-+The+Contino+Sessions+%5B1999%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2cc02ef234eadfaa74add32bdd43f857469d8cc0","infoHashBuffer":{"type":"Buffer","data":[44,192,46,242,52,234,223,170,116,173,211,43,221,67,248,87,70,157,140,192]},"announce":[],"urlList":[]}}