{"title":"Osama, Obama and the smell of a rat","uid":6373818,"size":203980,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2d6ed2682ccc67a3e21d669635929499d416069a&amp;dn=Osama%2C+Obama+and+the+smell+of+a+rat&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"ebnbiz","files":1,"time":1304779851,"description":"The only question that is left for us to answer is just how far the deception and the cover up goes. Is it fundamental or is it peripheral? Was there an Osama Bin Laden there at all or did he actually die many years ago? Was it really him that was attacked or was it a body double? Was the whole thing real or was it all stage-managed? Was he killed at the premises, assuming that he was killed at all, or was he flown off in the American chopper and killed elsewhere after a period of brutal interrogation, questioning and torture? Why were the two couriers killed even though they did not resist arrest? Why was Bin Laden's young son killed? Why were there no armed men guarding the premises if the leader of the world's most notorious and dangerous terrorist was really living there? How come not even one American commando or Navy Seal was shot or even wounded during the operation? Remember that we are talking about the leader of the dreaded Al Qaeda here. I mean the whole thing is beginning to sound so unlikely and implausible. It sounds more like a script of a second-rate Hollywood movie than reality.     \n\nThere are so many scenarios and conclusions that one can draw up and arrive in all this but ultimately it is only God (and possibly Obama) that really knows the truth and that has the answers to these questions. Whichever way one looks at it and whatever one chooses to believe, I can smell a very big dead rat here and the smell is getting stronger by the day. \n\nJust how bad this smell is, you can find out in this wonderful report: \n&quot;OSAMA, OBAMA AND THE SMELL OF A RAT&quot;","torrent":{"xt":"urn:btih:2d6ed2682ccc67a3e21d669635929499d416069a","amp;dn":"Osama%2C+Obama+and+the+smell+of+a+rat","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d6ed2682ccc67a3e21d669635929499d416069a","infoHashBuffer":{"type":"Buffer","data":[45,110,210,104,44,204,103,163,226,29,102,150,53,146,148,153,212,22,6,154]},"announce":[],"urlList":[]}}