{"title":"NetPlay Instant Demo v8.50.45 Incl Crack [iahq76]","uid":7788217,"size":13216895,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:2de330d311ddcf9e7e35ec2dd422ebbf84e80679&amp;dn=NetPlay+Instant+Demo+v8.50.45+Incl+Crack+%5Biahq76%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"TorDigger","files":3,"time":1351954042,"description":"Instant Demo\n\nInstant Demo Studio - easy to use screen capture program that creates Flash movies for demonstrations, tutorials, presentations and training. By editing functions include anotatsionny text and interactive hotspots. Entry screen is exported to Flash format and requires less than 20 kilobytes per minute of captured video. One click of the mouse - is all that is required of you to start recording from the screen. The program automatically captures any visual changes on your desktop, including mouse movements. Voice annotation is fully supported by this program, capturing the sound during recording, as well as a separate entry and insert sound files when editing video. Uses a patented video compression technology that enables you to play streaming video from the Internet without delays.\n\nFeatures:\n\n&quot;Fixing the visual changes on your desktop in real time\n&quot;Capture the entire screen, or selected parts of it or the active window\n&quot;Automatic recording of mouse movements and its appearance\n&quot;Record live sound during capture screen\n&quot;Record or insert sound files when editing video\n&quot;Support for import in AVI format\n&quot;Creating movies in the popular Adobe Flash format\n&quot;You can record many hours of what is happening on the screen\n&quot;Streaming videos\n&quot;Simple and powerful video editing, with only two windows\n&quot;Extremely small file size, less than 20 kilobytes per minute of recording\n&quot;Adding text annotation in your videos\n&quot;Adding hotspots mouse for interactive non-linear demonstrations and tutorials\n&quot;Adding videos hyperlinks for full integration with your website\n&quot;Customize the appearance of text annotation\n&quot;Graphical Editing your video frames, using your favorite graphics editor\n&quot;Adding a variety of effects in the transitions - from the decay to release\n&quot;Full-color recording and playback\n&quot;Creating a Web template for your demonstration\n&quot;Creating a small executable file for easy attachment to an e-mail\n&quot;Support undo and redo changes\n&quot;Combining multiple recording sessions into one project\n&quot;And many other possibilities...\n\nSupported OS:\n\nSupports Windows 2000, 2003, XP, Vista and Windows 7\n\nHomepage: http://www.instant-demo.com/\n\nInstallation Instructions:\n\n1. Install Program.\n2. Copy content from crack folder and paste into default installation directory.\n3. Done, Enjoy.","torrent":{"xt":"urn:btih:2de330d311ddcf9e7e35ec2dd422ebbf84e80679","amp;dn":"NetPlay+Instant+Demo+v8.50.45+Incl+Crack+%5Biahq76%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2de330d311ddcf9e7e35ec2dd422ebbf84e80679","infoHashBuffer":{"type":"Buffer","data":[45,227,48,211,17,221,207,158,126,53,236,45,212,34,235,191,132,232,6,121]},"announce":[],"urlList":[]}}