{"title":"The Magician Trilogy - Jenny Nimmo","uid":7760571,"size":1234614266,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:2e25af55c96c59b952212557c6ba2c7d21f16aa6&amp;dn=The+Magician+Trilogy+-+Jenny+Nimmo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"reaganFF","files":164,"time":1351213661,"description":"The Snow Spider -- Book I The Magician Trilogy\nOn Gwyn's 9th birthday, his grandmother tells him he may be a magician, like his Welsh ancestors. She gives him five gifts to help him--a brooch, a piece of dried seaweed, a tin whistle, a scarf, and a broken toy horse. One blustery day, unsure what to do with his newfound magic, Gwyn throws the brooch to the wind and receives a silvery snow spider in return. Will he be able to use this special spider to bring his missing sister, Bethan, home? THE SNOW SPIDER spins an icy, sparkly web of mystical intrigue that sets the stage for the next two books in this outstanding trilogy!\n\n\nEmlyn's Moon -- Book II The Magician Trilogy\nYoung magician Gwyn and his friend Nia have been warned to stay away from Emlyn Llewelyn, the strange boy who claims his mother lives on the moon. And yet, a mysterious magic continues to draw them to him. But why?\n\nThe Chestnut Soldier -- Book III The Magician Trilogy\nGwyn can feel danger coming in the wind. Somehow he knows the warnings have to do with the broken toy horse that holds the evil spirit of a prince who lived long ago. When Gwyn discovers that the prince's dark soul has escaped from the horse and is seeking revenge Gwyn, Emlyn, and Nia have to figure out how to save the mysterious soldier who claims to be Nia's distant cousin. With the help of the Snow Spider, can they recapture the prince's soul without hurting the Chestnut soldier?","torrent":{"xt":"urn:btih:2e25af55c96c59b952212557c6ba2c7d21f16aa6","amp;dn":"The+Magician+Trilogy+-+Jenny+Nimmo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e25af55c96c59b952212557c6ba2c7d21f16aa6","infoHashBuffer":{"type":"Buffer","data":[46,37,175,85,201,108,89,185,82,33,37,87,198,186,44,125,33,241,106,166]},"announce":[],"urlList":[]}}