{"title":"DARIUSBURST Chronicle Saviours-RELOADED","uid":12908470,"size":1223498314,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2ef183922cb4d6d367d4d5fec76e32f9e59a0e11&amp;dn=DARIUSBURST+Chronicle+Saviours-RELOADED&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Pirata","files":3,"time":1449271428,"description":"DARIUSBURST Chronicle Saviours (c) Degica\r\n\r\n12/2015 :..... RELEASE.DATE .. PROTECTION .......: Steam\r\n1 :.......... DISC(S) .. GAME.TYPE ........: Action\r\n\r\nWARNING!! DARIUSBURST Chronicle Saviours is approaching fast!\r\nDARIUSBURST Chronicle Saviours is the latest installment in Taito's DARIUS\r\nseries of arcade-style shooting games. Blast hordes of alien sea-monsters,\r\nand blaze your own trail through branching environments.\r\n\r\nFeatures:\r\n\r\n* The richest content in the Darius series: all the arcade content from\r\nAnother Chronicle EX (AC), plus the all-new Chronicle Saviours (CS) Mode.\r\n* In AC Mode, you have multiple modes: Original, Original EX, and\r\nChronicle Mode. Original Mode is an authentic recreation of the arcade\r\ncampaign with its branching levels. Original EX mode is a harder version\r\nof the arcade campaign, designed for players that want an extra\r\nchallenge.\r\n* Chronicle Mode includes a whopping 3000+ stages that can be unlocked by\r\nglobal players. Each time a world is unlocked by a player on your\r\ncabinet*, you get access to it too. Race to save them all!\r\n* CS Mode is a single player story mode with 200+ stages, spanning the\r\nentire timeline of DARIUS history. Revisit classic Darius ships and music\r\nin this ultimate fan experience!\r\n* 9 playable ships to choose from, including Silver Hawk variants from\r\nclassic Darius games, and a new CS-exclusive ship. Some ships are\r\nequipped with powerful Burst weapons, while others have strong base\r\nfirepower. Pick the playstyle that suits you best, and use your ship's\r\nunique strengths and weaknesses to blast through your enemies.\r\n* Over 40 enormous aquatic-themed battleships including series favorites\r\nlike &quot;Great Thing&quot; and &quot;Iron Fossil&quot; as well as new CS-exclusive bosses.\r\n* A haunting and memorable Zuntata soundtrack, including classic tracks\r\nand entirely new compositions. Play it loud for the full Darius\r\nexperience!\r\n* Up to 4-player local co-op with unique mechanics like sharable\r\npower-ups and Burst weapon combos.\r\n* Graphical settings for a variety of resolutions in 16:9 and 32:9 aspect\r\nratiosup to 3440 x 1440 resolution.\r\n* AC Mode supports dual monitors with a 32:9 aspect ratio, and up to 6880\r\nx 1440 resolution. The 32:9 aspect ratio appears letterboxed on\r\nsingle-screen displays to preserve the appearance of the original game.\r\nCS Mode is optimized for single-monitor displays to give a larger\r\npicture. No matter what your setup, DARIUSBURST CS is a truly massive\r\nvisual experience!\r\n* Steam achievements, online leaderboards, and cloud backup saves are\r\nsupported. Compete to see who can get the best score in each area!\r\nFor additional information about Darius lore, game modes, ship types, and\r\nmore, please visit the Darius website at: http://darius.jp/dbcs/en/\r\n\r\n*Here's how the cabinet feature works; when you begin playing DARIUSBURST\r\nCS, you'll be assigned a random virtual cabinet. As you complete areas in\r\nChronicle Mode, you'll liberate planets and unlock new areas. Whenever\r\nyou liberate a world, it will also be unlocked and shared with other\r\nplayers that are in the same cabinet. Compete with other players to see\r\nwho can clear the most worlds, or see who can get the highest score in\r\neach world. It's like a miniature universe that you share with other\r\nplayers!\r\n\r\n1. Unrar.\r\n2. Burn or mount the image.\r\n3. Install the game.\r\n4. Copy over the cracked content from the /Crack directory on the image to\r\nyour game install directory.\r\n5. Play the game.\r\n6. Support the software developers. If you like this game, BUY IT!","torrent":{"xt":"urn:btih:2ef183922cb4d6d367d4d5fec76e32f9e59a0e11","amp;dn":"DARIUSBURST+Chronicle+Saviours-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ef183922cb4d6d367d4d5fec76e32f9e59a0e11","infoHashBuffer":{"type":"Buffer","data":[46,241,131,146,44,180,214,211,103,212,213,254,199,110,50,249,229,154,14,17]},"announce":[],"urlList":[]}}