{"title":"Elon Musk: Tesla, SpaceX, and the Quest for a ... (epub)","uid":12023483,"size":1904533,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2ff82daeaa7d10e466bd12efb48ee039b1afd392&amp;dn=Elon+Musk%3A+Tesla%2C+SpaceX%2C+and+the+Quest+for+a+...+%28epub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"heliiaruy","files":1,"time":1434488228,"description":"Elon Musk: Tesla, SpaceX, and the Quest for a Fantastic Future\n\nby Ashlee Vance\n\nepub\n\n\nIn Elon Musk: Tesla, SpaceX, and the Quest for a Fantastic Future, veteran technology journalist Ashlee Vance provides the first inside look into the extraordinary life and times of Silicon Valley's most audacious entrepreneur. Written with exclusive access to Musk, his family and friends, the book traces the entrepreneur's journey from a rough upbringing in South Africa to the pinnacle of the global business world. Vance spent over 40 hours in conversation with Musk and interviewed close to 300 people to tell the tumultuous stories of Musk's world-changing companies: PayPal, Tesla Motors, SpaceX and SolarCity, and to characterize a man who has renewed American industry and sparked new levels of innovation while making plenty of enemies along the way.\n\n        Vance uses Musk's story to explore one of the pressing questions of our time: can the nation of inventors and creators which led the modern world for a century still compete in an age of fierce global competition? He argues that Musk--one of the most unusual and striking figures in American business history--is a contemporary amalgam of legendary inventors and industrialists like Thomas Edison, Henry Ford, Howard Hughes, and Steve Jobs. More than any other entrepreneur today, Musk has dedicated his energies and his own vast fortune to inventing a future that is as rich and far-reaching as the visionaries of the golden age of science-fiction fantasy.\n\n\n\n\nenjoy it y'all","torrent":{"xt":"urn:btih:2ff82daeaa7d10e466bd12efb48ee039b1afd392","amp;dn":"Elon+Musk%3A+Tesla%2C+SpaceX%2C+and+the+Quest+for+a+...+%28epub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ff82daeaa7d10e466bd12efb48ee039b1afd392","infoHashBuffer":{"type":"Buffer","data":[47,248,45,174,170,125,16,228,102,189,18,239,180,142,224,57,177,175,211,146]},"announce":[],"urlList":[]}}