{"title":"Canyon Capers v1.0.70","uid":11729849,"size":42566543,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:30017233da2d0a0b199f423f70682cb40ac2f71b&amp;dn=Canyon+Capers+v1.0.70&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Androider","files":1,"time":1425248656,"description":"Do you have fond memories of playing old style platform games, where you didn't have to learn a hundred button combos to play it successfully?\n\nCanyon Capers is just for you if that's the case.\n\nCanyon Capers is a retro style arcade platform game for all ages, created by the authors of the 1992 original.\n\nStarring Dino-Jr and his many friends as they venture through the canyons and caverns of ancient ruins in historical locations, to reach the ultimate goal, retrieval of the Golden Mollusk, source of all universal power and a mighty fine trophy at that.\n\nWith a finely tuned difficulty curve, from nice and easy, all the way to rock hard, just like old school platforming used to be. Canyon Capers will make you rely on your wits, your memory and at times, seat of the pants twitch gaming.\n\nFEATURES\n\n- Simple to play, hard to master classic retro platform gaming\n\n- Full support for game controllers ( MOGA, and all HiD compliant devices )\n\n- Google Play Game Services support for ACHIEVEMENTS and LEADERBOARDS.\n\n- ENGLISH, FRENCH, RUSSIAN, FINNISH and SWEDISH language support.\n\n- 50 levels each with 3 levels of completion, each with many ways to complete...\n- Race to the end, collect all the items and unlock the unique bomb levels\n- Unlock new characters, each with their own unique abilities as you complete canyons and worlds\n- Tongue in cheek nods to your favorite classic retro games\n- Tons of secrets and collectibles\n- Designed for controllers or touch gaming\n\n\nHARDWARE SUPPORT\n\n- Controller Support - Play with your PowerA Moga, USB (Xbox style), NVIDIA Shield Controller and all HID controllers!\n\n- Play on your NVIDIA Shield / SHIELD TABLET!\n\n- Recommended 1gb memory.\n\n** Use cooling off period to test compatibility **\n\nWhat's New:\n\n- First Release version -\nShield/Shield Tablet support, HID controllers and much GooglePlay Game Services support.\n\nMore info:\n &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=com.crazymoogames.CanyonCapers&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=com.crazymoogames.CanyonCapers&lt;/a&gt;","torrent":{"xt":"urn:btih:30017233da2d0a0b199f423f70682cb40ac2f71b","amp;dn":"Canyon+Capers+v1.0.70","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30017233da2d0a0b199f423f70682cb40ac2f71b","infoHashBuffer":{"type":"Buffer","data":[48,1,114,51,218,45,10,11,25,159,66,63,112,104,44,180,10,194,247,27]},"announce":[],"urlList":[]}}