{"title":"Kevin Moyer &amp; Friends Present: Live from Nowhere Near You, Volum","uid":6574774,"size":1392396199,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:30f3f6e83761158f65041fc7f166ec1f4b992ced&amp;dn=Kevin+Moyer+%26+Friends+Present%3A+Live+from+Nowhere+Near+You%2C+Volum&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SoundbaronPirateBay","files":74,"time":1312145487,"description":"Music : Indie : Lossless\n\n\n\n\n\n\nKevin Moyer &amp; Friends Present: Live from Nowhere Near You, Volume Two: Pacific Northwest (2011)(3CD)(Various Artists)(FLAC)\n\n\n\n\n\nEddie Vedder\n\n\n\n\nRelease date: July 19th 2011\n\nGenre :Compilation - Rock, Blues, Hip Hop, Jazz, Acoustic\n\nCompany: Funkhead Music &amp; GreyDay Records\n\n\n\n\nINFO FROM FACEBOOKPAGE:\n\n\n\n\n\nLive From Nowhere Near You collaborates street musicians with professionals to tell a story of life on the streets, and to and from there, giving all profits to homeless and street youth programs.\n\n\nKevin Moyer went into his attic studio alone with an idea and emerged with an emotionally vibrant compilation full of life and found sounds. By collaborating street musicians with friends and music professionals, he tells a story of life on the streets and the roads leading to and from there.\n\nWith thick layers of raw and polished instrumentation, the music hits like waves of emotion eddying between... the warmth of a large wool blanket and the cold of a concrete pillow.\n\nAs the sounds of turntable beats wind through crowded streets and dark alleys, inspired guitars and haunting vocals dig into your chest and squeeze your heart.\n\nVolume One was released in 2003. This is Volume Two.\n\n\nWebsite:\n &lt;a href=&quot;\nhttp://greydayrecords.com/050&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://greydayrecords.com/050&lt;/a&gt;\n\n\n\n\n\n\n\nTracklist:\n\nDisc 1:\n\n01. Kevin Moyer: An Easy Slide (Rendezvous You Too)\n02. Bright Eyes and Britt Daniel of Spoon: Southern State\n03. The Helio Sequence: Heart Disease\n04. Nathan Jr: The Best Noise\n05. The Upsidedown: Silver Wind\n06. Shawn Smith of Satchel and Brad: You Are Majestic\n07. Kevin Moyer: Ill Street Blues\n08. Carlos Guitarlos &amp; Mike Watt: Ain't That Lovin' You\n09. Paul Immanuel Owens: Hey You Dreamer\n10. Dan Reed: Ritual (solo acoustic)\n11. Tango Alpha Tango: This City\n12. Skeeter: Winging It\n13. James Mercer of the Shins: Caring Is Creepy (solo acoustic)\n14. Brent DeBoer of The Dandy Warhols: Is That All\n15. Tim Jenson of Pink Martini: A Saxophone In New York\n16. Carlos Vamos and Lindsay Buckland: O-No-You-Den / Bar Tremolinos\n17. Pete Miser: Where Do We Go From Here\n18. Eddie Vedder of Pearl Jam, The Strokes, Josh Homme of Queens of the Stone Age and Them Crooked Vultures: Mercy Mercy Me*\n19. Joe Purdy: Troubadour\n20. Joe Whaley: Save Me From Destruction (acoustic demo)\n21. Corin Tucker of Sleater-Kinney, Kevin and Anita Robinson of Viva Voce, Chris Funk of The Decemberists as Blue Giant: Gone For Good\n\n\n\n\n\nBright Eyes\n\n\n\nDisc 2:\n\n01. David Brown and Adrian McEldery: Loose Change\n02. The Ettes: Spend My Money\n03. The Upsidedown: Light (Pete International Airport remix)\n04. Daniel Johnston: Grievances\n05. Dand Lee Strickland and Kevin Moyer: Holding Me Down\n06. Tyler Coyle: Scaffolding\n07. Nicholas Crosa and DJ Sirround: One Violin, One DJ\n08. Suckapunch: Moves\n09. Mic Crenshaw of Hungry Mob with Stic.man of Dead Prez: Running Out Of Time\n10. Lindsay Buckland and Carlos Vamos: Whirling Devas (kevin come together edit)\n11. Thomas Lauderdale of Pink Martini: The Overgrown Meadow\n12. Danny Seim of Menomena as Lackthereof: The Columbia\n13. Carlos Vamos and Lindsay Buckland: Vigilante (street edit)\n14. Kevin Moyer: Let's Make A Deal\n15. Dandy Warhols and Portland Elvis: Gonna Be Your Santa\n16. Black Rebel Motorcycle Club: River Styx (demo)\n17. Station Zero with Kevin Moyer: Prone\n18. Logan Lynn: Movies\n19. Thomas Lauderdale of Pink Martini: Nana (Manuel de Falla)\n20. Third Eye Blind with Arion Salazaar: There's No Hurry To Eternity\n21. Stone Gossard and Mike McCready of Pearl Jam, Pete Droge, Chris Friel, Cole Peterson: Shame On You\n22. The Presidents of the United States of America: Love Everybody\n\n\n\n\n\nElliott Smith\n\n\n\nDisc 3:\n\n01. Carlos Guitarlos &amp; John Doe of X: Two Tavern Town\n02. Tobin Herrera: Tonic Interlude (Pre-Funk)\n03. The Robots: Tonic\n04. Jordan White: Frank and Judy\n05. Neil Gust, Elliott Smith, Jim Talstra, and John Moen of The Decemberists as No. 2: Who's Behind The Door?\n06. Elliott Smith: The Real Estate\n07. Modest Mouse: Dead End Job At The Dead Letter Office\n08. Kevin Moyer and Wally Hendrickson: Happiness, That's Why I'm Bleeding\n09. Thomas Lauderdale of Pink Martini: Up and Up\n10. Thomas Lauderdale of Pink Martini: A Piano In New York\n11. Steven Wilson of Porcupine Tree: Abandoner (alternate mix)\n12. Greg Snell: End Wash\n13. Kevin Moyer: Gutter Swirls (Drained)\n14. Pete Miser of the Five Fingers of Funk: Call On Me\n15. Dave Allen of Gang of Four, Danny Seim of Menomena, John Askew, and Adam Gnade as Faux Hoax: Your Friends Will Carry You Home (Pocket Remix)\n16. David Maverick: Reverse\n17. Ryan Adams : Shine Through The Dark\n18. Joe Whaley: Save Me From Destruction (alternate studio version)\n19. Matt Brown and Kevin Moyer: One Fine Day (Fall) (acoustic version)\n20. The Black Ryder with Peter Hayes of BRMC: Burn and Fade\n21. Wilco: Someday Some Morning Sometime\n22. Joe Whaley: I'll Always Be There For You (acoustic demo)\n\n\n\n\n\nWilco\n\n\n\n\nENJOY &amp; AS ALWAYS: REMEMBER TO KEEP SEEDING FOR OTHERS!!!\nTHANKS!!\n\n","torrent":{"xt":"urn:btih:30f3f6e83761158f65041fc7f166ec1f4b992ced","amp;dn":"Kevin+Moyer+%26+Friends+Present%3A+Live+from+Nowhere+Near+You%2C+Volum","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30f3f6e83761158f65041fc7f166ec1f4b992ced","infoHashBuffer":{"type":"Buffer","data":[48,243,246,232,55,97,21,143,101,4,31,199,241,102,236,31,75,153,44,237]},"announce":[],"urlList":[]}}