{"title":"Tucker The Man and his Dream Dvdrip H264 Bookerdog.mp4","uid":4960698,"size":833530211,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:316c9b3907012258a602cbc50428307c420b0d90&amp;dn=Tucker+The+Man+and+his+Dream+Dvdrip+H264+Bookerdog.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bookerdog","files":-1,"time":1245291368,"description":"Francis Ford Coppola directed this truly American story based on the real-life struggles of one man and his fight against big government and large corporations. In 1945 Michigan, Preston Tucker (Jeff Bridges) created a car for the future equipped with fuel injection, a center headlight, seat belts, a rear engine, disc brakes, shatterproof glass, and a pop-out windshield. With the support of his wife (Joan Allen), his son (Christian Slater), and his business manager (Martin Landau in an Academy Award-nominated performance), Tucker produced fifty of his dream cars. However, Detroit's Big Three, with the help of a Washington senator (played by Jeff Bridges's father, Lloyd, in an uncredited role), set up significant roadblocks. Tucker is investigated for fraud and his plant is closed. Coppola had been planning to make a film based on the life of Preston Tucker since 1974. His own struggle to retain independence from the Hollywood studios mirrors the auto maverick's story. Of the 50 cars Tucker made, 46 are still roadworthy (Coppola and Executive Producer George Lucas each own one). Pop musician Joe Jackson composed the music for the film.","torrent":{"xt":"urn:btih:316c9b3907012258a602cbc50428307c420b0d90","amp;dn":"Tucker+The+Man+and+his+Dream+Dvdrip+H264+Bookerdog.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"316c9b3907012258a602cbc50428307c420b0d90","infoHashBuffer":{"type":"Buffer","data":[49,108,155,57,7,1,34,88,166,2,203,197,4,40,48,124,66,11,13,144]},"announce":[],"urlList":[]}}