{"title":"Marduk - Internal Eternal","uid":3605693,"size":153248029,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:31af0033552337835125961b326e7d71c0bd1145&amp;dn=Marduk+-+Internal+Eternal&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Kiba","files":20,"time":1170030235,"description":"Marduk - Infernal Eternal [LIVE]\n\nYear: 2001\nCountry: Sweden\nGenre: Metal\nStyles: Death Metal/ Black Metal, Heavy Metal, Scandinavian Metal\n\n\nBiography:\nAn unswerving commitment to blasphemy and extremity combined with a relentless touring schedule and a steady stream of recordings has helped establish Sweden&amp;#039;s Marduk as one of the better-known bands on the Scandinavian black metal scene. They began as more of a standard death metal band with a black metal influence, but have come to be known for their style of extreme black metal, which tends to focus on themes of warfare and anti-Christian sentiment and is characterized by relentlessly fast drumming and blurred walls of guitar. The group formed under the leadership of guitarist Morgan Steinmeyer Hakansson in 1990, with vocalist Andreas Axelsson, bassist Richard Kalm, and drummer Joakim Grave rounding out the lineup.\n\nThey released their controversially titled demo tape Fuck Me Jesus in 1991. Soon after, a second guitarist was added in Devo Andersson, while Bogge Svensson replaced Kalm on bass. Using this lineup, Marduk recorded their first official album, Dark Endless, which came out the following year on No Fashion Records. Unhappy with No Fashion, the band made the jump to the French Osmose Productions imprint, releasing Those of the Unlight in 1993, this time with Grave on drums as well as vocals and a new bassist in B. War. For their following release, 1994&amp;#039;s Opus Nocturne, Fredrik Andersson was brought in on drums, Devo Andersson was dropped, and Grave was resigned to vocals. (Meanwhile, Osmose set about releasing the Fuck Me Jesus demo in 1995, at which time it was banned in seven countries.) The lineup shuffling continued with Grave&amp;#039;s subsequent departure, at which time he was replaced by Legion (formerly of the band Opthalamia). With this new lineup, they issued their most well-received album, Heaven Shall Burn...When We Are Gathered, in 1996. This CD was followed by a concert recording from that album&amp;#039;s tour entitled Live in Germania, which showed that they could indeed sustain the non-stop blasting intensity of their records without any studio assistance. (They did use a second guitarist, however, in Peter Tagtren of the death metal band Hypocrisy.)\n\nSubsequent releases included Nightwing (1998), an album partly inspired by the life Vlad Tepes, aka Dracula, and Panzer Division Marduk (1999), a war-themed concept album and their last CD for the Osmose label. Following their split with Osmose, Marduk set up their own label, Blooddawn (distributed in the U.S. by Century Media), releasing the double-live CD Infernal Eternal as well as a new studio album, La Grande Danse Macabre, in 2001.\n\nTracklist:\n\n  \t CD1\t1 \tPanzer Division Marduk 2:55\n  \t  \t2 \tBurn My Coffin 4:25\n  \t  \t3 \tBaptism by Fire 3:42\n  \t  \t4 \tThe Sun Turns Black As Night 3:06\n  \t  \t5 \tOf Hell&amp;#039;s Fire \tWar 5:17\n  \t  \t6 \t502 3:11\n  \t  \t7 \tMaterialized in Stone 5:23\n  \t  \t8 \tBeast of Prey 4:12\n  \t  \t9 \tThose of the Unlight 4:47\n  \t  \t10 \tSulphur Souls 6:22\n  \t  \t11 \tDreams of Blood and Iron 5:58\n  \t  \t12 \tFistfucking God&amp;#039;s Planet 3:56\n\n  \t  CD2\t1 \tOn Darkened Wings 4:13\n  \t  \t2 \tInto the Crypts of Rays 4:08\n  \t  \t3 \tStiill Fucking Dead 3:17\n  \t  \t4 \tSlay the Nazarene 3:54\n  \t  \t5 \tDeparture From the Mortals 3:36\n  \t  \t6 \tLegion \tMarduk \t9:29\n\nPersonal Remarks:\nThese guys are more evil then the Devil himself. I can&amp;#039;t imagine anything harder than this... Please seed at least 150%","torrent":{"xt":"urn:btih:31af0033552337835125961b326e7d71c0bd1145","amp;dn":"Marduk+-+Internal+Eternal","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31af0033552337835125961b326e7d71c0bd1145","infoHashBuffer":{"type":"Buffer","data":[49,175,0,51,85,35,55,131,81,37,150,27,50,110,125,113,192,189,17,69]},"announce":[],"urlList":[]}}