{"title":"The Penguin Arthur Miller (Penguin Classics Deluxe edition)","uid":12721852,"size":1515864,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:31ccb58cf65febfec8a58950c71e0a774f493bac&amp;dn=The+Penguin+Arthur+Miller+%28Penguin+Classics+Deluxe+edition%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ZamKhan","files":1,"time":1447001264,"description":"To celebrate the centennial of his birth, the collected plays of America’s greatest twentieth-century dramatist in a Penguin Classics Deluxe Edition\r\n\r\nIn the history of postwar American art and politics, Arthur Miller casts a long shadow as a playwright of stunning range and power whose works held up a mirror to America and its shifting values. The Penguin Arthur Miller celebrates Miller’s creative and intellectual legacy by bringing together the breadth of his plays, which span the decades from the 1930s to the new millennium. From his quiet debut, The Man Who Had All the Luck, and All My Sons, the follow-up that established him as a major talent, to career hallmarks like The Crucible and Death of a Salesman, and later works like Mr. Peters’ Connections and Resurrection Blues, the range and courage of Miller’s moral and artistic vision are here on full display.\r\n\r\nIncluding eighteen plays—some known by all and others that will come as discoveries to many readers—The Penguin Arthur Miller is a collectible treasure for fans of Miller’s drama and an indispensable resource for students of the theatre.\r\n\r\nThe Penguin Arthur Miller includes:\r\nThe Man Who Had All the Luck, All My Sons, Death of a Salesman, An Enemy of the People, The Crucible, A View from the Bridge, After the Fall, Incident at Vichy, The Price, The Creation of the World and Other Business, The Archbishop’s Ceiling, The American Clock, Playing for Time, The Ride Down Mt. Morgan, The Last Yankee, Broken Glass, Mr. Peters’ Connections, and Resurrection Blues. \r\n\r\nFor more than sixty-five years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,500 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators","torrent":{"xt":"urn:btih:31ccb58cf65febfec8a58950c71e0a774f493bac","amp;dn":"The+Penguin+Arthur+Miller+%28Penguin+Classics+Deluxe+edition%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31ccb58cf65febfec8a58950c71e0a774f493bac","infoHashBuffer":{"type":"Buffer","data":[49,204,181,140,246,95,235,254,200,165,137,80,199,30,10,119,79,73,59,172]},"announce":[],"urlList":[]}}