{"title":"Enemy - HI2U","uid":11764414,"size":738101167,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:31f90453239f7e802bbd676746f8b27eb39148ab&amp;dn=Enemy+-+HI2U&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"dauphong","files":2,"time":1426691398,"description":"Enemy (c) Tom Johnson\n\nRelease Date: 18th March, 2015\nProtection: Steam\nType: Indie, RPG, Strategy\nSize: 1 Disc\n\nDescription:\n\nAbout This Game The video games you played as a kid, mashed together and\nremade into a tactical role-playing game\n\n* Explore an open world where characters, items, and environments are an\neclectic mashup of classic games\n* Detailed turn-based combat system inspired by the 1994 classic, X-Com\n* Realistic physics simulation and large, open environments allow for a rich\nvariety of tactical options\n* Permanent death ensures that combat is always tense\nEvery time you start a new game, the game procedurally generates a new world\nusing decades-old video games as its building blocks. The result is a\ncollision of genres, where haunted swamps, tropical war zones, and peaceful\nmushroom villages all stand side-by-side. You'll build up your own custom\nsquad of retro game characters, with a mix of skills ranging from mental\nhealth and reaction time, to the use of blasters and the ability to jump five\ntimes your own height\n\nEnemy is built on a turn-based combat system closely inspired by the original\nX-Com and Jagged Alliance. You'll devise strategies based around the unique\nset of abilities you've chosen for your team, and then execute them\nstep-by-step, all while responding to counter-moves made by the enemy. It\nmodels the stress of battle on your heroes, who can flee or go berserk if\nthings start to go too wrong. Additionally, everything in the game is\ndestructible. If you damage the supports of a building in the middle of a\nfight, the whole structure can come crashing down on you. Inadvertently\nstarting a small fire in the wrong place can lead to being caught in the\nmiddle of a massive inferno. Combat is dynamic, and easily spirals out of\ncontrol\n\nCover art by Joshua Hutchinson\n\nInstall:\n\nUnrar, mount/burn, install the game, copy crack and play!","torrent":{"xt":"urn:btih:31f90453239f7e802bbd676746f8b27eb39148ab","amp;dn":"Enemy+-+HI2U","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31f90453239f7e802bbd676746f8b27eb39148ab","infoHashBuffer":{"type":"Buffer","data":[49,249,4,83,35,159,126,128,43,189,103,103,70,248,178,126,179,145,72,171]},"announce":[],"urlList":[]}}