{"title":"Warriors' Wrath v1.0.3","uid":14947771,"size":615578482,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3210d9678db55c0e94a71b680967d05d585745b8&amp;dn=Warriors%27+Wrath+v1.0.3&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dauphong","files":1,"time":1466071535,"description":"About This Game\r\nWarriors’ Wrath\r\n\r\nStory:\r\n\r\nAfter three years of struggles against the demons’ invasion, the remaining survivors of mankind decided to launch one last desperate offensive in hope to destroy the demons’ final stronghold and close the portals to Hell once and for all.\r\n\r\nChapters:\r\n\r\nThe journey will take the warriors through three chapters: Ruins of Asia, Winter of Europe, and Sand of Egypt.\r\nIn this chapter, Ruins of Asia, the first frontier of the demon’s defenses, mankind forces must break through the barricade to move westward and reclaim the lands. If we are to survive, the portals of Hell must be reached and annihilated…. Forever.\r\n\r\nFeatures:\r\nWarriors’ Wrath is a mixture of Action RPG, Survival, and Constructing.\r\n\r\n_The game features five playable characters: Knight, Samurai, Viking, Archer, and Wizard\r\n_Fight, level up, acquire new skills and equipment\r\n_Introduces Hunger system. Hunt for food or hunger will decrease combat effectiveness\r\n_Look for materials to craft better items which can help even the odds\r\n_Players can construct their own town and mines to get more materials needed for crafting\r\n_Challenging combats from each enemy, especially bosses.\r\n_Introduces Pet system. Players can look for a special egg in the wild, bring it home, and\r\nnurture it. As it grows up, it can become a useful companion for the journey\r\n_The game also features local coop.\r\n_Some trading cards will contain extra stories during the very first encounter","torrent":{"xt":"urn:btih:3210d9678db55c0e94a71b680967d05d585745b8","amp;dn":"Warriors%27+Wrath+v1.0.3","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3210d9678db55c0e94a71b680967d05d585745b8","infoHashBuffer":{"type":"Buffer","data":[50,16,217,103,141,181,92,14,148,167,27,104,9,103,208,93,88,87,69,184]},"announce":[],"urlList":[]}}