{"title":"[SoM]Caccia a Ottobre rosso[DvdRip-Xvid-Ita-Eng-AC3]","uid":4483005,"size":1477220352,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:32d4df877554daea64122eeb0a2a43a9d4bb4a13&amp;dn=%5BSoM%5DCaccia+a+Ottobre+rosso%5BDvdRip-Xvid-Ita-Eng-AC3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mitimex","files":1,"time":1225647925,"description":"Nel 1984, da una base sovietica non lontana da Murmansk parte &quot;Ottobre Rosso&quot;, sommergibile nucleare agli ordini del Comandante Marko Alexandrovich Ramius, un lituano un po&amp;#039; chiuso, ma umano e rispettato da un equipaggio che ÃƒÂ¨ stato scelto con estrema cura. La partenza non sfugge alla Cia, che incarica uno dei propri agenti (Jack Ryan), di indagare su di una missione che appare subito misteriosa. Ryan scopre, sulla scorta di fotografie attendibili, che il sottomarino puÃƒÂ² manovrare agevolmente anche con propulsione silenziosa. Questo viaggio, ricco di incognite e di reciproche sfide, comincia con l&amp;#039;uccisione dell&amp;#039;ufficiale politico di bordo, continua sia con le dichiarazioni del Comandante ad ufficiali e marinai (lui intende disertare), sia con la caccia assidua che la Marina degli Stati Uniti intende dare al sottomarino. Ad un dato momento, tuttavia, alla caccia prendono parte in gran numero le stesse forza navali sovietiche, poichÃƒÂ¨ &quot;Ottobre Rosso&quot; sta diventando scomodo e pericoloso. Ryan intanto si ÃƒÂ¨ fatto calare da un elicottero sull&amp;#039;Uss &quot;Dallas&quot; (unitÃƒÂ  subacquea): egli ha intuito le intenzioni di Ramius e del suo secondo Borodin (di consegnarsi, cioÃƒÂ¨, agli Stati Uniti, dopo aver ovviamente disposto e assicurato il salvataggio degli uomini). L&amp;#039;&quot;Ottobre Rosso&quot; appare e scompare qua e lÃƒÂ  come un silenzioso fantasma, facendo impazzire i vari sonar, braccato da russi e americani, mentre sul piano diplomatico il Consigliere del Presidente per la sicurezza nazionale e l&amp;#039;ambasciatore dell&amp;#039;URSS appaiono in piena sintonia per avviare la delicatissima faccenda su un piano piÃƒÂ¹ accettabile. Dopo che i sommergibilisti di &quot;Ottobre Rosso&quot; si trovano giÃƒÂ  sui gommoni e dopo che il Comandante del &quot;Dallas&quot; e Ryan sono saliti a bordo di &quot;Ottobre Rosso&quot; collaborando alla manovra decisiva, un siluro lanciato contro il disertore da un suo compatriota centra invece in pieno un sommergibile sovietico, grazie ad una delle ardite, abituali &quot;virate&quot; di Ramius. Un terribile conflitto mondiale ÃƒÂ¨ stato evitato per l&amp;#039;accordo fra le due Grandi Potenze: Ramius - che ÃƒÂ¨ un vedovo senza figli - tenterÃƒÂ  di rifarsi una vita e Ryan riceve le congratulazioni dell&amp;#039;ammiraglio Green da cui dipende. &quot;Ottobre Rosso&quot; ufficialmente considerato scomparso, viene occultato nelle acque di un fiume americano.","torrent":{"xt":"urn:btih:32d4df877554daea64122eeb0a2a43a9d4bb4a13","amp;dn":"%5BSoM%5DCaccia+a+Ottobre+rosso%5BDvdRip-Xvid-Ita-Eng-AC3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"32d4df877554daea64122eeb0a2a43a9d4bb4a13","infoHashBuffer":{"type":"Buffer","data":[50,212,223,135,117,84,218,234,100,18,46,235,10,42,67,169,212,187,74,19]},"announce":[],"urlList":[]}}