{"title":"Danielia Cotton - Rare Child [2008] Blues/Rock","uid":4949691,"size":55197426,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:33f2b3ae8b3e9f3836fa64260b85f1b290b13af0&amp;dn=Danielia+Cotton+-+Rare+Child+%5B2008%5D+Blues%2FRock&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Lowil","files":10,"time":1244830617,"description":"From Amazon:\nEarly indication is that Danielia Cotton is a fiery blues-rock artist with a chip on her shoulder. She doesn't like comparisons, although as of the May 2006 release of her debut disc she was earning them with such titans as Tina Turner, Janis Joplin, and the Rolling Stones. And she doesn't mind letting the world know that the circumstances of her youth were less than ideal: Cotton, according to a mounting pile of press materials, grew up fatherless in rural Hopewell, NJ, as one of only seven black children at the local high school -- thus the title of her CD, Small White Town.\n\nInspiration for a career in music came from her mother, a little-known jazz singer, and two aunts. The three women sang as a trio at church, igniting a passion for big belting in Cotton. Outside of church, though, her musical tastes leaned in an unlikely direction. AC/DC, Judas Priest, Led Zeppelin, and Todd Rundgren -- not hip-hop or R&amp;B -- formed the soundtrack to Cotton's discomfited youth, and shreds of the hard rock bands' fury and of Rundgren's literate sensitivity shade her songs.\n\nEarly adulthood found Cotton and her electric guitar abandoning Hopewell for Manhattan. There she played the rock club circuit, eventually befriending Kevin Salem of the band Chocolate Genius. Salem produced Small White Town, a promising disc full of hurt and hope that, as she finds her footing within the indie scene, should beget a string of powerful others. ~ Tammy La Gorce, All Music Guide.\n\n\nBrought to you by WV Lowil.\n\nEnjoy and Seed you selfish bastard!","torrent":{"xt":"urn:btih:33f2b3ae8b3e9f3836fa64260b85f1b290b13af0","amp;dn":"Danielia+Cotton+-+Rare+Child+%5B2008%5D+Blues%2FRock","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"33f2b3ae8b3e9f3836fa64260b85f1b290b13af0","infoHashBuffer":{"type":"Buffer","data":[51,242,179,174,139,62,159,56,54,250,100,38,11,133,241,178,144,177,58,240]},"announce":[],"urlList":[]}}