{"title":"Buy Me a Pie! Grocery List Pro v1.5","uid":9102004,"size":13825220,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:3403567dbf99d3af8ee489f95a23caef17f89ddc&amp;dn=Buy+Me+a+Pie%21+Grocery+List+Pro+v1.5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Androider","files":-1,"time":1382748692,"description":"\nMillions of shoppers around the world agree that with the Buy Me a Pie! shopping list app they spend less time shopping, save money and the aggravation associated with forgetting grocery items.\n\nAfter winning the hearts of more than 3 million users, the app is finally available on Android!\n\nThe app is fully compatible with the iOS version and lets you make shopping lists and share them with your family, friends, and colleagues on Android and iOS devices, as well as on the site buymeapie.com.\n\nForget paper shopping lists and overcomplicated applications.\nBuy Me a Pie! has only what you really need:\n\n* Automatic synchronization: Keep your lists in sync with those of your family or friends \n* Multi-platform: Use it on Android, iOS or just about any device by going to Buymeapie.com website \n* Simplicity: Our app is used by both children and seniors We constantly work hard to make every part of the app as simple to use as possible\n* Smart grouping: Simply assign a color to the items belonging to the same group (eg store aisle) and the app will then group the items in the list automatically\n* Built-in self-learning dictionary: Entered items are automatically stored in the dictionary for future fast entry through word prompter \n* Word prompter: The app will automatically suggest a word upon entering a few letters so you can quickly add items to a list \n* Up-to-date lists: See every change to your lists in real-time Also get push notification about changes\n* Sharing shopping lists via e-mail, SMS, and other apps, duplicating the lists.\n\nDownload this app to improve your shopping experience, save time and money.\n\nWhat's New:\n\n* The new settings screen which allows you to switch off the notifications sound and to select the dictionary items language not affecting the app interface or system language.\n* Minor bugs fixed.\n\nMore info:\n &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=com.buymeapie.bmap.pro&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=com.buymeapie.bmap.pro&lt;/a&gt;\n","torrent":{"xt":"urn:btih:3403567dbf99d3af8ee489f95a23caef17f89ddc","amp;dn":"Buy+Me+a+Pie%21+Grocery+List+Pro+v1.5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3403567dbf99d3af8ee489f95a23caef17f89ddc","infoHashBuffer":{"type":"Buffer","data":[52,3,86,125,191,153,211,175,142,228,137,249,90,35,202,239,23,248,157,220]},"announce":[],"urlList":[]}}