{"title":"Danzig - Dirty Black Summer","uid":4712372,"size":178860036,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:34fb934c4918fdc56ae12dd684e6cefa445ed9c0&amp;dn=Danzig+-+Dirty+Black+Summer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1234090513,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nDanzig is an American rock band, formed in 1987 in Lodi, New Jersey. The band serves as a musical outlet for singer/composer Glenn Danzig. Danzig can be seen as the third stage in Glenn Danzig's musical career, preceded by the horror punk bands The Misfits and Samhain. They primarily play in a heavy metal style that is largely influenced by the early sound of Black Sabbath, and fuses dark lyrics and imagery with blues-rock influences.\n\nDanzig III: How the Gods Kill is the third album by Glenn Danzig's band Danzig, and the highest to chart at the time of its release in 1992 on Def American Recordings. It was reissued in 1998 by Def American's successor, American Recordings. The album's cover is a 1976 painting called Meister und Margeritha (Master and Margarita) by famous Swiss artist H.R. Giger. For the album cover, Giger modified the original painting slightly, covering &quot;the Master's&quot; erect penis with a dagger bearing his interpretation of the Danzig skull mascot. The tracks &quot;How the Gods Kill&quot; and &quot;Dirty Black Summer&quot; became popular and remain a permanent fixture in the band's set list. The album also was a departure from their previous album and showed more of a Doom metal feel to it. Nevertheless Danzig III became one of Danzig's biggest album and is considered one of their best works to date. Like Danzig's self-titled album and Danzig 4p, this album was issued a Parental Advisory label (originally in the form of a sticker) despite the virtual absence of profanity.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:34fb934c4918fdc56ae12dd684e6cefa445ed9c0","amp;dn":"Danzig+-+Dirty+Black+Summer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34fb934c4918fdc56ae12dd684e6cefa445ed9c0","infoHashBuffer":{"type":"Buffer","data":[52,251,147,76,73,24,253,197,106,225,45,214,132,230,206,250,68,94,217,192]},"announce":[],"urlList":[]}}