{"title":"Soul Eater (English Dubbed) PSP,Ipod,Zune","uid":6690746,"size":4323094017,"categoryP":"video","categoryS":"handheld","magnet":"?xt=urn:btih:35342d3a3a9f27e1600608919c30a1a66b55968d&amp;dn=Soul+Eater+%28English+Dubbed%29+PSP%2CIpod%2CZune&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SpiderLess","files":51,"time":1316572964,"description":"Soul Eater PSP, Ipod, Zune\n\nStoryline:\n\nThe root of all evil is madness, but madness exists in everything. In order to control this paradox, Death-the Shepard of souls, serves as guardian to mankind. Each soul is unique for both it's nature and moral allegiance-a pure soul radiates serenity and strength, a tainted soul radiates madness and unfettered power. While adherence to the former may result in Godhood, lust for the latter will result in the birth of a demon lord- and thus the destroyer of worlds. The balance between these extremes is maintained through the eternal vigilance of Lord Death and his followers, who serve as both his arm and his judgement. Tainted souls are collected by humans under Death's guidance, and used in the formulation of living weapons. These weapons are then wielded by other humans in a symbiotic relationship. Both parties have their fighting abilities amplified by the pairing, so that the wielder (Meister's) and the weapon are able to achieve greater levels of power and efficiency in combat. This merging of souls allows humans to battle against fledgling demons and witches, who otherwise (and in many cases, still do) outmatch them. Meisters that reap 99 tainted souls and 1 witch soul will elevate their weapon partner to the status of a Death Scythe, a weapon so potent that Death himself may choose to wield it. Conversely, the forces of darkness act to create Demon Blades, sentient weapons that thirst for souls of any variety and that, given enough consumption, may be reborn into a Demon Lord-who will then bathe the world in madness. &quot;Soul Eater&quot; follows three teams of Meisters and weapons as they strive to become the strongest protectors of humanity at an Academy founded by Lord Death, who has bound his soul to a city under which the first demon lord's remains reside. Should he ever re-awaken, the world would be ripped asunder-and these unlikely heroes will have to exceed even their own potentials to prevent that from becoming a reality. ","torrent":{"xt":"urn:btih:35342d3a3a9f27e1600608919c30a1a66b55968d","amp;dn":"Soul+Eater+%28English+Dubbed%29+PSP%2CIpod%2CZune","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"35342d3a3a9f27e1600608919c30a1a66b55968d","infoHashBuffer":{"type":"Buffer","data":[53,52,45,58,58,159,39,225,96,6,8,145,156,48,161,166,107,85,150,141]},"announce":[],"urlList":[]}}