{"title":"Smuggle Truck v1.0","uid":8722109,"size":16681038,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:354edaae8c9cce2942903f13ab54859b4bbf9ca9&amp;dn=Smuggle+Truck+v1.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Androider","files":-1,"time":1374439194,"description":"\nSmuggle Truck is an over-the-top physics-based driving game where you must smuggle your passengers over the border in the least amount of time while carefully guiding your truck over rough terrain. \n\nTilt your truck, catch a baby, drive over armadillos, and rocket your way through hills, caverns, deserts, and even Canada in order to save the people!\n\nFeatures:\n\n- Loads of levels packed with varied physics gameplay and challenging terrain and obstacles.\n- The Level Portal gives every player access to unlimited new content thanks to community-created levels.\n- Beautifully hand-painted backgrounds and high resolution graphics crafted by notorious artist of 'Curse of Monkey Island' fame.\n- Built-in Level Editor allows you to showcase your creative side. Make crazy-fun levels and share them with others!\n- Rocket boosters, backflip achievements, cargo covers, roadkill, moose, teeter-totters, TNT, and more! Enough variety to keep your game experience fresh, play after play.\n- Unique medal system rewards multiple gameplay styles. Go for the 'Visa' Award by saving every passenger. Also, try to snag the 'Smugglers Run' medal which can be obtained by gunning it and beating the fastest run time.\n\nA satire about the sad state of the legal immigration systems in place around the world. Read about the story behind the game at Smuggletruck.com\n\nWhat's New:\n\nv1.0 - First Android release. All premium DLC is now included free for a limited time!\n\nMore info:\n &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=com.OwlchemyLabs.SmuggleTruckAndroid&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=com.OwlchemyLabs.SmuggleTruckAndroid&lt;/a&gt;\n","torrent":{"xt":"urn:btih:354edaae8c9cce2942903f13ab54859b4bbf9ca9","amp;dn":"Smuggle+Truck+v1.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"354edaae8c9cce2942903f13ab54859b4bbf9ca9","infoHashBuffer":{"type":"Buffer","data":[53,78,218,174,140,156,206,41,66,144,63,19,171,84,133,155,75,191,156,169]},"announce":[],"urlList":[]}}