{"title":"Wordfeud v2.4.0","uid":8671420,"size":2162052,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:360ff75be76f07f721fa828e28639246c79d1149&amp;dn=Wordfeud+v2.4.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Androider","files":-1,"time":1373500624,"description":"\nWordfeud is a cross-platform multiplayer puzzle game available for Android and iPhone. Challenge friends and random opponents and play in up to 30 separate games simultaneously!\n\nCreate and place words on the 15 by 15 tile board and earn points for creativity and placing letters on the high scoring Double Letter, Double Word, Triple Letter and Triple Word tiles.\n\nSearch for friends to play against or allow Wordfeud to match you up with an opponent. Even chat with them - smack talk or praise - it's your choice!\n\nTired of the same standard board each game? Choose the option to randomize the board and change up where the DL, TL, DW, TW tiles are placed - giving the classic game a new twist!\n\nFeatures:\n\n- Choose to play with friends or be matched up against random opponents \n- Play in 30 simultaneous games! \n- Random board option to mix up the DL, DW, TL, TW tiles \n- Push notifications informing you of opponent's latest move \n- Uses English, German, Spanish, French, Dutch, Norwegian, Swedish, Finnish and Danish dictionaries \n- Chat with your opponents\n\nWhat's in this version:\n\n- We've added a Finnish dictionary!\n- We've changed the rating algorithm, so everyone has new ratings!\nWith the new rating algorithm (based on ELO) you'll never lose rating points if you win. We've also made it less sensitive so that a single win or loss doesn't result in a huge change in your rating.\nWe've recalculated everybody's rating history, so you'll likely find that your rating has changed quite a bit. But so has everybody else's rating, so it should be completely fair.\n\nMore info:\n &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=com.hbwares.wordfeud.full&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=com.hbwares.wordfeud.full&lt;/a&gt;\n","torrent":{"xt":"urn:btih:360ff75be76f07f721fa828e28639246c79d1149","amp;dn":"Wordfeud+v2.4.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"360ff75be76f07f721fa828e28639246c79d1149","infoHashBuffer":{"type":"Buffer","data":[54,15,247,91,231,111,7,247,33,250,130,142,40,99,146,70,199,157,17,73]},"announce":[],"urlList":[]}}