{"title":"Blues Media Player v24.08.2013  audio/video converter","uid":8901044,"size":14907628,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:37e93587568c1dc3d0ca2f11c31859be0dcd4506&amp;dn=Blues+Media+Player+v24.08.2013++audio%2Fvideo+converter&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Ronnieqwe","files":1,"time":1378810189,"description":"Blues Media Player is a media player for Windows which can play a large number of formats. The program supports subtitles, CUE Sheet and provides several ways \n\nto control the playback of files. Player includes built-in support for all the most popular audio formats.It supports the DirectSound and WASAPI audio \n\ninterfaces.\n\n- Audio Converter (MP3, FLAC, APE, AAC, WAV, M4A, WMA, OGG, AC3, TTA, MPC, AIFF, RA)\n- Video Converter (AVI, MPG, FLV, MKV, MP4, WMV, 3GP, MOV, VOB) \n\nAs a full-featured free program, Blues Media Player gives users the ability to play music, videos, and Blu-ray files. Although there are a lot of media players in existence, this one has a smaller learning curve and is less of a hassle to use, compared to other players.\n\nBlues Media Player allows you to create playlists and switch between them. Playlists that you create exist as tabs in the main play window. Each playlist can include not only music, but also videos. The video preview window is small, but you can easily place the program in video mode and toggle back to normal mode with one click each. You can manually make the preview screen larger by dragging the frame or you can increase the frame size with specific buttons. Video can be full screen, as well. The video window can be used for visualization, similar to other programs, while you listen to music. In addition, this program allows you to indicate a URL and play streaming audio or video. A nice feature is the ability to set a playlist to be played at a particular time and then the ability to have the player control the state of your computer such as Sleep, Hibernate, Log Off, Lock, Shutdown, etc. This means that you can use the player as either an alarm clock or as a sleep aid. It's great that the program is intuitive because there is no help available. The Web site leads you to various available codecs to add, but does not help you operate the program.","torrent":{"xt":"urn:btih:37e93587568c1dc3d0ca2f11c31859be0dcd4506","amp;dn":"Blues+Media+Player+v24.08.2013++audio%2Fvideo+converter","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"37e93587568c1dc3d0ca2f11c31859be0dcd4506","infoHashBuffer":{"type":"Buffer","data":[55,233,53,135,86,140,29,195,208,202,47,17,195,24,89,190,13,205,69,6]},"announce":[],"urlList":[]}}