{"title":"Core HTML5 Canvas  {BBS}","uid":7572669,"size":22980492,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:399ce2aae0984965956c48b037a6bdb071f9961c&amp;dn=Core+HTML5+Canvas++%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1346031765,"description":"One of HTML5's most exciting features, Canvas provides a powerful 2D graphics API that lets you implement everything from word processors to video games. In Core HTML5 Canvas, best-selling author David Geary presents a code-fueled, no-nonsense deep dive into that API, covering everything you need to know to implement rich and consistent web applications that run on a wide variety of operating systems and devices.\n \nSuccinctly and clearly written, this book examines dozens of real-world uses of the Canvas API, such as interactively drawing and manipulating shapes, saving and restoring the drawing surface to temporarily draw shapes and text, and implementing text controls. You'll see how to keep your applications responsive with web workers when you filter images, how to implement smooth animations, and how to create layered, 3D scrolling backgrounds with parallax. In addition, you'll see how to implement video games with extensive coverage of sprites, physics, collision detection, and the implementation of a game engine and an industrial-strength pinball game. The book concludes by showing you how to implement Canvas-based controls that you can use in any HTML5 application and how to use Canvas on mobile devices, including iOS5. This authoritative Canvas reference covers \n\n    *\n      The canvas element--using it with other HTML elements, handling events, printing a canvas, and using offscreen canvases\n    *\n      Shapes--drawing, dragging, erasing, and editing lines, arcs, circles, curves, and polygons; using shadows, gradients, and patterns\n    *\n      Text--drawing, positioning, setting font properties; building text controls\n    *\n      Images--drawing, scaling, clipping, processing, and animating\n    *\n      Animations--creating smooth, efficient, and portable animations\n    *\n      Sprites--implementing animated objects that have painters and behaviors\n    *\n      Physics--modeling physical systems (falling bodies, pendulums, and projectiles), and implementing tweening for nonlinear motion and animation\n    *\n      Collision detection--advanced techniques, clearly explained\n    *\n      Game development--all aspects of game development, such as time-based motion and high score support, implemented in a game engine\n    *\n      Custom controls--infrastructure for implementing custom controls; implementing progress bars, sliders, and an image panner\n    *\n      Mobile applications--fitting Canvas apps on a mobile screen, using media queries, handling touch events, and specifying iOS5 artifacts, such as app icons \n\nThroughout the book, Geary discusses high-quality, reusable code to help professional developers learn everything they really need to know, with no unnecessary verbiage. All of the book's code and live demonstrations of key techniques are available at CoreHTML5Canvas.com.\n\n\n\n\n# Paperback: 752 pages\n# Publisher: Prentice Hall; 1 edition (May 14, 2012)\n# Language: English\n# ISBN-10: 0132761610\n# ISBN-13: 978-0132761611","torrent":{"xt":"urn:btih:399ce2aae0984965956c48b037a6bdb071f9961c","amp;dn":"Core+HTML5+Canvas++%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"399ce2aae0984965956c48b037a6bdb071f9961c","infoHashBuffer":{"type":"Buffer","data":[57,156,226,170,224,152,73,101,149,108,72,176,55,166,189,176,113,249,150,28]},"announce":[],"urlList":[]}}