{"title":"iKamasutra® - Sex Positions 3.1.7 Build 53","uid":13731258,"size":30130124,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:3a2ba6ead60456801a996214deb89c612904075e&amp;dn=iKamasutra%26reg%3B+-+Sex+Positions+3.1.7+Build+53&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"acer47x","files":1,"time":1457013589,"description":"Lovingly written and illustrated exclusively for this Android app, iKamasutra® brings thousands of years of Kama Sutra experimentation into one incredibly fun and sensual app. View over one hundred sex positions in 9 categories, each tastefully drawn and explained, and enjoy tracking your progress from Novice to Kama Sutra Grand Master using the world's ultimate guide to sex. iKamasutra® is the most highly recommended app of its kind, with a beautifully designed and pleasing interface. You may never be able to stop glancing at your phone again!\r\n\r\nThere’s a position for that.\r\n· 110 of the most popular sex positions come included with your app purchase to motivate and inspire you. (More available through in-app purchase.)\r\n· Easy-to-follow, professionally written descriptions move you quickly into position. \r\n· Nine categories to get your desires organized—everything from Cowgirl to Exotic.\r\n· Soothing sitar music to set the right mood (optional).\r\n· Password-protect the app to maintain your privacy.\r\n\r\nStretch to your limits.\r\n· Track your progress from Novice to Kamasutra Grand Master by marking positions you've tried.\r\n· Search for the perfect position based on Intimacy, Complexity &amp; Strength levels.\r\n· Create a list of Favorite positions as well as a To Do list for positions you just have to attempt.\r\n· A Places challenge lets you keep track of where you make love, not just how.\r\n\r\nShake it, baby. You’ll like it.\r\n· Ask your partner to shake the phone to choose a random new position.\r\n· Swipe left or right to view the next position.\r\n· Add your own personal notes to each position. \r\n· Rotate the phone to landscape for a full-screen slideshow.\r\n\r\nEmail just got exciting again.\r\n· Email positions to your partner any time of day, right from your phone.\r\n· No time for email? You and your partner can view Today's Position and get busy! \r\n· Be the envy of all your friends by sharing your progress or favorite positions by email,or Twitter.\r\n\r\n*** Attention Kama Sutra Masters! Are you a true sexual position pro, or just looking for more exotic pleasures? We've kept the app price to a minimum by including the first 110 positions and 27 places free, but additional positions and places may be purchased inside the app's Love Store","torrent":{"xt":"urn:btih:3a2ba6ead60456801a996214deb89c612904075e","amp;dn":"iKamasutra%26reg%3B+-+Sex+Positions+3.1.7+Build+53","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a2ba6ead60456801a996214deb89c612904075e","infoHashBuffer":{"type":"Buffer","data":[58,43,166,234,214,4,86,128,26,153,98,20,222,184,156,97,41,4,7,94]},"announce":[],"urlList":[]}}