{"title":"What Young India Wants[2012] - Chethan Bhagath [NooNMaN].pdf","uid":7664052,"size":7376685,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3b06aea6ce24831975bafbde9540aabe2eb7f286&amp;dn=What+Young+India+Wants%5B2012%5D+-+Chethan+Bhagath+%5BNooNMaN%5D.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"NooNMaN","files":1,"time":1348389098,"description":"Book Summary of What Young India Wants\n\nIn his latest book, What Young India Wants, Chetan Bhagat asks hard questions, demands answers and presents solutions for a better, more prosperous India.\n\nWhy do our students regularly commit suicide?\nWhy is there so much corruption in India?\nCant our political parties ever work together?\nDoes our vote make any difference at all?\nWe love our India, but shouldnt some things be different?\n\nAll of us have asked these questions at some time or the other. So does Chetan Bhagat, Indias most loved writer, in What Young India Wants, his first book of non-fiction.\n\nWhat Young India Wants is based on Chetan Bhagats vast experience as a very successful writer and motivational speaker. In clear, simple prose, and with great insight, he analyses some of the complex issues facing modern India, offers solutions and invites discussion on them. And, at the end, he asks this important question: Unless we are all in agreement on what it is going to take to make our country better, how will things ever change? Non-fiction If you want to understand contemporary India, the problems that face it, and want to be a part of the solution, What Young India Wants is the book for you.","torrent":{"xt":"urn:btih:3b06aea6ce24831975bafbde9540aabe2eb7f286","amp;dn":"What+Young+India+Wants%5B2012%5D+-+Chethan+Bhagath+%5BNooNMaN%5D.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b06aea6ce24831975bafbde9540aabe2eb7f286","infoHashBuffer":{"type":"Buffer","data":[59,6,174,166,206,36,131,25,117,186,251,222,149,64,170,190,46,183,242,134]},"announce":[],"urlList":[]}}