{"title":"The Jon Spencer Blues Explosion - Plastic Fang","uid":4186804,"size":69022036,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3bdb7513bddb318855dc30eb9cfc9a94c755aa5d&amp;dn=The+Jon+Spencer+Blues+Explosion+-+Plastic+Fang&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"billy_stretcher","files":16,"time":1210716940,"description":"The John Spencer Blues Explosion\nPlastic Fang\nBlues/Garage rock\n2002\n192Kbps\n\n1.Sweet N Sour\n2.She Said\n3.Money Rock&amp;#039;N&amp;#039;Roll\n4.Killer Wolf\n5.Tore Up &amp; Broke\n6.Hold On\n7.Down In The Beast\n8.Shakin&amp;#039; Rock&amp;#039;N&amp;#039;Roll Tonight\n9.The Midnight Creep\n10.Over And Over\n11.Mother Nature\n12.Mean Heart\n\nFront, Back, CD Cover And Inlay Included.\n\nBetween 1999&amp;#039;s Acme--Plus and Plastic Fang, the crunching garage rock &amp; roll that the Jon Spencer Blues Explosion has been playing for years became the most fashionable music on the planet. As the White Stripes were feted everywhere for revitalising a supposedly dormant tradition, where did that leave JSBE? Perhaps wisely, Plastic Fang largely abandons the subtler textures, hip-hop remixes and suspicious modernism of its predecessor. Instead, these are 12 tracks of impressively unreconstructed rock &amp; roll and swamp-R&amp;B informed by male hormones, horror movies and a lot of very good old records. Of course, certain factors remain that have always mitigated against Spencer achieving real superstardom. The curled-lip histrionics are sometimes just a little too preposterous, coming as they do from a moneyed and urbane New York father. Furthermore, Spencer&amp;#039;s music has always relied more on killer riffs than fully formed songs: something he tries, with partial success, to remedy here. &quot;Tore Up &amp; Broke&quot;, in particular, is the fullest realisation of the Rolling Stones obsession he&amp;#039;s nurtured since his previous band, Pussy Galore, covered Exile On Main Street in its entirety. A couple more tunes would&amp;#039;ve been nice, then. Nevertheless, Plastic Fang is terrific entertainment, historically rigorous but always suitably wild and dumb. Dr John, Funkadelic alumnus Bernie Worrell and, bizarrely, Elliott Smith turn up to the studio and grind along gamely, giving the impression it was a great party. And cleverly, even if it wasn&amp;#039;t, the Blues Explosion certainly make it sound like it was. Phew, rock &amp; roll!\n\nEnjoy! :)","torrent":{"xt":"urn:btih:3bdb7513bddb318855dc30eb9cfc9a94c755aa5d","amp;dn":"The+Jon+Spencer+Blues+Explosion+-+Plastic+Fang","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3bdb7513bddb318855dc30eb9cfc9a94c755aa5d","infoHashBuffer":{"type":"Buffer","data":[59,219,117,19,189,219,49,136,85,220,48,235,156,252,154,148,199,85,170,93]},"announce":[],"urlList":[]}}