{"title":"Cymoedd.Roy.Noble--Welsh-BBC-2016-w.subs-468p","uid":13696954,"size":1603033132,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3ce1bca269272f16fe2b58bc303c2b112dcdd50b&amp;dn=Cymoedd.Roy.Noble--Welsh-BBC-2016-w.subs-468p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"uggauga","files":12,"time":1456708351,"description":"Cymoedd Roy Noble\r\n\r\nRoy Noble sy'n crwydro Cymoedd De Cymru gan ddysgu mwy am yr hanes a'r bobl.\r\nRoy Noble explores the Welsh Valleys finding out more about the history and people.\r\n\r\nBBC (2016) - 6 Episodes\r\n \nhttp://www.bbc.co.uk/programmes/p03f5zkz\r\n_______________________________________\r\n\r\n832x468 resolution\r\n\r\nVideo Codec h.264\r\nAudio Codec AAC\r\n\r\nWelsh with English subtitles - enjoy !!\r\n_______________________________________\r\n\r\nPennod 1\r\nRoy Noble sy'n mentro i gyfeiriad Cwm Rhondda yn rhaglen gynta'r gyfres sy'n canolbwyntio ar Gymoedd De Cymru.\r\nBroadcaster Roy Noble introduces a series based on six valleys in South Wales. In the first edition, he starts his journey in the Rhondda Valley, where Dr Siân Williams tells the story of one of Rhondda's heroines, Elizabeth Andrews. The presenter then visits the Penrhys estate to catch up with its recent success story, and finds out more about Maerdy's historical connection with Moscow.\r\n\r\nPennod 2\r\nBydd Roy yn ymweld â Chwm Cynon ac yn cychwyn ei daith lan y lôn ym mhentref Penderyn gan alw yng ngwesty'r Lamb.\r\nA tour of the Cynon Valley, where Roy visits one of the world's smallest distilleries in Penderyn and the Royal Opera House stores in Mountain Ash, and meets two passionate Welsh speakers. The journey comes to an end in Aberfan, where he listens to personal stories of the tragic landslide that struck the area in 1996.\r\n\r\nPennod 3\r\nBydd Roy yn cychwyn ei daith ym Merthyr Tudful cyn symud ymlaen i Gwm Rhymni.\r\nThe broadcaster visits Cyfarthfa Castle in Merthyr Tydfil, where he learns the history of the Crawshays and meets the chair of the Welsh Language Society. He then travels to the Rhymney valley, where he visits Gelligaer common with author and hill walker Aled Elwyn Jones, before attending an evening of music hall entertainment with the Tredegar Town Band.\r\n\r\nPennod 4\r\nBydd Roy yn ymweld ag un o gymoedd Blaenau Gwent - Glyn Ebwy, Aberbeeg, Abertyleri, Cwm, Nantyglo a Brynmawr.\r\nThe presenter visits one of the valleys in Blaenau Gwent, exploring the regenerated site of the old steel works at Ebbw Vale. He meets the sister of the late actor Victor Spinetti in Cwm before moving on to the village of Six Bells near Abertillery, and Nantyglo. His journey ends in Brynmawr, where he attends an outdoor screening at the town's Market Hall Cinema.\r\n\r\nPennod 5\r\nHeddiw, bydd Roy yn ymweld â Blaenafon a Phont-y-pwl gan sgwrsio â'r ddau gyn chwaraewr rygbi Clive Rowlands a Gerald Davies.\r\nBroadcaster Roy Noble visits the Rhymney Brewery in Blaenavon and meets a PR executive in Garndiffaeth. He then moves on to Pontypool, where he meets a female barber and visits the rugby ground, where two local residents look back on an infamous match against Cardiff in 1978. His journey ends in Penalltau, where he chats to an inspirational teacher.\r\n\r\nPennod 6\r\nYn y rhaglen olaf bydd Roy yn ymweld â Chaerffili a Senghennydd cyn dychwelyd i Gwm Rhondda drwy Bontypridd.\r\nThe last leg of the journey sees Roy travel through Bedwas, where he meets a pig farmer, and Senghenydd, where he looks back on the underground disaster of 1901. He moves on to Pontypridd and visits the local lido, and discovers the story of local physician and nationalist Dr William Price. Finally, his journey comes full circle as he returns to the Rhondda valley. Last in the series","torrent":{"xt":"urn:btih:3ce1bca269272f16fe2b58bc303c2b112dcdd50b","amp;dn":"Cymoedd.Roy.Noble--Welsh-BBC-2016-w.subs-468p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ce1bca269272f16fe2b58bc303c2b112dcdd50b","infoHashBuffer":{"type":"Buffer","data":[60,225,188,162,105,39,47,22,254,43,88,188,48,60,43,17,45,205,213,11]},"announce":[],"urlList":[]}}