{"title":"Islam a very short introduction - Malise Ruthven","uid":7596212,"size":109142880,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:3d38f13f552d28f93c348c56521dad3d6b0a6da0&amp;dn=Islam+a+very+short+introduction+-+Malise+Ruthven&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cloak-and-dagger","files":-1,"time":1346701994,"description":"Islam features widely in the news, often in its most militant versions. But few people in the non-Muslim world really understand the nature of Islam, both as Ideology and religion. Islam: A Very Short Introduction offers essential insight into the structure and beliefs of this major world religion.\nMalise Ruthven answers fundamental questions about the nature and scope of Islam such as why the greatest Jihad (holy war) is now against the enemies of Islam, rather than the struggle against evil, why Islam has such major divisions between movements such as the Shiis, the Sunnis, and the Wahhabis, and how the Sharia (Islamic law) has become such an important aspect of Islamic life. In addition, he prompts further questioning into the ideas of Islamic resurgence as both an old and new concept, whether or not women can find fulfillment and equality within an Islamic framework, and the sort of problems facing Islam and its confrontations with the modern world.\nOffering fresh insights and new information, Islam: A Very Short Introduction provides a much needed discussion of Islam's past, present, and future, and its place in modern world religions.","torrent":{"xt":"urn:btih:3d38f13f552d28f93c348c56521dad3d6b0a6da0","amp;dn":"Islam+a+very+short+introduction+-+Malise+Ruthven","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d38f13f552d28f93c348c56521dad3d6b0a6da0","infoHashBuffer":{"type":"Buffer","data":[61,56,241,63,85,45,40,249,60,52,140,86,82,29,173,61,107,10,109,160]},"announce":[],"urlList":[]}}