{"title":"Jose Luis Corral - El Numero de Dios  [Epub][Spanish]","uid":7027901,"size":2574040,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3df0e53541b7ee1551ccfe79864c95a92449d483&amp;dn=Jose+Luis+Corral+-+El+Numero+de+Dios++%5BEpub%5D%5BSpanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"virana","files":-1,"time":1329130870,"description":"El nÃƒÂºmero de Dios (JosÃƒÂ© Luis Corral)Epub - Pdf\n\nEn la Edad Media, el siglo XIII fue el siglo de la mujer y de las catedrales, una ÃƒÂ©poca de culto a la poesÃƒÂ­a, al amor y a la inteligencia que encuentra una de sus expresiones mÃƒÂ¡s acabadas en el arte gÃƒÂ³tico, que permite el maridaje entre la belleza artÃƒÂ­stica y el homenaje a la deidad cristiana. Sun embargo, es tambiÃƒÂ©n una ÃƒÂ©poca de persecuciones religiosas que obligan a la clandestinidad y al silencio a personajes como la protagonista de El nÃƒÂºmero de Dios, Teresa Rendol. Hija de un maestro pintor y pintora ella misma desde muy joven, su azarosa historia la lleva a ser protagonista de la construcciÃƒÂ³n de las catedrales de Burgos y LeÃƒÂ³n, y a entrar en contacto con uno de los secretos mejor guardados, transmitidos de generaciÃƒÂ³n en generaciÃƒÂ³n entre el gremio de arquitectos, el nÃƒÂºmero de Dios, el secreto sobre el que se sustentan las catedrales del nuevo estilo importado de Francia.\n\nEn su regreso al Medievo, JosÃƒÂ© Luis Corral nos ofrece un detallado paisaje histÃƒÂ³rico de un momento clave en la evoluciÃƒÂ³n artÃƒÂ­stica e ideolÃƒÂ³gica de Europa, al tiempo que nos sumerge en un misterio de primera magnitud.\n\nSinopsis:\n\nAl hilo de la trayectoria de Teresa Rendol, una pintora acosada por las persecuciones religiosas, &quot;El nÃƒÂºmero de Dios&quot; se centra en la construcciÃƒÂ³n de las catedrales de Burgos y LeÃƒÂ³n, para exponer la transmisiÃƒÂ³n del secreto con que los constructores de la ÃƒÂ©poca erigÃƒÂ­an sus monumentales edificios. Esto permite al autor exponer un momento de transiciÃƒÂ³n en la historia del arte (la llegada a la PenÃƒÂ­nsula del gÃƒÂ³tico), mostrar la amenaza que suponÃƒÂ­a la InquisiciÃƒÂ³n, recrear las formas de vida de la ÃƒÂ©poca, y mostrar la situaciÃƒÂ³n de la mujer y el papel poco conocido que tuvo en la construcciÃƒÂ³n y decoraciÃƒÂ³n de catedrales. Como sucede casi siempre en las novelas de Corral, bajo el argumento apasionante va desplegÃƒÂ¡ndose un colorista fresco histÃƒÂ³rico de la ÃƒÂ©poca. ","torrent":{"xt":"urn:btih:3df0e53541b7ee1551ccfe79864c95a92449d483","amp;dn":"Jose+Luis+Corral+-+El+Numero+de+Dios++%5BEpub%5D%5BSpanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3df0e53541b7ee1551ccfe79864c95a92449d483","infoHashBuffer":{"type":"Buffer","data":[61,240,229,53,65,183,238,21,81,204,254,121,134,76,149,169,36,73,212,131]},"announce":[],"urlList":[]}}