{"title":"Star Trek 1 - La Pelicula (1979) [DVDRip]","uid":6426297,"size":732678938,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3dfce2a79a0a3daafc929c187ebc9ebf69f54efd&amp;dn=Star+Trek+1+-+La+Pelicula+%281979%29+%5BDVDRip%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"virana","files":1,"time":1306487335,"description":"Star treK (1979) La Pelicula\n\n\nTÃƒÂ­tulo original: Star Trek: The Motion Picture\nAÃƒÂ±o: 1979\nPaÃƒÂ­s: USA\nGÃƒÂ©nero: Ciencia FicciÃƒÂ³n\nDuraciÃƒÂ³n: 131 min\nDirector: Robert Wise\n\nReparto: William Shatner, Leonard Nimoy, DeForest Kelley, James Doohan, Nichelle Nichols, George Takei, Walter Koenig, Majel Barrett, Grace Lee Whitney, Stephen Collins, Mark Lenard, David Gautreaux, Jon Rashad Kamal, Marcy Lafferty\n\nArgumento: Una enorme nave de procedencia desconocida es avistada con rumbo directo a la Tierra, destruyendo a su paso varias naves y estaciones Klingon y de la FederaciÃƒÂ³n. El Enterprise es requerido para investigar su procedencia y los motivos que le llevan a su actual destino. Tras reunir a la antigua tripulaciÃƒÂ³n, que se habÃƒÂ­a separado por distintos motivos, y al capitÃƒÂ¡n retirado James T. Kirk (William Shatner), la misiÃƒÂ³n se pone en marcha. Al encontrarse frente a su objetivo los primeros intentos de comunicaciÃƒÂ³n fracasan, y son atacados. El descubrimiento de nuevos datos revelarÃƒÂ¡ un origen de la amenaza tan sorprendente que les obligarÃƒÂ¡ a emplearse como nunca antes lo habÃƒÂ­an hecho: en esta ocasiÃƒÂ³n toda la avanzada tecnologÃƒÂ­a a su disposiciÃƒÂ³n se mostrarÃƒÂ¡ completamente inÃƒÂºtil, y deberÃƒÂ¡n valerse de toda la experiencia acumulada a lo largo de sus misiones en el pasado.\n                               [img]http://img806.imageshack.us/img806/5257/startrekmotionpicture.jpg[/img]\n\n&quot;Star Trek: La PelÃƒÂ­cula&quot; es la primera incursiÃƒÂ³n de la saga Star Trek en el cine, casi un experimento para comprobar la acogida que podrÃƒÂ­a tener entre el pÃƒÂºblico en general (mÃƒÂ¡s allÃƒÂ¡ de los fans de la serie), y resultÃƒÂ³ francamente interesante. Mantiene la estructura y la intriga de los mejores episodios con temÃƒÂ¡tica de misterio de la serie, narrada eso sÃƒÂ­ con muchos mÃƒÂ¡s medios dado el mucho mayor presupuesto de una producciÃƒÂ³n cinematogrÃƒÂ¡fica. Eso se plasma en un espectÃƒÂ¡culo visual digno de disfrutarse, para una pelÃƒÂ­cula que, si bien puede hacerse en algunos momentos un poco larga o lenta por mostrar en algo mÃƒÂ¡s de dos horas lo que en la televisiÃƒÂ³n se ofrecerÃƒÂ­a en 40 minutos, resulta sin duda interesante para los aficionados al cine de aventura o de ciencia ficciÃƒÂ³n, y de seguro una autÃƒÂ©ntica gozada para los aficionados a la serie.\n","torrent":{"xt":"urn:btih:3dfce2a79a0a3daafc929c187ebc9ebf69f54efd","amp;dn":"Star+Trek+1+-+La+Pelicula+%281979%29+%5BDVDRip%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3dfce2a79a0a3daafc929c187ebc9ebf69f54efd","infoHashBuffer":{"type":"Buffer","data":[61,252,226,167,154,10,61,170,252,146,156,24,126,188,158,191,105,245,78,253]},"announce":[],"urlList":[]}}