{"title":"Violent Religion - An introduction to the most violent faith","uid":6068409,"size":75420,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3ec9a1c4872f5023e1653d96d51d8811c6f54c92&amp;dn=Violent+Religion+-+An+introduction+to+the+most+violent+faith&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Feril","files":1,"time":1293498139,"description":"Why is that no one else but only Muslims are so violent? WHY? What has Islamic countries have so far contributed to the world. Nothing!!! Zero. Only thing Islam has given is slaughtering of human beings and sacrificing animals together. That is why millions yes MILLIONS of Muslims who can think on their own want to leave or have left Islam - the violent religion. Islam is the most horrible white Arab imperialistic movement for past 1400 years and the time has come to finish with it.\nLook at the overall 1400 years of Islamic history. What they have done and slaughtered millions and millions of innocent people in all over Islamicized countries eclipse a few million killed by Communism and European wars. \n\nLook at todays world. Why is that almost all violence of past 2 decades is leading to Pakistan, Saudi Arabia, Yemen and Syria, Palestine, Somalia and all other Muslim countries.\n\nRead through these pages and all possible links and you will see that Islam is not a religion from any angle. It is a mafia that gags all its forced &quot;followers&quot; who unfortunately are born in families who already were in the ring and they find it very hard to leave because any protest, any inquiry or questions asked, you are threatened to be gagged or killed. Islam is the biggest danger to humanity. Please world wake up before it is too late. The Muslim Brotherhood is now preparing itself to attack Europe, Russia, India, Americas with Nuclear and Bio weapons and you all will be gone. WAKE UP NOW. It is important to recognize the huge monster. Old USSR and Mao's China were nothing in front of this huge monster. The attacks from Muslims in form of terrorism were just minor sparks, the real fire is being prepared. IF YOU DO NOT WAKE UP AND DO NOT WAKE UP YOUR LEADERS, YOUR GOVERNMENTS you are doomed. This is not a laughing matter. It is not a joke. It is reality. Sheer reality exposed by insiders.","torrent":{"xt":"urn:btih:3ec9a1c4872f5023e1653d96d51d8811c6f54c92","amp;dn":"Violent+Religion+-+An+introduction+to+the+most+violent+faith","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ec9a1c4872f5023e1653d96d51d8811c6f54c92","infoHashBuffer":{"type":"Buffer","data":[62,201,161,196,135,47,80,35,225,101,61,150,213,29,136,17,198,245,76,146]},"announce":[],"urlList":[]}}