{"title":"Melting Stones - Tamora Pierce","uid":4351932,"size":535997234,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:3ed441cb2d86cad52c7ae0560f72e809ab164d08&amp;dn=Melting+Stones+-+Tamora+Pierce&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Darrigo11","files":516,"time":1219203076,"description":"Originally uploaded by bookworm7 on\n\nNOTE: Some of the links to the other books in the series are broken but most can be found anyway by using the search function on\n\nAudio Books : Fantasy : MP3/128Kbps : English\n\nMelting Stones \nThe new Circle of Magic fantasy features Grace Kelly as Evvy, an apprentice stone mage. She is able to suspend her physical self and explore the depths of the earth, sensing and, at times, influencing the course of nature. With her mentor, Rosethorn, and the powerful Luvo, she is challenged to solve the mysterious withering of an island whose plants and waters are dying. While the production has some over-the-top sound effects, Kelly delivers a strong performance, and the Full Cast voices align well with their characters. Listeners will especially enjoy the authors participation. \nFour years have passed since Evvy left the streets of Chammur to begin her training as a stone mage. At fourteen, she&amp;#039;s unhappy to be on a new journey with her mentor, prickly green mage Rosethorn, who has been called to the Battle Islands to determine why the plants and animals there are dying. Evvy&amp;#039;s job is to listen and learn, but she can&amp;#039;t keep quiet and do nothing. With the help of Luvo, the living stone heart of a mountain, Evvy uncovers an important clue. Now, with the island on the brink of disaster, it&amp;#039;s up to Evvy to avert the destruction that looms ahead. \n128kbps My thanks to the original uploader! \n\nIncluding the audiobooks that I&amp;#039;ve uploaded, here&amp;#039;s a list of Tamora Pierce audiobooks here on Demonoid: \n\nSong of the Lioness Quartet -All four audiobooks are in this torrent created by anexv \nAlanna, The First Adventure - Unabridged \nIn the Hand of the Goddess - Unabridged \nThe Woman Who Rides Like A Man - Unabridged \nLioness Rampant - Unabridged \n\nThe Immortals Quartet - All four were uploaded by quartet1977!! \nBook 1 thru 4 -\nWild Magic \nWolf Speaker \nEmperor Mage \nThe Realms of the Gods \n\nProtector of the Small Quartet - Retail audiobooks are being made for these, but the only one currently available is by Listening Library, as an Unabridged edition with Bernadette Dunne as the reader. ISBN-10: 0739356496 ISBN-13: 978-0739356494 Anybody willing to share it, please?? \nThe retail audiobook for the second in the series, Page, is due out on November 25th, 2008. \nFirst Test \nPage \nSquire \nLady Knight \n\nDaughter of the Lioness series - both are available as audiobooks and I have done them as 64 kbp MP3 files. Both are read by Trini Alvarado. \nTrickster&amp;#039;s Choice -\n\nTrickster&amp;#039;s Queen -\n\nThe Circle of Magic Quartet -All four audiobooks are in this torrent created by TheLizzard1979 \nSandry&amp;#039;s Book - Book I \nTris&amp;#039;s Book - Book II \nDaja&amp;#039;s Book - Book III \nBriars Book - Book IV \n\nThe Circle Opens Quartet - One of the four volumes is available! \nMagic Steps \nStreet MagicThanks to st0005 \nCold Fire \nShatterglass \n\nThe Will of the Empress -- This novel begins two years after the Circle of Magic and The Circle Opens series. Thanks to a fellow Demonoid member who shared this with me! \n\nBeka Cooper series \n1 - Terrier -Thanks to st0005 \n\nAlmost all of these are available as e-books in a torrent by lorem101 -","torrent":{"xt":"urn:btih:3ed441cb2d86cad52c7ae0560f72e809ab164d08","amp;dn":"Melting+Stones+-+Tamora+Pierce","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ed441cb2d86cad52c7ae0560f72e809ab164d08","infoHashBuffer":{"type":"Buffer","data":[62,212,65,203,45,134,202,213,44,122,224,86,15,114,232,9,171,22,77,8]},"announce":[],"urlList":[]}}