{"title":"TSSeduction--TS-34062 Madison Leigh, TS Jessy Dubai and Lance Ha","uid":9091257,"size":2459460997,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:3ffa570c53969807f6b4157d7d710e81e620a72f&amp;dn=TSSeduction--TS-34062+Madison+Leigh%2C+TS+Jessy+Dubai+and+Lance+Ha&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"merzedes","files":-1,"time":1382601411,"description":"HOT THREESOME WITH TS BABE JESSY DUBUI, A GUY AND NEW INNOCENT GIRL!\n\nOct 23, 2013 - Performers: Lance Hart ,  TS Jessy Dubai   and  Madison Leigh \n \n  \nMP4 and WMV + Pics.\n\n\nTsSeduction.com feature presentation with the finest new talent to hit the net in a long time. Welcome Jessy Dubui in her debut scene with porn hot star Lance Hart and newcomer starlet, Madison Leigh. This threesome is on fire with hot scene three squirting pop shots, and multiple wet orgasms from Madison Leigh's well fucked pussy. \n\nJessy and Lance have be dating for just over a month and things have been hot and heavy from the start. Lance spends nearly every night at Jessy's fucking her and getting fucked. And on the nights he is not with her, they have phone sex. They just can't get enough of each other. However, with every passing shag, Lance feels more and more guilty that he has not been totally honest with Jessy about his job. Lance is in porn and he feels like this is something Jessy should know but he's afraid she will break up with him when she finds out. \n\nGood or bad, he decides, she needs to know. He spills his guts and to his relief and surprise, Jessy finds his job totally hot. So hot, she insists Lance call up his scene partner for the following day and invite her over for a threesome. \n\nNo need to ask Lance twice, he gets Madison on the phone and she in their bed later that night. \nSteamy three way sex with Jessy dominating and fucking her boyfriend and their play thing. Plenty of deep ass pounding, pussy fucking and cumming from an all night sex party that ends in a cum swapping kiss goodnight.\n\nScreens &lt;a href=&quot;\nhttp://www.tsseduction.com/site/shoot.jsp?shootId=34062&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tsseduction.com/site/shoot.jsp?shootId=34062&lt;/a&gt;\n\n12 000 uploads and counting, 13k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n\n\n","torrent":{"xt":"urn:btih:3ffa570c53969807f6b4157d7d710e81e620a72f","amp;dn":"TSSeduction--TS-34062+Madison+Leigh%2C+TS+Jessy+Dubai+and+Lance+Ha","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ffa570c53969807f6b4157d7d710e81e620a72f","infoHashBuffer":{"type":"Buffer","data":[63,250,87,12,83,150,152,7,246,180,21,125,125,113,14,129,230,32,167,47]},"announce":[],"urlList":[]}}