{"title":"Medieval Tastes - Food, Cooking and the Table (2015).epub Gooner","uid":12597429,"size":4140584,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4169dcd791d0095e85821c027554ced37bedd467&amp;dn=Medieval+Tastes+-+Food%2C+Cooking+and+the+Table+%282015%29.epub+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1445281651,"description":"Publisher: Columbia University Press (March 24, 2015)\r\nLanguage: English\r\nISBN-10: 0231167865\r\nISBN-13: 978-0231167864\r\n\r\nIn his new history of food, acclaimed historian Massimo Montanari traces the development of medieval tastes--both culinary and cultural--from raw materials to market and captures their reflections in today's food trends. Tying the ingredients of our diet evolution to the growth of human civilization, he immerses readers in the passionate debates and bold inventions that transformed food from a simple staple to a potent factor in health and a symbol of social and ideological standing.\r\n\r\nMontanari returns to the prestigious Salerno school of medicine, the &quot;mother of all medical schools,&quot; to plot the theory of food that took shape in the twelfth century. He reviews the influence of the Near Eastern spice routes, which introduced new flavors and cooking techniques to European kitchens, and reads Europe's earliest cookbooks, which took cues from old Roman practices that valued artifice and mixed flavors. Dishes were largely low-fat, and meats and fish were seasoned with vinegar, citrus juices, and wine. He highlights other dishes, habits, and battles that mirror contemporary culinary identity, including the refinement of pasta, polenta, bread, and other flour-based foods; the transition to more advanced cooking tools and formal dining implements; the controversy over cooking with oil, lard, or butter; dietary regimens; and the consumption and cultural meaning of water and wine. As people became more cognizant of their physicality, individuality, and place in the cosmos, Montanari shows, they adopted a new attitude toward food, investing as much in its pleasure and possibilities as in its acquisition","torrent":{"xt":"urn:btih:4169dcd791d0095e85821c027554ced37bedd467","amp;dn":"Medieval+Tastes+-+Food%2C+Cooking+and+the+Table+%282015%29.epub+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4169dcd791d0095e85821c027554ced37bedd467","infoHashBuffer":{"type":"Buffer","data":[65,105,220,215,145,208,9,94,133,130,28,2,117,84,206,211,123,237,212,103]},"announce":[],"urlList":[]}}