{"title":"Brenda Lee - The Definitive Collection [2006]","uid":4846779,"size":104921259,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:41954c32b13441e284a2e4d430d21851b098540d&amp;dn=Brenda+Lee+-+The+Definitive+Collection+%5B2006%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Olympia","files":-1,"time":1239715970,"description":"Brenda Lee was a torch singer who could somehow project emotions she was too young to have ever really experienced. She represented music for and by teenagers and eventually gained a sophistication that allowed her to seque into a popular adult performer.\n\nWith 1957's &quot;Dynamite,&quot; pint-sized 12-year-old Brenda Lee earned her nickname Little Miss Dynamite. Her first top-tenner, 1960's &quot;Sweet Nothin's&quot; - with confidential-sounding whispered intro, Boots Randolph's yakkety sax solo, and Lee's vocals shifting from gutsy to kittenish - set the stage for her becoming that decade's top-charting solo female singer.\n\nAs he did with her Decca labelmate Patsy Cline, producer Owen Bradley soon moved her music uptown with the sweet string sections on &quot;I'm Sorry,&quot; Italian-based &quot;I Want to Be Wanted&quot; (her two pop chart toppers) and &quot;Emotions&quot; These recordings helped to establish the Countrypolitan/Nashville Sound.\n\nClear sounding and generous with 28 (mostly) chronologically sequenced 1957-79 tracks, The Definitive Collection pays more attention to Lee's country-flavored pop hits than to her early rockabilly sides. Only &quot;Nobody Wins,&quot; &quot;Big Four Poster Bed&quot; and &quot;Tell Me What It's Like&quot; come from her roster of country hits. It also includes &quot;Dum Dum,&quot; &quot;Fool #1&quot; and nursery-rhyme-inspired &quot;My Whole World Is Falling Down.&quot; From 1964, &quot;Is It True?&quot; features a pre-Led Zeppelin Jimmy Page on electric guitar. We also get &quot;Anybody But Me&quot; and the bouncy &quot;Your Used To Be&quot; which weren't on her more thoroughly annotated 1991 two-volume Anthology (which is still the best domestic Lee set).\n\nBy James E. Bagley &quot;Jim Bagley&quot; (Sanatoga, PA USA), amazon.com","torrent":{"xt":"urn:btih:41954c32b13441e284a2e4d430d21851b098540d","amp;dn":"Brenda+Lee+-+The+Definitive+Collection+%5B2006%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41954c32b13441e284a2e4d430d21851b098540d","infoHashBuffer":{"type":"Buffer","data":[65,149,76,50,177,52,65,226,132,162,228,212,48,210,24,81,176,152,84,13]},"announce":[],"urlList":[]}}