{"title":"Gypsy Sorcery and Fortune Telling","uid":6523322,"size":2464355,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:42477789147300ad6b13a3e936e65a5a60d00950&amp;dn=Gypsy+Sorcery+and+Fortune+Telling&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"_F1_","files":-1,"time":1310071470,"description":"Gypsy Sorcery and Fortune Telling: Illustrated by Incantations, Specimens of Medical Magic, Anecdotes and Tales\n Publisher: Booksales | ISBN-10: 0785804404 | English | edition 1995 | PDF | 204 pages | 2.67 mb\n\n The Gypsies, who call themselves Rom or Romany, are a nomadic culture which originated in India during the Middle Ages. They migrated widely, particularly to Europe, where they worked as farm laborers, metalworkers, scrapdealers, and horsetraders. They also made a living as entertainers, fortune tellers, and grifters. Persecuted by the Nazis, and discriminated against to this day, the Rom have a long tradition of magic and shamanism. As Leland points out, these practices have parallels with those of other traditional pagan cultures around the world.\n\n This book discusses spells, incantations and talismans used within Rom culture, as well as the more practical magic they use in their interaction with the Gorgios--the non-Gypsies. It is this latter topic which provides some of the most interesting and instructional reading. Leland gives some generalized methods of fortune-telling which any prospective psychic would do well to study; as well as the details of the 'Great Secret', a magic trick in which all of your money disappears...\n\n Gypsy life has a romantic appeal, and Leland, who popularized Gypsy lore in this and other books played no small part in this image-making. However, Leland makes it abudantly clear that life on the road was hard. The Rom people are to be admired for their survival skills in a hostile world, and for the longevity and persistance of their culture.--J.B. Hare","torrent":{"xt":"urn:btih:42477789147300ad6b13a3e936e65a5a60d00950","amp;dn":"Gypsy+Sorcery+and+Fortune+Telling","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"42477789147300ad6b13a3e936e65a5a60d00950","infoHashBuffer":{"type":"Buffer","data":[66,71,119,137,20,115,0,173,107,19,163,233,54,230,90,90,96,208,9,80]},"announce":[],"urlList":[]}}