{"title":"An Understandable History of the Bible - Dr. Samual C. Gipp","uid":11773625,"size":886167,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:43ee9438da7e384792217ff203df2a71fb7c3f0f&amp;dn=An+Understandable+History+of+the+Bible+-+Dr.+Samual+C.+Gipp&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"starxteel","files":1,"time":1427178804,"description":"\nThe history of the Bible... in plain language. This is a much needed source that explains how we got our Bible in an easily understood text, and is an excellent book for all Christians, from new converts to veteran pastors.\n\nUsed by Christians around the world, it has been a valuable source for those who want to learn more about where the King James Bible came from. This book has been translated into several languages and has been useful as a Bible college textbook both in the United States and abroad.Many pastors use it for Sunday School preparation and sermons.\n\nReaders will find such valuable information including names of all the King James Translators, the 15 rules for translating used by the King James translators and the review process they used.\nAdditionally, this book is an excellent resource for those Bible students interested in learning about the factual problems with the New King James Versions and the New Schofield Version. Plus, an entire new chapter on the Greek Texts is included. &quot;Gipp?s Understandable History of the Bible&quot; is an excellent resource for Bible students, pastors and Christians who have a desire to learn more about the history of the King James Bible.\n\nProponents of new Bible versions specialize in creating confusion, including the arguments about the &quot;oldest&quot; manuscripts, &quot;best&quot; manuscripts, or &quot;majority&quot; manuscripts. You will learn the story behind the Bible, taking you from the earliest copies through the history of translations.\n\n\nAbout the author:\nDr. Gipp is a former pastor, an evangelist, teacher, author and Bible conference speaker. He has the unique ability to digest large amounts of information and then present it in an analytical, understandable, format. His humerous, informative and forceful preaching style make him popular with all ages and keeps him in demand as a Revivalist and Bible conference speaker","torrent":{"xt":"urn:btih:43ee9438da7e384792217ff203df2a71fb7c3f0f","amp;dn":"An+Understandable+History+of+the+Bible+-+Dr.+Samual+C.+Gipp","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"43ee9438da7e384792217ff203df2a71fb7c3f0f","infoHashBuffer":{"type":"Buffer","data":[67,238,148,56,218,126,56,71,146,33,127,242,3,223,42,113,251,124,63,15]},"announce":[],"urlList":[]}}