{"title":"Diffusion and Mass Transfer","uid":14429366,"size":18280256,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:449ae7d8cd451e20a088756c84e08a5d32f60668&amp;dn=Diffusion+and+Mass+Transfer&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1461598787,"description":"Diffusion and Mass Transfer - James S. Vrentas, ‎Christine M. Vrentas (CRC, 2013).pdf\r\n\r\nISBN 978-1-4665-1569-7\r\n\r\nA proper understanding of diffusion and mass transfer theory is critical for obtaining correct solutions to many transport problems. Diffusion and Mass Transfer presents a comprehensive summary of the theoretical aspects of diffusion and mass transfer and applies that theory to obtain detailed solutions for a large number of important problems. Particular attention is paid to various aspects of polymer behavior, including polymer diffusion, sorption in polymers, and volumetric behavior of polymer–solvent systems.\r\n\r\nThe book first covers the five elements necessary to formulate and solve mass transfer problems, that is, conservation laws and field equations, boundary conditions, constitutive equations, parameters in constitutive equations, and mathematical methods that can be used to solve the partial differential equations commonly encountered in mass transfer problems. Jump balances, Green’s function solution methods, and the free-volume theory for the prediction of self-diffusion coefficients for polymer–solvent systems are among the topics covered. The authors then use those elements to analyze a wide variety of mass transfer problems, including bubble dissolution, polymer sorption and desorption, dispersion, impurity migration in plastic containers, and utilization of polymers in drug delivery. The text offers detailed solutions, along with some theoretical aspects, for numerous processes including viscoelastic diffusion, moving boundary problems, diffusion and reaction, membrane transport, wave behavior, sedimentation, drying of polymer films, and chromatography.\r\n\r\nPresenting diffusion and mass transfer from both engineering and fundamental science perspectives, this book can be used as a text for a graduate-level course as well as a reference text for research in diffusion and mass transfer. The book includes mass transfer effects in polymers, which are very important in many industrial processes. The attention given to the proper setup of numerous problems along with the explanations and use of mathematical solution methods will help readers in properly analyzing mass transfer problems","torrent":{"xt":"urn:btih:449ae7d8cd451e20a088756c84e08a5d32f60668","amp;dn":"Diffusion+and+Mass+Transfer","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"449ae7d8cd451e20a088756c84e08a5d32f60668","infoHashBuffer":{"type":"Buffer","data":[68,154,231,216,205,69,30,32,160,136,117,108,132,224,138,93,50,246,6,104]},"announce":[],"urlList":[]}}