{"title":"Dragon.Age.Inquisition.Deluxe.Edition-[MULTI-9]-CPY","uid":12594103,"size":48826056562,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:44b511a1f85d54d834cf8ce1a7d8dabba01c78f6&amp;dn=Dragon.Age.Inquisition.Deluxe.Edition-%5BMULTI-9%5D-CPY&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"atik0786","files":2,"time":1445202368,"description":"\n\r\nABOUT THE GAME\r\n\r\nYour New Adventure Begins.\r\n\r\nWhen the sky opens up and rains down chaos, the world needs heroes. Become the savior of Thedas in Dragon Age: Inquisition. You are the Inquisitor, tasked with saving the world from itself. But the road ahead is paved with difficult decisions. Thedas is a land of strife. Factions constantly war with each other even as a larger demonic invasion has begun. And you? You and your band of champions are the only ones who can hold it together. It’s your job to lead them… or fall.\r\n\r\nEnthralling, Choice-driven Narrative – You’re not just deciding who to send into which battle in Inquisition, you’re making important decisions that shape the future of Thedas. Each choice carries weight, and your actions can lead to a variety of outcomes. Inquisition is a highly personalized journey, where one wrong move could set in motion a series of events that alter the physical aspects of the world itself, making your Thedas – and your heroes – feel truly unique.\r\n\r\nA Massive World to Discover – The world of Thedas has never been bigger or more detailed; it’s wide open, and ripe for exploration. Discover enemy keeps ripe for the taking. Unearth hidden caves filled with lurking creatures. Thedas is vast and dangerous, but uncovering its secrets can spell the difference between victory and defeat.\r\n\r\nIntense, Strategic Combat – There’s no wrong way to play Dragon Age: Inquisition… except for the way that gets you killed. Fortunately, the optional strategic view gives you a god’s-eye vantage on battle. Time stops while you plan in this view, but if that’s not your style, you can just barrel ahead, crossbows blazing.\r\n\r\nLanguages: Deutsch (DE), English (US), Español (ES), Français (FR), Italiano\r\n\r\n\r\n\r\n\r\nMinimum:\r\n\r\nOS: Windows 7 or 8.1, 64-bit\r\nProcessor (AMD): Quad core @ 2.5 GHz\r\nProcessor (Intel): Quad core @ 2.0 GHz\r\nMemory: 4 GB\r\nGraphics Card (AMD): Radeon HD 4870\r\nGraphics Card (NVIDIA): GeForce 8800 GT\r\nGraphics Memory: 512 MB\r\nHard Drive: 26 GB\r\nDirectX: 10\r\nInternet: 512 kbps up and down\r\n\r\nRecommended:\r\n\r\nOS: Windows 7 or 8.1, 64-bit\r\nProcessor (AMD): Six core @ 3.2 GHz\r\nProcessor (Intel): Quad core @ 3.0 GHz\r\nMemory: 8 GB\r\nGraphics Card (AMD): Radeon HD 7870 or R9 270\r\nGraphics Card (NVIDIA): GeForce GTX 660\r\nGraphics Memory: 2 GB\r\nHard Drive: 26 GB\r\nDirectX: 11\r\nInternet: 1 Mbps up and down\r\n\r\n* Xbox 360 controller supported\r\n* 100% DirectX 9.0c compatible sound card\r\n* Online Authentication at time of installation\r\n\r\nInstructions:\r\n\r\n-Burn or mount the image\r\n-Install the game\r\n-Copy the crack\r\n-Enjoy\r\n\r\nNote:\r\n\r\nThe game is updated to the latest patch and it contains all DLCs, OST included.\r\n\r\nEstablished in 1999, we are possibly the oldest Italian-based\r\nrelease group still in activity.  We express a big THANK YOU to\r\nall those friends who helped us in various forms throughout thes\r\nyears!  Don't forget to support the companies and to keep the\r\nScene about FUN.\r\n\r\nFondato nel 1999, CPY e' probabilmente il piu' vecchio gruppo\r\nrelease in Italia ancora in attivita'.  Ringraziamo DI CUORE tutti\r\ngli amici che ci hanno aiutati in ogni maniera in questi anni!\r\nRicordate di supportare le compagnie cinematografiche e di\r\nsoftware, e che la Scena dev'essere basata sul DIVERTIMENTO","torrent":{"xt":"urn:btih:44b511a1f85d54d834cf8ce1a7d8dabba01c78f6","amp;dn":"Dragon.Age.Inquisition.Deluxe.Edition-%5BMULTI-9%5D-CPY","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"44b511a1f85d54d834cf8ce1a7d8dabba01c78f6","infoHashBuffer":{"type":"Buffer","data":[68,181,17,161,248,93,84,216,52,207,140,225,167,216,218,187,160,28,120,246]},"announce":[],"urlList":[]}}