{"title":"Storm-Swipe Series 3 (3391)","uid":8840381,"size":3999871,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4583ce5b0a811fdb8d686e22fffda93792f68c32&amp;dn=Storm-Swipe+Series+3+%283391%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"420weedman","files":4,"time":1377227111,"description":"In a future United States under the power of a charismatic leader, everyone gets the Mark at age thirteen. The Mark allows citizen to shop, go to school, and even get medical care--without it, you are on your own. Few refuse to get the Mark. Those who do . . . disappear.\n\nLogan Langly went in to get his Mark, but he backed out at the last minute. Ever since, he's been on the run from government agents and on a quest to find his sister Lily, who disappeared when she went to get her Mark five years earlier. His journey leads him to befriend the Dust, a vast network of Markless individuals who dissent against the iron-grip rule of the government. Along the way to the capital to find Lily, the Dust receive some startling information from the Markless community, opening their eyes to the message of Christianity and warning that humanity is now entering the End of Days.\n\nIn &quot;Storm,&quot; Logan and his friends are the leaders of the Markless revolution. But while some Markless are fighting Chancellor Cylis' army, the Dust is busy trying to find a cure for a horrible epidemic sweeping through the Marked. And it's difficult for them to know who to trust, especially when they aren't sure if Logan's sister Lily, one of the commanders in Cylis' army, is on their side or not. And all across the nation--and the world--the weather is become less stable, and a storm is brewing that bigger than any of them could have ever imagined..","torrent":{"xt":"urn:btih:4583ce5b0a811fdb8d686e22fffda93792f68c32","amp;dn":"Storm-Swipe+Series+3+%283391%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4583ce5b0a811fdb8d686e22fffda93792f68c32","infoHashBuffer":{"type":"Buffer","data":[69,131,206,91,10,129,31,219,141,104,110,34,255,253,169,55,146,246,140,50]},"announce":[],"urlList":[]}}