{"title":"James Son Thomas - 1981 - Mississippi Delta Blues Man FLAC","uid":8553398,"size":265621252,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4593a00728ca5b193eaa38c4164fe77e8d0ada36&amp;dn=James+Son+Thomas+-+1981+-+Mississippi+Delta+Blues+Man+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"eika256","files":-1,"time":1370704570,"description":"James Son Thomas - 1981 - Mississippi Delta Blues Man\n\nNo one could ever say that James &quot;Son&quot; Thomas didn't have the right to sing the blues. A Mississippi share cropper and grave digger (and later, a furniture store laborer), Thomas lived a hard life that included being shot by his ex-wife, being severely burned by a space heater, surgery for a brain tumor, long battles with emphysema and epilepsy, and the final series of strokes and heart attacks that finally took his life. Along the way he developed into a skilled folk sculptor and a captivating guitarist and singer. He was officially &quot;discovered&quot; in 1967 by folk researcher William Ferris, who featured Thomas as the centerpiece of his book Blues From the Delta as well as several short films, opening the way for Thomas' entry on to the international folk and blues circuit, which led to this album, which was recorded in May 1981 in the Netherlands by Leo Bruin. It features Thomas alone with an acoustic guitar holding forth on fairly traditional Delta blues material in a generally high, near falsetto voice (he drops down in tone for a couple of songs, like &quot;Hard Time Blues&quot;). The hushed intimacy of the setting gives several of these tracks tremendous power, and although Thomas isn't particularly unique or innovative on anything here, his calm sincerity and easy style are immensely affecting. He sounds at times a little like Skip James, particularly on the eerie &quot;Devil Blues,&quot; which was probably derived, in part, from James' &quot;Devil Got My Woman.&quot; As an intimate glimpse at one of the last true folk-blues musicians from the Delta, this is a valuable historical recording, but also an enjoyable one. (AllMusic)\n\nTrack list:\n01 - Big Leg Woman\n02 - High Brown\n03 - Whiskey Headed Woman\n04 - Devil Blues\n05 - Take A Little Walk\n06 - Cool Water Blues\n07 - Lonesome Road Blues\n08 - Black Rat\n09 - Hard Time Blues\n10 - Catfish Blues\n11 - My Black Mare\n12 - Bull Cow Blues\n\nEnjoy and share! ","torrent":{"xt":"urn:btih:4593a00728ca5b193eaa38c4164fe77e8d0ada36","amp;dn":"James+Son+Thomas+-+1981+-+Mississippi+Delta+Blues+Man+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4593a00728ca5b193eaa38c4164fe77e8d0ada36","infoHashBuffer":{"type":"Buffer","data":[69,147,160,7,40,202,91,25,62,170,56,196,22,79,231,126,141,10,218,54]},"announce":[],"urlList":[]}}