{"title":"ImTOO Audio Converter Pro 6.2.0 build 0331 Portable [ak]","uid":6412213,"size":31003661,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:45ca8de77a99764d416bef42c793bda5b95cc081&amp;dn=ImTOO+Audio+Converter+Pro+6.2.0+build+0331+Portable+%5Bak%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anacondaz","files":-1,"time":1306035324,"description":"ImTOO Audio Converter Pro 6.2.0 build 0331 Portable\n\nAssembling the functionalities of audio file conversion, audio extraction, CD ripping and CD burning in one tool, ImTOO Audio Converter Pro provides the most comprehensive solutions for music fans to transform between different audio formats, extract audio from popular HD and general video formats, rip CDs to music files and burn music CD from audio/video files.\n\nAllowing you to add and adjust audio effects (fade-in, fade-out, volume normalize, bandpass, chorus, flanger, echo, speed), this professional audio file converter software helps you get music files with the special effects to your taste.\n\nAdditionally, you can output different-format files from a single track at once, clip audio segments, split tracks, and make adjustments to the output parameters. Come to experience the high-speed and great-quality audio conversion, CD ripping and CD burning with ImTOO Audio Converter Pro now.\n\nAll-in-one audio file converter software for audio conversion, audio extraction, CD ripping and CD burning\nConvert audio formats (incl. MP3, WMA, WAV, AAC, FLAC, OGG, APE, etc.) from one to another\nExtract audio from general and high-definition video files such as AVI, MPEG, WMV, MP4, FLV, MKV, H.264/MPEG-4 AVC, AVCHD\nRip CDs to music files of different formats\nBurn CD from popular audio and video format files\n\nKey Features\n- Set effects (incl. fade-in, fade-out, volume normalize, band pass, chorus, flanger, echo and speed) for the outputted audio files.\n- Convert/rip and transfer CDs/videos/audio to your iPod, iPhone and PSP in one step.\n- Output various format files from a single video/audio file or CD track at one time.\n- Extract audio segments by clipping.\n- Split your audio tracks in accordance with the split size or duration you preset before converting, ripping or burning.\n- Change the audio profile parameters for output customization; edit ID3 tag info of your audio tracks.\n- Supports multiple CPU cores, multi-threading and batch process to speed up and simplify the conversion, ripping and burning.\n- Options to auto exit application, shut down, hibernate, stand by system, or do nothing after conversion, ripping, or burning to avoid waiting in front your computer.\n- Comes with English, German, Spanish, French, Japanese, Chinese interface languages.\n\nHome Page - http://www.imtoo.com/\n","torrent":{"xt":"urn:btih:45ca8de77a99764d416bef42c793bda5b95cc081","amp;dn":"ImTOO+Audio+Converter+Pro+6.2.0+build+0331+Portable+%5Bak%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"45ca8de77a99764d416bef42c793bda5b95cc081","infoHashBuffer":{"type":"Buffer","data":[69,202,141,231,122,153,118,77,65,107,239,66,199,147,189,165,185,92,192,129]},"announce":[],"urlList":[]}}