{"title":"Final_Fantasy_VII_Crisis_Core_USA_PSP-EMiNENT","uid":4089532,"size":1060657758,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:462abd23be08f3dcad4c6f2d62ed9e6d8f3a62a7&amp;dn=Final_Fantasy_VII_Crisis_Core_USA_PSP-EMiNENT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Raztak","files":56,"time":1206000097,"description":"FOR ALL OF YOU WHO HAVE WAITED FOR THIS, HERE IS THE US RELEASE, ENJOY!\n\nTitle: \tFinal Fantasy VII: Crisis Core\nDate: 03/19/08\nSystem: PSP\nRegion: NTSC/U\nFilename: em-ff7cc.*\nWeb: http://www.ebgames.com/product.asp?product_id=b191285a\n#Disks: *\n\n\nCRISIS CORE, the highly anticipated entry in the COMPILATION of FINAL FANTASY VII, takes fans \non an exciting journey through the origin of the internationally acclaimed FINAL FANTASY VII \nsaga in an all-new action-packed experience. Developed exclusively for the PSP system, CRISIS \nCORE -FINAL FANTASY VII- marks the return of the celebrated characters and game world that \nmesmerized more than 9.8 million gamers around the globe. With inspiring visuals, full 16:9 \nwidescreen presentation and an engaging battle system, fans and newcomers alike can experience \nthe world of FINAL FANTASY VII from an all-new perspective. \n\n\nSeven years prior to the events of FINAL FANTASY VII The Shinra Company is rapidly \nincreasing its influence through its monopoly on mako energy and military might. \nWith the burgeoning city of Midgar as its base and symbol of prosperity, Shinra is \non the verge of establishing absolute dominance over the world. SOLDIER is a group \nof skilled combat operatives within Shinra.\n\nThe elite within the group ? those strong enough to be deemed SOLDIER 1st Class \nare respected and idolized by the citizenry. Zack is a young SOLDIER 2nd Class who \naspires to become a 1st. He spends his days carrying out assignments under the guidance \nof his 1st Class mentor, Angeal. During an operation in Wutai, a large number of SOLDIER \nmembers, led by 1st Class operative Genesis, go missing. The severity of the situation \nprompts Shinra executives to deploy even more SOLDIER operatives in hopes of bringing an \nend to the war with Wutai?and conducting an investigation into the mass desertion.\n\nThe ones assigned to the mission are Zack, Angeal, and the 1st Class hero who is known \nthe world over as Sephiroth... What truths lie behind Genesis&amp;#039;s disappearance? What \nsecrets bind the three SOLDIER 1st Class operatives? For Zack, a cruel and fateful \nstruggle awaits...","torrent":{"xt":"urn:btih:462abd23be08f3dcad4c6f2d62ed9e6d8f3a62a7","amp;dn":"Final_Fantasy_VII_Crisis_Core_USA_PSP-EMiNENT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"462abd23be08f3dcad4c6f2d62ed9e6d8f3a62a7","infoHashBuffer":{"type":"Buffer","data":[70,42,189,35,190,8,243,220,173,76,111,45,98,237,158,109,143,58,98,167]},"announce":[],"urlList":[]}}