{"title":"Wendy O. Williams - WOW - 1984","uid":3375800,"size":35047026,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:469f4631f2ef2c7c23a884edc82e4ab6be0b0fb4&amp;dn=Wendy+O.+Williams+-+WOW+-+1984&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Alocacoc","files":9,"time":1125190584,"description":"Wendy O. Williams - WOW\n\nTRACK LISTING\n1. I Love Sex (And Rock n'' Roll)\n2. It's My Life\n3. Priestess\n4. Thief In The Night\n5. Opus In Cm7\n6. Ready To Rock\n7. Bump And Grind\n8. Legends Never Die\n9. Ain't None Of Your Business\n\nThe former frontwoman of the notorious New York Punk Metal band THE PLASMATICS opted to pursue a solo career in the mid 80s and teamed up with KISS bassist GENE SIMMONS for the recording of her debut solo album, released by Music For Nations in 1984. Simmons' influence on the project was undeniable and providing Wendy with his songwriting talents on no less than five songs: - 'I Love Sex (And Rock &amp; Roll)', 'It's My Life' (co-written with KISS' Paul Stanley], 'Thief In The Night' (co-penned with BEATLEMANIA / Z-TOYZ bassist Mitch Weissman), 'Legends Never Die' (a song Gene collaborated with ex SMOKEHOUSE and EMPIRE guitarist MICKI FREE on, who would join CROWN OF THORNS a decade later) and 'Ain't None Of Your Business' (featuring credits from then KISS members Eric Carr and Vinnie Vincent).\nThe KISS connections failed to end with the songwriting as PAUL STANLEY guests on 'Ready To Rock', Eric Carr played drums on 'Legends Will Never Die' (with Micki Free supplying acoustic guitar for good measure) and erstwhile KISS axeman ACE FREHLEY supplied lead guitar to 'Bump And Grind'. Whilst guitars were, in the main, supplied by ex-PLASMATICS guitarist Wes Beech and Michael Ray, bass came courtesy of one Reginald Van Helsing, none other than Simmons himself.\nThe band assembled for 'Kommander Of Kaos' comprised Michael Ray, ALICE COOPER bassist Greg Smith and ex-PLASMATICS drummer T.C. Tolliver. The live version of 'Ain't None Of Your Business' features Wes Beech. After recording a conceptual album, 'Maggots The Record', under the PLASMATICS handle, Wendy assembled ULTRAFLY AND THE HOMETOWN GIRLS - a Rap Metal band - and released an album titled 'Deffest And Baddest' in early 1988.\n\nSadly, having been away from the music business for a number of years, Wendy killed herself with a gun at her home in Connecticut on April 5, 1998. She was 48.\nDrummer T.C. Tolliver returned in 2005 as part of the band HAT TRICK OF MISERY. German Heavy Metal band POWERGOD cut a cover version of 'Ready To Rock' for inclusion on their 'Long Live The Loud ? That's Metal Lesson II' released through Massacre Records in July 2005.\n","torrent":{"xt":"urn:btih:469f4631f2ef2c7c23a884edc82e4ab6be0b0fb4","amp;dn":"Wendy+O.+Williams+-+WOW+-+1984","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"469f4631f2ef2c7c23a884edc82e4ab6be0b0fb4","infoHashBuffer":{"type":"Buffer","data":[70,159,70,49,242,239,44,124,35,168,132,237,200,46,74,182,190,11,15,180]},"announce":[],"urlList":[]}}