{"title":"State-Sponsored Terrorism, Crimes, Lies - Collection26 (Israel6)","uid":12631221,"size":229582885,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:474715ce65a5edc6fb75e23d86a45b0a0bf0a617&amp;dn=State-Sponsored+Terrorism%2C+Crimes%2C+Lies+-+Collection26+%28Israel6%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"moman73","files":35,"time":1445846223,"description":"State-Sponsored Terrorism, Crimes, and Lies - Collection 26 (Israel 6):\r\n\r\nWe have 35 titles here:\r\n\r\n-  Abu El-Haj - Facts on the Ground; Archaeological Practice and Territorial Self-Fashioning in Israeli Society (2001)\r\n\r\n-  Amnesty Int. - Nothing Is Immune; Israel's Destruction of Landmark Buildings in Gaza (2014)\r\n\r\n-  Bayoumi (Ed.) - Midnight on the Navi Marmara; the Attack on the Gaza Freedom Flotilla .. (2010)\r\n\r\n-  Blumenthal - The 51 Day War; Ruin and Resistance in Gaza (2015)\r\n\r\n-  Bregman - Cursed Victory; a History of Israel and the Occupied Territories (2014)\r\n\r\n-  Brenner (Ed.) - 51 Documents; Zionist Collaboration with the Nazis (2002)\r\n\r\n-  Cromer - A War of Words; Political Violence and Public Debate in Israel (2004)\r\n\r\n-  Darwish - Unfortunately, It Was Paradise; Selected Poems (2003)\r\n\r\n-  Falk - Israel's 50 Day Attack on Gaza, POMEAS (Nov. 2014)\r\n\r\n-  Finkelstein - Method and Madness; the Hidden Story of Israel's Assaults on Gaza (2014)\r\n\r\n-  Gazit - Trapped Fools; Thirty Years of Israeli Policy in the Territories (2003)\r\n\r\n-  Hallward - Struggling for a Just Peace; Israeli and Palestinian Activism in the Second Intifada (2011)\r\n\r\n-  HRW - Ripe for Abuse; Palestinian Child Labor in Israeli Agricultural Settlements in the West Bank (2015)\r\n\r\n-  Jenkins - Pictures of Palestine; a Humanitarian Blogging from Bethlehem (2012)\r\n\r\n-  Karsh - Palestine Betrayed (2010)\r\n\r\n-  Karsh (Ed.) - From Rabin to Netanyahu; Israel's Troubled Agenda (1997)\r\n\r\n-  Katibah (Ed.) - The Case Against Zionism (1921)\r\n\r\n-  Kolsky - Jews Against Zionism; the American Council for Judaism, 1942-1948 (1990)\r\n\r\n-  Lentin (Ed.) - Thinking Palestine (2008)\r\n\r\n-  Levy - The Punishment of Gaza (2010)\r\n\r\n-  Malek &amp; Hoke (Eds.) - Palestine Speaks; Narrative of Life Under Occupation (2014)\r\n\r\n-  Murphy - Between River and Sea; Encounters in Israel and Palestine (2015)\r\n\r\n-  Nakhleh - Encyclopedia of the Palestine Problem, Vol. I (1991)\r\n\r\n-  Olberg - Political Graffiti on the West Bank Wall in Israel-Palestine (2013)\r\n\r\n-  O'Malley - The Two-State Delusion; Israel and Palestine - a Tale of Two Narratives (2015)\r\n\r\n-  Piggott - An Ideal Betrayed; Australia, Britain and the Palestine Question, 1947-1949, a PhD Thesis, Univ. of Sydney (2002)\r\n\r\n-  Ranta - Political Decision Making and Non-Decisions; the Case of Israel and the Occupied Territories (2015)\r\n\r\n-  Rosengarten - Survival and Conscience; From the Shadows of Nazi Germany to the Jewish Boat to Gaza (2015)\r\n\r\n-  Rothchild - Broken Promises, Broken Dreams; Stories of Jewish and Palestinian Trauma and Resilience (2007)\r\n\r\n-  Sa'di &amp; Abu-Lughod (Eds.) - Nakba; Palestine, 1948, and the Claims of Memory (2007)\r\n\r\n-  Sager - Travels with Bassem; a Palestinian and a Jew Find Friendship in a War-Torn Land (2015)\r\n\r\n-  Sand - How I Stopped Being a Jew (2014)\r\n\r\n-  Sand - The Invention of the Land of Israel; from Holy Land to Homeland (2012)\r\n\r\n-  Shipler - Arab and Jew; Wounded Spirits in a Promised Land (2002)\r\n\r\n-  Sternhell - The Founding Myths of Israel; Nationalism, Socialism, and the Making of the Jewish State (1998)","torrent":{"xt":"urn:btih:474715ce65a5edc6fb75e23d86a45b0a0bf0a617","amp;dn":"State-Sponsored+Terrorism%2C+Crimes%2C+Lies+-+Collection26+%28Israel6%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"474715ce65a5edc6fb75e23d86a45b0a0bf0a617","infoHashBuffer":{"type":"Buffer","data":[71,71,21,206,101,165,237,198,251,117,226,61,134,164,91,10,11,240,166,23]},"announce":[],"urlList":[]}}