{"title":"Engine Down - Discography (1998-2004) [FLAC]","uid":9386430,"size":1173911658,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:47e2912a781952f1177e3da4b4705d40e1380b1a&amp;dn=Engine+Down+-+Discography+%281998-2004%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1387811137,"description":"\n  Engine Down - Discography (1998-2004) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Indie, Alternative, Emo\n  Source: CD\n  Codec: FLAC\n  Bit Rate: ~ 1,000 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  1998 Under the Pretense of Present Tense\n  2000 To Bury Within the Sound\n  2002 Demure \n  2004 Engine Down\n\n  &quot;Groove-oriented emprise brushed with shades of Drive Like Jehu and grounded in a rocking emo sensibility&quot; begins to characterize Engine Down's musical demeanor. The quartet met in Harrisonburg, VA, before embarking on an eastward migration to the Virginia capital of Richmond. Comprised of former members of Sleepytime Trio, the Weak Link Breaks, and Bughummer, Engine Down debuted at the showing of a murder mystery flick. They first released a self-titled 7&quot; through Lovitt in 1998; their full-length Under the Pretense of Present Tense following later that year. After that, the band -- comprised of Jonathan Fuller (guitar/vocals), Jason Wood (bass/vocals), Keeley Davis (vocals/guitar) and Cornbread Compton (drums) -- put out 2000's To Bury Within the Sound and 2001's A Sign of Breath EP, touring with such acts as 400 Years, Speedwell, and Three Penny Opera. Also in 2001 came their third album, the moodier Demure.\n\n  By way of their recordings and live performances, Engine Down nurtured a bevy of adoring fans that helped them chart in CMJ's Top 20 for eight weeks. Engine Down were keen for rhythms in 6/8 time, not hesitating to augment their bass, drum, guitar, and vocal setup with such instruments as cello, vibraphone, and piano. Even without the addition of these acoustic instruments, Engine Down's core sound -- propulsive triplet-ridden beats, weighty basslines, pugnacious guitar salvos, and languorous vocals -- made the band worth seeking out. By 2004, the group had jumped from Lovitt to Lookout Records to release its fourth disk, Enginedown. Engine Down toured Europe in early 2005 before announcing that they would be breaking up (amicably) later that year. Following a fall U.S. farewell tour supported by Bella Lea and Des Ark, the bandmembers went their separate ways.","torrent":{"xt":"urn:btih:47e2912a781952f1177e3da4b4705d40e1380b1a","amp;dn":"Engine+Down+-+Discography+%281998-2004%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47e2912a781952f1177e3da4b4705d40e1380b1a","infoHashBuffer":{"type":"Buffer","data":[71,226,145,42,120,25,82,241,23,126,61,164,180,112,93,64,225,56,11,26]},"announce":[],"urlList":[]}}