{"title":"VP (Desperados MC #3) - Sienna Valentine [EPUB]","uid":9783229,"size":139058,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:48480d7ecb2b19b7c55396e1f6cf276cfe8581fc&amp;dn=VP+%28Desperados+MC+%233%29+-+Sienna+Valentine+%5BEPUB%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"AtomTPB","files":1,"time":1395125297,"description":"Print Length: 70 pages\nLanguage: English\nASIN: B00IZ3M3XG\nFormat: EPUB\n\n\nThe highly anticipated and exciting climax to the best selling Desperados MC trilogy!\n\nWhile this novella can stand alone, it is best enjoyed after reading part 1 and 2 of the Desperados MC trilogy. \n\nMadison finally has what she'd always been craving - a relationship with a rough and handsome biker that has pulled her out of her stagnant home life with her parents and thrust her into one filled with excitement, danger, and a lot of sex. But things are about to turn very dangerous, and very deadly, as Dax tries to flex his new found powers as VP of the Desperados into pushing the club in a direction that not everyone wants to go. And some of them will do just about anything to stop him. \n\nWARNING: \nThis rough and wild motorcycle novella involves explicit sex, including FF, FFF and MFMF action that center around the budding romance between a rough biker and an innocent young woman who is crazy enough to get mixed up with him. It is intended for adults only. \n\nExcerpt: \nAs the strange men approached her, she noticed both of their eyes land firmly on her chest and they made no attempt to hide it. &quot;This one has some big cans, no? Where do you find these girls, Dax?&quot; \n\n&quot;She's not a stripper,&quot; Dax said, shooting another glare at Madison from behind the men. \n\nThe two men stopped and looked up at her face now, their smiles fading slightly. &quot;No? I thought this was a private party, Dax?&quot; He half turned, raising an eyebrow at the biker. &quot;You ask me here to discuss our arrangements over a little entertainment and promise me privacy, yet you now have strangers coming in?&quot; \n\nGuts was standing beside Dax, not saying a word, but Madison noted the ever so slight smile on his face as he watched the other man admonish the VP. She had no idea who this guy was, but it seemed like this meeting was important to Dax and she was about to screw it up - and Guts seemed to be happy to see that happen. Without thinking, she attempted to salvage things. \n\n&quot;I'm no stranger,&quot; she said. The man stopped talking and turned back to look at her. &quot;Dax just meant I'm not one of the regular girls. He called me in by special request.&quot; \n\n&quot;Oh really,&quot; the man said, interested again. His eyes dropped back down from her face to her breasts once more. &quot;I think I know what it is about you that makes you so special,&quot; he said. \n\n&quot;I think there are two things,&quot; his friend added. His eyes were also now fixated on her tits again.","torrent":{"xt":"urn:btih:48480d7ecb2b19b7c55396e1f6cf276cfe8581fc","amp;dn":"VP+%28Desperados+MC+%233%29+-+Sienna+Valentine+%5BEPUB%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48480d7ecb2b19b7c55396e1f6cf276cfe8581fc","infoHashBuffer":{"type":"Buffer","data":[72,72,13,126,203,43,25,183,197,83,150,225,246,207,39,108,254,133,129,252]},"announce":[],"urlList":[]}}