{"title":"Virtual Unknown - Microbiology","uid":11626937,"size":29381239,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:49668a4dc4c86335a2b40464e257d061c25baeb1&amp;dn=Virtual+Unknown+-+Microbiology&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1417634794,"description":"Software: Virtual Unknown - Microbiology v.3.11 [Standalone] w/ Crack\nDeveloper: Intuitive Systems, Inc (http://www.intuitiveinc.com/products.html)\nRequirements: Windows 98 or newer (Works in 7, not tested with Windows 8)\n\n\nThis software simulates a bacteriology lab environment where bacteria are identified by use of biochemical tests.  There are about 60 biochemical tests available, with 70 gram-negative enteric bacteria and 50 gram-positive cocci bacteria that will appear.  Each case starts with an unknown sample and a case history of where the sample came from and patient symptoms.  There are incubators and an 'advance day' button so you can see the results of multi-day tests.\n\nAfter an identification is made, the software tells you whether you were correct, and if not where you misread a test result.  It also watches for things like improper technique (leading to possible contamination) and whether you left a bunsen burner on in the lab overnight.\n\n\nIncluded:\n\nAlso included is a tutorial on how to use the program, a 'Basic Training Manual' to walk you through a case, and a Report Viewer so you can read the results of old cases that you have completed.\n\n\nInstalling:\n\nThis is version 3.11 of the software and does not require an internet connection to run.  Install the game as normal from the Install folder, then cancel when asked to register.  The registration server is down and the software cannot be registered normally.  Copy the cracked EXE on top of Microbiology.exe in the program filesvirtualUnknownMicrobiology Student Lab 3.11 folder.\n\n\nIf you don't know anything about microbiology and want to play this as a game:\n\nBacteria respond differently when subjected to different chemicals.  For example, cyanide kills humans and most bacteria, but a few types of bacteria can actually eat it.  When you want to identify an unknown bacteria, you find a chemical that half (ideally) your bacteria will react differently to from the rest.  Depending on the result, you eliminate bacteria that don't match and repeat this process until only one bacteria is left.\n\nThe game has a built-in identification matrix that shows you all the remaining bacteria types and how they would react to any tests you have not yet used.  Since most tests take at least a day to run, you usually set up and run multiple tests simultaneously.  Your goal is to identify the bacteria in as few days as possible while also using as few tests as possible.\n\n\nThe very first test in each case will be the Gram Stain.  If the bacteria look purple, that is Positive.  If they look red/pinkish, that is Negative.  If they are round balls, that's Cocci.  If they are rectangular or elongated, that's Rods.  You enter the first result (eg. 'Gram Positive Cocci') and that narrows down the possible bacteria to one manageable group.  All other tests are in the Help guide with directions for how to do the test and read it.  The tests are all real tests and you can Google them if the help isn't clear enough","torrent":{"xt":"urn:btih:49668a4dc4c86335a2b40464e257d061c25baeb1","amp;dn":"Virtual+Unknown+-+Microbiology","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"49668a4dc4c86335a2b40464e257d061c25baeb1","infoHashBuffer":{"type":"Buffer","data":[73,102,138,77,196,200,99,53,162,180,4,100,226,87,208,97,194,91,174,177]},"announce":[],"urlList":[]}}