{"title":"Lady Blue Shanghai (dir. David Lynch, short film for Dior, 2010)","uid":9629368,"size":47315505,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:498d75619f79839a6e2da34abe980c4412259e64&amp;dn=Lady+Blue+Shanghai+%28dir.+David+Lynch%2C+short+film+for+Dior%2C+2010%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"glngwl","files":1,"time":1392649798,"description":"Lady Blue Shanghai (dir. David Lynch, short film for Dior, 2010)\n\n\n16-minute internet promotion motion picture for Dior, written, directed and edited by David Lynch; with music by David Lynch, Dean Hurley, and Nathaniel Shilkret; and starring Marion Cotillard, Gong Tao, Emily Stofle, Cheng Hong, Lu Yong and Nie Fei.\n\nThe film was released on Dior's website in May 2010, and was no longer viewable there by October 2010.\n\n\nPlot:\n\nCotillard, whose character is not given a name in the film, enters her Shanghai hotel room at night. As she nears her room she hears a 1920s tango, which, as she opens her hotel room door, she sees is coming from an old 78 rpm record. She stops the music, and a Dior bag appears in the room in a puff of smoke. In a panic, she calls the front desk to say that someone is in her room. Two security guards search her room and find nobody. She is questioned about the bag and asked if it could have been left by someone she knows. At first she says she just arrived in Shanghai and knows nobody; but then she reluctantly relates, through a flashback, what seemed like a vision to her as she went to see the Shanghai Oriental Pearl Tower that afternoon. The vision is of Shanghai at an earlier time, and of her going up some stairs to a room in which she saw a Chinese man. As they kiss and profess their love for each other, the scene changes to modern Shanghai, and the man says he wants to stay, but cannot. The vision fades as the man hands her a blue rose. Cotillard is in tears. She opens the bag and finds a blue rose. The picture ends with her clutching the bag to her heart.","torrent":{"xt":"urn:btih:498d75619f79839a6e2da34abe980c4412259e64","amp;dn":"Lady+Blue+Shanghai+%28dir.+David+Lynch%2C+short+film+for+Dior%2C+2010%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"498d75619f79839a6e2da34abe980c4412259e64","infoHashBuffer":{"type":"Buffer","data":[73,141,117,97,159,121,131,154,110,45,163,74,190,152,12,68,18,37,158,100]},"announce":[],"urlList":[]}}