{"title":"The Seafarers - The Great Liners (History Sea Travel Ebook).pdf","uid":11108795,"size":30327801,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4b3aa0e0ceffb5301552982a988b3a42a1f62bf7&amp;dn=The+Seafarers+-+The+Great+Liners+%28History+Sea+Travel+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STBGD","files":-1,"time":1411767728,"description":"Pdf / English / 1978 Time Life The Seafarers Series / 176 pages / 28.9 MB\n\nIt is a curious fact that the greatest liners of all time were those which plied their trade across the North Atlantic and it is to those great ships that this book is dedicated.\n\nHad I reviewed this work in 1978 when the book was first published, I would have had no hesitation in awarding the full 5 Stars. It is, after all, one in a lengthy series of Time-Life books known for their excellence. The only fault with my particular copy is the leather bound cover. Being stretched over card, over time, the leather has slightly shrunk against that card creating a warped book! Most annoying, that's all.\n\nAs far as the content is concerned, quite excellent. The appetite is whetted by the immediate inclusion of ten full page reproductions of posters from a bygone age. Unlike other books of the genre, this one does not zero in on and then concentrate on the Titanic - as though that were the only ship ever to have sailed. Instead we get a complete history of transatlantic passenger liners of which the Titanic was a part.\n\nThe photographs are worthy of the research which has undoubtedly gone into the text with plenty of pictures which are both exciting and, curiously, I am surprised to note, I have not seen elsewhere. The overall subject is so thoroughly covered that short biographies of such diverse characters as Cunard and Brunel are also included.\n\nAltogether, an excellent product - except for that wretched cover.\n\nNM, Amazon\n\n","torrent":{"xt":"urn:btih:4b3aa0e0ceffb5301552982a988b3a42a1f62bf7","amp;dn":"The+Seafarers+-+The+Great+Liners+%28History+Sea+Travel+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b3aa0e0ceffb5301552982a988b3a42a1f62bf7","infoHashBuffer":{"type":"Buffer","data":[75,58,160,224,206,255,181,48,21,82,152,42,152,139,58,66,161,246,43,247]},"announce":[],"urlList":[]}}