{"title":"(ebook) The Mafia Encyclopedia - FoxoF","uid":3938486,"size":22332313,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4be430f8bd0d5978dbd5f063e9767c68adf8ab1d&amp;dn=%28ebook%29+The+Mafia+Encyclopedia+-+FoxoF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"FoxoF","files":3,"time":1197989859,"description":"They&amp;#039;re all there, starting with Anthony Joseph Accardo (1906-1992), the Chicago mob leader known as Tony to crime pals, Mr. Accardo to underlings, Joe Batters to his subordinates, and as &quot;having more brains before breakfast than Al Capone had all day&quot; to syndicate supporters, and working through the alphabet to Abner &quot;Longy&quot; Zwillman (1899-1959), a crime-syndicate founder and New Jersey boss, one of the most feared of the Jewish Mafia, known as the &quot;Al Capone of new Jersey,&quot; and much revered for his love affair with Jean Harlow.\n\nBetween Accardo and Zwillman, Carl Sifakis explores the lives, reputations, exploits, and subcultures of more than 450 Mafia perpetrators and personalities. Sifakis describes the individuals, codes of behavior, misdeeds, legal scrapes, rivalries, and flamboyant lifestyles associated with the world of organized crime--an entity whose existence J. Edgar Hoover denied for 30 years. Sifakis&amp;#039;s research is thorough, and his subjects are nefarious and riveting. It&amp;#039;s his feel for storytelling, however, that makes his encyclopedia so enjoyable. He writes about infamous characters such as Al Capone (who felt his bootlegging was merely a public service) and John Gotti (a.k.a. the Teflon Don, who&amp;#039;s now serving a life sentence) as well as the Mafia Social Clubs, Donnie Brasco (the FBI agent who infiltrated the mob and sent more than 100 mobsters to prison), and the importance of slot machines to the post-Prohibition welfare of organized crime.\n\nWith nearly 100 pictures and illustrations, Sifakis&amp;#039;s mob opus is required reading for Mafia buffs, and a remarkably engaging guide for anyone interested in a factual report on organized crime. --Stephanie Gold --This text refers to the Paperback edition.\n\nFrom Library Journal\nSince former crime reporter Sifakis&amp;#039;s excellent Mafia Encyclopedia was first published in 1987, mob bosses John Gotti and Vinny &quot;the Chin&quot; Gigante have gone to jail and informer Sammy &quot;the Bull&quot; Gravano has reached the best sellers lists. Such Mafia shakeups have necessitated this extensive revision, which now boasts nearly 450 discerning entries covering the whole mobster universe from &quot;Making Your Bones&quot; to money laundering and the &quot;Buckwheats&quot; (painful murder methods); loansharking and the &quot;Concrete scam&quot;; favorite Mafia social clubs, restaurants, and burial grounds; and even an entry on Midnight Rose&amp;#039;s, the Brooklyn candy store where so many of Murder, Inc.&amp;#039;s killings were planned. Sifakis&amp;#039;s prose is free of the typical platitudes about &quot;honor&quot; or &quot;blood oaths.&quot; He points out that the most important Mafia figure was not Al Capone but Lucky Luciano, who, along with Meyer Lansky, &quot;Americanized&quot; and transformed the Prohibition-era booze rackets into &quot;a national crime syndicate, a network of multi-ethnic gangs...which has bled Americans of incalculable billions over the years.&quot; Sifakis relishes the Mafia&amp;#039;s vivid folklore without subscribing to it. The infamous score-evening slaughter of 1931 called the &quot;Night of the Sicilian Vespers,&quot; in which dozens of Luciano&amp;#039;s enemies were said to have been simultaneously eliminated nationwide, turns out to be mythology. And while Chicago and Vegas mobster John Roselli was probably not the JFK hitman (as alleged in Bill Bonanno&amp;#039;s Bound by Honor, LJ 3/15/99, his accomplishments did include taking $400,000 from Phil Silvers, Zeppo Marx, and others in a famous rigged card game.\n\n# 510 pages\n# Publisher: Checkmark Books; 3 edition (June 30, 2005)\n# Language: English\n# ISBN-10: 0816056951\n# ISBN-13: 978-0816056958 ","torrent":{"xt":"urn:btih:4be430f8bd0d5978dbd5f063e9767c68adf8ab1d","amp;dn":"%28ebook%29+The+Mafia+Encyclopedia+-+FoxoF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4be430f8bd0d5978dbd5f063e9767c68adf8ab1d","infoHashBuffer":{"type":"Buffer","data":[75,228,48,248,189,13,89,120,219,213,240,99,233,118,124,104,173,248,171,29]},"announce":[],"urlList":[]}}