{"title":"The Uninvited by Liz Jensen","uid":7636923,"size":1088311,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4e37a6d7d1e41fa6efaeacf5553838a60870d767&amp;dn=The+Uninvited+by+Liz+Jensen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"azizex666","files":-1,"time":1347670471,"description":"A seven-year-old girl puts a nail-gun to her grandmother's neck and fires. An isolated incident, say the experts. The experts are wrong. Across the world, children are killing their families. Is violence contagious? As chilling murders by children grip the country, anthropologist Hesketh Lock has his own mystery to solve: a bizarre scandal in the Taiwan timber industry. Hesketh has never been good at relationships: Asperger's Syndrome has seen to that. But he does have a talent for spotting behavioural patterns, and an outsider's fascination with group dynamics. Nothing obvious connects Hesketh's Southeast Asian case with the atrocities back home. Or with the increasingly odd behaviour of his beloved step-son, Freddy. But when Hesketh's Taiwan contact dies shockingly and more acts of sabotage and child violence sweep the globe, he is forced to acknowledge possibilities that defy the rational principles on which he has staked his life, his career and, most devastatingly of all, his role as a father. Part psychological thriller, part dystopian nightmare, The Uninvited is a powerful and viscerally unsettling portrait of apocalypse in embryo.\n\n\n                           Format 1 - .ePUB\n\n                           Format 2 - .Mobi\n\n\n          **Support Your Favorite Authors By Buying Their Books**\n \n            Check out all my Magazine and ebook uploads here.\n\n                &lt;a href=&quot; https://thepiratebay.se/user/azizex666/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://thepiratebay.se/user/azizex666/&lt;/a&gt;","torrent":{"xt":"urn:btih:4e37a6d7d1e41fa6efaeacf5553838a60870d767","amp;dn":"The+Uninvited+by+Liz+Jensen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e37a6d7d1e41fa6efaeacf5553838a60870d767","infoHashBuffer":{"type":"Buffer","data":[78,55,166,215,209,228,31,166,239,174,172,245,85,56,56,166,8,112,215,103]},"announce":[],"urlList":[]}}