{"title":"Energetic Nanomaterials - Synthesis, Characterization, and Appli","uid":14729399,"size":37555627,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4e8f88c7837af5017dae08499f5f0d0e5e49d503&amp;dn=Energetic+Nanomaterials+-+Synthesis%2C+Characterization%2C+and+Appli&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1464579010,"description":"Energetic Nanomaterials - Synthesis, Characterization, and Application - V. E. Zarko, A. A. Gromov (Elsevier, 2016).pdf\r\n\r\nISBN 978-0-12-802710-3\r\n\r\nEnergetic Nanomaterials: Synthesis, Characterization, and Application provides researchers in academia and industry the most novel and meaningful knowledge on nanoenergetic materials, covering the fundamental chemical aspects from synthesis to application.\r\n\r\nThis valuable resource fills the current gap in book publications on nanoenergetics, the energetic nanomaterials that are applied in explosives, gun and rocket propellants, and pyrotechnic devices, which are expected to yield improved properties, such as a lower vulnerability towards shock initiation, enhanced blast, and environmentally friendly replacements of currently used materials.\r\n\r\nThe current lack of a systematic and easily available book in this field has resulted in an underestimation of the input of nanoenergetic materials to modern technologies. This book is an indispensable resource for researchers in academia, industry, and research institutes dealing with the production and characterization of energetic materials all over the world.\r\n\r\n\r\nWritten by high-level experts in the field of nanoenergetics\r\nCovers the hot topic of energetic nanomaterials, including nanometals and their applications in nanoexplosives\r\nFills a gap in energetic nanomaterials book publications","torrent":{"xt":"urn:btih:4e8f88c7837af5017dae08499f5f0d0e5e49d503","amp;dn":"Energetic+Nanomaterials+-+Synthesis%2C+Characterization%2C+and+Appli","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e8f88c7837af5017dae08499f5f0d0e5e49d503","infoHashBuffer":{"type":"Buffer","data":[78,143,136,199,131,122,245,1,125,174,8,73,159,95,13,14,94,73,213,3]},"announce":[],"urlList":[]}}