{"title":"The Rise and Fall of Al-Qaeda","uid":6734775,"size":1196987,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4ead17b5d2b8c5a92f443fa4311854d07eb3de85&amp;dn=The+Rise+and+Fall+of+Al-Qaeda&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"neil1966hardy","files":2,"time":1318288297,"description":"In this concise and fascinating book, Fawaz A. Gerges argues that Al-Qaeda has degenerated into a fractured, marginal body kept alive largely by the self-serving anti-terrorist bureaucracy it helped to spawn. In The Rise and Fall of Al-Qaeda, Fawaz Gerges, a public intellectual known widely in the academe and media for his expertise on radical ideologies, including jihadism, argues that the Western powers have become mired in a &quot;terrorism narrative,&quot; stemming from the mistaken belief that America is in danger of a devastating attack by a crippled Al-Qaeda. To explain why Al-Qaeda is no longer a threat, he provides a briskly written history of the organization, showing its emergence from the disintegrating local jihadist movements of the mid-1990s-not just the Afghan resistance of the 1980s, as many believe-in &quot;a desperate effort to rescue a sinking ship by altering its course.&quot; During this period, Gerges interviewed many jihadis, gaining a first-hand view of the movement that bin Laden tried to reshape by internationalizing it. He reveals that transnational jihad has attracted but a small minority within the Arab world and possesses no viable social and popular base. Furthermore, he shows that the attacks of September 11, 2001, were a major miscalculation--no &quot;river&quot; of fighters flooded from Arab countries to defend Al-Qaeda in Afghanistan, as bin Laden expected. The democratic revolutions that swept the Middle East in early 2011 show that al-Qaeda today is a non-entity which exercises no influence over Arabs' political life.Gerges shows that there is a link between the new phenomenon of homegrown extremism in Western societies and the war on terror, particularly in Afghanistan-Pakistan, and that homegrown terror exposes the structural weakness, not strength, of bin Laden's al-Qaeda. Gerges concludes that the movement has splintered into feuding factions, neutralizing itself more effectively than a Predator drone. Forceful, incisive, and written with extensive inside knowledge, this book will alter the debate on global terrorism.\n\nOxford University Press\n2011\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:4ead17b5d2b8c5a92f443fa4311854d07eb3de85","amp;dn":"The+Rise+and+Fall+of+Al-Qaeda","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ead17b5d2b8c5a92f443fa4311854d07eb3de85","infoHashBuffer":{"type":"Buffer","data":[78,173,23,181,210,184,197,169,47,68,63,164,49,24,84,208,126,179,222,133]},"announce":[],"urlList":[]}}