{"title":"Darryl_Worley-Here_And_Now-2006","uid":3576763,"size":78330850,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4f293750769ce79ce5e66253769af27ec9c2a249&amp;dn=Darryl_Worley-Here_And_Now-2006&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"oraf","files":14,"time":1166122151,"description":"RIP DATE...: Nov-21-2006\nSTORE DATE.: Nov-21-2006\nGENRE......: Country\nQUALITY....: VBR  /  44.1Hz  /  Joint-Stereo\nSIZE.......: 74,7 MB\n\n\nTrack Listing:\n\n01 - Jumpin&amp;#039; Off The Wagon                      03:47\n02 - Nothin&amp;#039; But A Love Thang                   03:04\n03 - Free                                       03:23\n04 - It&amp;#039;s The Way You Love Me                   03:47\n05 - Party Song                                 04:24\n06 - Living In The Here And Now                 04:19\n07 - Do You Know What That Is                   03:26\n08 - Things I&amp;#039;ll Never Do Again                 04:01\n09 - Slow Dancing With A Memory                 03:44\n10 - Whiskey Makes The World Go Round           03:42\n11 - Lowdown Women                              03:37\n12 - Nothin&amp;#039; To Lose                            04:15\n13 - I Just Came Back From A War                05:27\n\n                                                Ã„Ã„Ã„Ã„Ã„\n                                                50:56 min\nRelease Notes:\n\nProduced by Frank Rogers, Here and Now features thirteen new\nsongs, all penned by Darryl Worley and friends.\n\nDarryl Worley today is his own man, in control of his music and\nhis life. He looks the way he wants to look. He&amp;#039;s writing and\nsinging the songs he wants to sing. He has hooked up with an\nartist-friendly record label, the mid-sized 903 Music. A full 360\ndegree view of Worley as a writer and artist is clearly evident on\nHere and Now.\n\nThere&amp;#039;s a new exuberance in his declarations of personal and\nprofessional independence with titles like Jumpin&amp;#039; Off the Wagon,\nFree, Living In the Here and Now, and Nothin&amp;#039; To Lose.\n\nThere&amp;#039;s honesty, too, and compassion, in stories he pulls from\nlife on songs like Slow Dancing with a Memory, and Things I&amp;#039;ll\nNever Do Again.\n\nThen there&amp;#039;s that steamy tale on Ain&amp;#039;t Nothin&amp;#039; but a Love Thang,\nand party songs like Party Song and Whiskey Makes the World Go\nRound, and more surprises to boot.\n\nWorley comments, &quot;A thread runs through this album: that sense of\nfreedom that comes not only from within but also through things\nyou experience in your life. When so many changes happen on the\noutside, they&amp;#039;re bound to affect you on the inside too. So these\nsongs don&amp;#039;t come from the same Darryl Worley you&amp;#039;ve had the\nopportunity to meet and get to know.&quot; He continues, &quot;It&amp;#039;s not just\nnew music or a new direction. This is a somewhat different guy\nwho&amp;#039;s gone through a lot and come to a place where I want to let\nsome of the seriousness go and help people laugh, smile, and have\na good time.&quot;\n\nBut while there is an abundance of good time music on this album,\nit&amp;#039;s emotional centerpiece is the emotionally-charged I Just Came\nBack (From a War), inspired by a Marine that Worley met who was\nhaving a difficult time adjusting to life back home after being at\nbattle in Iraq. The song, about compassion and understanding, is\nshooting up the Country radio charts and garnering national media\nattention.\n\nWorley performs the song tonight when he headlines Eagle\nAppreciation Day at Fort Campbell, organized to say thank you to\nall the 101st Airborne Division soldiers and their families for\ntheir hard work and the sacrifices they endure on a daily basis.\n\nAfter recent coverage in The New York Times and Reuters, street\nweek media for Here and Now includes Associated Press Television;\nUSA Today; The Today Show: Weekend Edition (11/19); MSNBC.com; a\ntelevision special on Great American Country (11/19 - 11/22); CMT\n330 Sessions (11/21); AT&amp;T blue room performance (11/21); and a\nJones Radio World Premiere, among others.\n\nDarryl Worley debuted on the Country charts with a trio of top-15\nhits in 2000-01: When You Need My Love, A Good Day to Run, and\nSecond Wind. His breakthrough year was 2002 when Worley&amp;#039;s touching\nballad I Miss My Friend, the title tune to his second CD, became\nhis first No. 1 hit. After he spent Christmas 2002 entertaining\nAmerica&amp;#039;s troops in Afghanistan, Kuwait and Uzbekistan, he came\nhome and wrote the patriotic anthem Have You Forgotten?, which\nbecame his second No. 1 song and remained at the top of the charts\nfor six weeks. In the summer of 2004, Awful Beautiful Life was\nreleased and soon rocketed up the country music charts to become a\nmulti-week No. 1 record in January 2005.\n","torrent":{"xt":"urn:btih:4f293750769ce79ce5e66253769af27ec9c2a249","amp;dn":"Darryl_Worley-Here_And_Now-2006","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f293750769ce79ce5e66253769af27ec9c2a249","infoHashBuffer":{"type":"Buffer","data":[79,41,55,80,118,156,231,156,229,230,98,83,118,154,242,126,201,194,162,73]},"announce":[],"urlList":[]}}