{"title":"Watkins-Footnotes to History(School of Foreign Service at George","uid":5415354,"size":3250035,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4f776b5cddd95b94ace536ac258603254ab78efe&amp;dn=Watkins-Footnotes+to+History%28School+of+Foreign+Service+at+George&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"red_gonzo","files":1,"time":1267898196,"description":"This is Anna Watkins' informative book Footnotes to History - Selected Speeches and Writings of Edmund A. Walsh, S.J. - Founder of the School of Foreign Service (1990) which is a collection of some literary writings by the founder of famous School of Foreign Service at Georgetown University in America which among others hosted professors such as Carroll Quigley and students such as former US president Bill Clinton. Walsh was a Jesuit priest and his ideas and views were well known in his time, when he was recognized as a world authority on Russian affairs and expert on geopolitics. Despite their grounding in his own times, his speeches and writings retain remarkable freshness, and some of the topics he discussed still occupy our minds today. The publication of this anthology during the seventieth year of the Edmund A. Walsh School of Foreign Service represents, in the opinion of the writer, a most appropriate memorial to the founder of this internationally renowned educational institution. During the first three decades of the School's existence - almost half of its entire life - it reflected, in a manner rarely experienced in our own times, the genius and creativity of one of the most gifted and indeed charismatic personalities of the Society of Jesus in the twentieth century: Edmund A. Walsh. It was not surprising that after the death of father Walsh in 1956, the University renamed the School in honor of its founder. This fascinating book offers a rare glimpse into the unbelievable influence that the Jesuit order exerts in formulating American foreign policy which then becomes de facto world policy. 175 pages, few pictures. A must read for everyone.\n","torrent":{"xt":"urn:btih:4f776b5cddd95b94ace536ac258603254ab78efe","amp;dn":"Watkins-Footnotes+to+History%28School+of+Foreign+Service+at+George","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f776b5cddd95b94ace536ac258603254ab78efe","infoHashBuffer":{"type":"Buffer","data":[79,119,107,92,221,217,91,148,172,229,54,172,37,134,3,37,74,183,142,254]},"announce":[],"urlList":[]}}