{"title":"Tales of the Otori by Lian Hearn, books 1-5","uid":4281016,"size":4209378560,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:4fe32eb734f097a45047b3150ecc8e7f89281507&amp;dn=Tales+of+the+Otori+by+Lian+Hearn%2C+books+1-5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":4,"uploader":"Ayfon","files":10,"time":1215423555,"description":"Book 1 Introduction- A tour-de-force novel set in ancient Japan filled with passion, fantasy, and feuding warlords. The first volume in the highly anticipated Tales of the Otori trilogy. Sixteen-year-old Takeo&amp;#039;s village has been massacred by an evil warlord, and he is about to be slain by the men who murdered his parents and neighbors. At the last moment, his life is saved by a nobleman, who claims the boy as his kin and begins his education. But nothing is as it seems. Takeo discovers that he has rare powers that are useful to those around him. As he grows into manhood, he must decide where his loyalties lie: with his noble master and adoptive father; with the Hidden, a secret, spiritual sect whose beliefs are forbidden; or with the Tribe, the assassins and spies who consider him one of their own. A story of treachery, political intrigue, and the intensity of first love, set in a world ruled by formal ritual and codes of honor, Across the Nighingale Floor crosses genres, generations, and genders to captivate fans of all ages.","torrent":{"xt":"urn:btih:4fe32eb734f097a45047b3150ecc8e7f89281507","amp;dn":"Tales+of+the+Otori+by+Lian+Hearn%2C+books+1-5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4fe32eb734f097a45047b3150ecc8e7f89281507","infoHashBuffer":{"type":"Buffer","data":[79,227,46,183,52,240,151,164,80,71,179,21,14,204,142,127,137,40,21,7]},"announce":[],"urlList":[]}}