{"title":"Talking Heads 24 Bit Vinyl Pack","uid":8977332,"size":4225226841,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:501ac5712f9e948e2bb7e063c6a2a189be5ca2d1&amp;dn=Talking+Heads+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"politux","files":-1,"time":1380476786,"description":"\n  Talking Heads 24 Bit Vinyl Pack\n\n  Genre: Pop/Rock\n  Styles: New Wave, Post-Punk, College Rock, Dance-Rock\n  Source: vinyl\n  Codec: FLAC\n  Bit Rate: ~ 2,900 kbps\n  Bit Depth: 24\n  Sampling Rate: 96,000 Hz\n\n  1977 Talking Heads 77 (180g Audiophile Pressing)\n  1979 Fear of Music\n  1980 Remain in Light\n  1983 Speaking in Tongues\n  1984 Stop Making Sense (sides and cue)\n\n  At the start of their career, Talking Heads were all nervous energy, detached emotion, and subdued minimalism. When they released their last album about 12 years later, the band had recorded everything from art-funk to polyrhythmic worldbeat explorations and simple, melodic guitar pop. Between their first album in 1977 and their last in 1988, Talking Heads became one of the most critically acclaimed bands of the '80s, while managing to earn several pop hits. While some of their music can seem too self-consciously experimental, clever, and intellectual for its own good, at their best Talking Heads represent everything good about art-school punks.\n\n  And they were literally art-school punks. Guitarist/vocalist David Byrne, drummer Chris Frantz, and bassist Tina Weymouth met at the Rhode Island School of Design in the early '70s; they decided to move to New York in 1974 to concentrate on making music. The next year, the band won a spot opening for the Ramones at the seminal New York punk club CBGB. In 1976, keyboardist Jerry Harrison, a former member of Jonathan Richman's Modern Lovers, was added to the lineup. By 1977, the band had signed to Sire Records and released its first album, Talking Heads: 77. It received a considerable amount of acclaim for its stripped-down rock &amp; roll, particularly Byrne's geeky, overly intellectual lyrics and uncomfortable, jerky vocals.\n\n  For their next album, 1978's More Songs About Buildings and Food, the band worked with producer Brian Eno, recording a set of carefully constructed, arty pop songs, distinguished by extensive experimenting with combined acoustic and electronic instruments, as well as touches of surprisingly credible funk. On their next album, the Eno-produced Fear of Music, Talking Heads began to rely heavily on their rhythm section, adding flourishes of African-styled polyrhythms. This approach came to a full fruition with 1980's Remain in Light, which was again produced by Eno. Talking Heads added several sidemen, including a horn section, leaving them free to explore their dense amalgam of African percussion, funk bass and keyboards, pop songs, and electronics.\n  \n  After a long tour, the band concentrated on solo projects for a couple of years. By the time of 1983's Speaking in Tongues, the band had severed its ties with Eno; the result was an album that still relied on the rhythmic innovations of Remain in Light, except within a more rigid pop-song structure. After its release, Talking Heads embarked on another extensive tour, which was captured on the Jonathan Demme-directed concert film Stop Making Sense. After releasing the straightforward pop album Little Creatures in 1985, Byrne directed his first movie, True Stories, the following year; the band's next album featured songs from the film. Two years later, Talking Heads released Naked, which marked a return to their worldbeat explorations, although it sometimes suffered from Byrne's lyrical pretensions.\n\n  After its release, Talking Heads were put on &quot;hiatus&quot;; Byrne pursued some solo projects, as did Harrison, and Frantz and Weymouth continued with their side project, Tom Tom Club. In 1991, the band issued an announcement that they had broken up. Shortly thereafter, Harrison's production took off with successful albums by Live and Crash Test Dummies. In 1996, the original lineup minus Byrne reunited for the album No Talking Just Head; Byrne sued Frantz, Weymouth, and Harrison for attempting to record and perform as Talking Heads, so the trio went by the Heads. In 1999, all four worked together to promote a 15th-anniversary edition of Stop Making Sense, and they also performed at the 2002 induction ceremony for their entrance into the Rock and Roll Hall of Fame. Through the 2010s, Byrne released a number of solo and collaborative projects. Tom Tom Club continued to tour, while Harrison produced albums for the likes of No Doubt, the Von Bondies, and Hockey.","torrent":{"xt":"urn:btih:501ac5712f9e948e2bb7e063c6a2a189be5ca2d1","amp;dn":"Talking+Heads+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"501ac5712f9e948e2bb7e063c6a2a189be5ca2d1","infoHashBuffer":{"type":"Buffer","data":[80,26,197,113,47,158,148,142,43,183,224,99,198,162,161,137,190,92,162,209]},"announce":[],"urlList":[]}}