{"title":"The Walking Dead- Rise of the Governor","uid":7188925,"size":420612,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:511d3dee0aafb3041c2d67dba49c790000a72720&amp;dn=The+Walking+Dead-+Rise+of+the+Governor&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tduckin","files":-1,"time":1334554581,"description":"Hi there! :D\n            Excellent EPUB that outlines the origins of an important character in the next season of the popular AMC series &quot;The Walking Dead&quot;. A must read for any real fan! Excellent quality epub courtesy of Barnes and Noble. \n              \n               Youre Welcome! \n\n\nThe Walking Dead: Rise of the Governor is a post-apocalyptic horror novel written by Robert Kirkman and Jay Bonansinga. The novel is a spin-off of Kirkman's series of graphic novels and explores the back-story of one of the series' most infamous characters, The Governor. Rise of the Governor is the first in a planned trilogy of novels.[1] The novel was released on October 11, 2011 to a generally positive critical reaction.\n\nThe novel follows the story of Philip Blake, his older brother Brian, his daughter Penny and friends Bobby and Nick as they struggle to survive in a world ravaged by the zombie apocalypse.\nThe group of survivors are hiding in a large house within the private neighborhood of Wiltshire Estates, planning to move on to the nearby city of Atlanta, where a fabled &quot;safe zone&quot; is supposedly located. A zombie (which Brian had previously warned was not accounted for among the remains of the house's previous inhabitants) comes out of its hiding place and infects Bobby with the undead plague, killing him. Distraught, the remaining four of the group continue on, but not before Brian leaves a sign outside the gated community stating &quot;ALL DEAD DO NOT ENTER&quot;.","torrent":{"xt":"urn:btih:511d3dee0aafb3041c2d67dba49c790000a72720","amp;dn":"The+Walking+Dead-+Rise+of+the+Governor","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"511d3dee0aafb3041c2d67dba49c790000a72720","infoHashBuffer":{"type":"Buffer","data":[81,29,61,238,10,175,179,4,28,45,103,219,164,156,121,0,0,167,39,32]},"announce":[],"urlList":[]}}