{"title":"The Waxman Report- How Congress Really Works by Henry Waxman, Jo","uid":11589812,"size":1896344,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:514019589a63df95bd50e7f68d1699b9a648d39f&amp;dn=The+Waxman+Report-+How+Congress+Really+Works+by+Henry+Waxman%2C+Jo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gratefuldawg77","files":6,"time":1417218382,"description":"At a time when some of the most sweeping national initiatives in decades are being debated, Congressman Henry Waxman offers a fascinating inside account of how Congress really works by describing the subtleties and complexities of the legislative process.\n\nFor four decades, Waxman has taken visionary and principled positions on crucial issues and been a driving force for change. Because of legislation he helped champion, our air is cleaner, our food is safer, and our medical care better. Thanks to his work as a top watchdog in Congress, crucial steps have been taken to curb abuses on Wall Street, to halt wasteful spending in Iraq, and to ban steroids from Major League Baseball. Few legislators can match his accomplishments or his insights on how good work gets done in Washington.\n\nIn this book, Waxman affords readers a rare glimpse into how this is achieved-the strategy, the maneuvering, the behind-the-scenes deals. He shows how the things we take for granted (clear information about tobacco's harmfulness, accurate nutritional labeling, important drugs that have saved countless lives) started out humbly-derided by big business interests as impossible or even destructive. Sometimes, the most dramatic breakthroughs occur through small twists of fate or the most narrow voting margin. Waxman's stories are surprising because they illustrate that while government's progress may seem glacial, much is happening, and small battles waged over years can yield great results.\n\nAt a moment when so much has been written about what's wrong with Congress-the gridÂ­lock, the partisanship, the influence of interest groups-Henry Waxman offers sophisticated, concrete examples of how governÂ­ment can (and should) work","torrent":{"xt":"urn:btih:514019589a63df95bd50e7f68d1699b9a648d39f","amp;dn":"The+Waxman+Report-+How+Congress+Really+Works+by+Henry+Waxman%2C+Jo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"514019589a63df95bd50e7f68d1699b9a648d39f","infoHashBuffer":{"type":"Buffer","data":[81,64,25,88,154,99,223,149,189,80,231,246,141,22,153,185,166,72,211,159]},"announce":[],"urlList":[]}}