{"title":"Illinois Jacquet - 1963 - Illinois Jacquet (1997 vinyl 24 96) FL","uid":9414332,"size":796221446,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:514da67135912ef233d2f5235beb8b01a475b318&amp;dn=Illinois+Jacquet+-+1963+-+Illinois+Jacquet+%281997+vinyl+24+96%29+FL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":4,"uploader":"eika256","files":-1,"time":1388396095,"description":"Illinois Jacquet - 1963 - Illinois Jacquet (1997)\nVinyl 24 bits, 96 KHz\n\nIllinois Jacquet: Illinois Jacquet is a two-record set bringing together two of Jacquet's Argo/Cadet dates. From 5/7 &amp; 8/63, this was a date with Kenny Burrell or Wally Richardson (guitar), Ralph Smith (organ), Ben Tucker (bass), Willie Rodriquez and Ray Lucas (drums) and it covers seven tracks. For some reason one track from the original issue (&quot;Wild Man&quot;) was not included here...On one track, &quot;Bassoon Blues,&quot; the leader played bassoon, but it was Burrell whose solo interests. This session lasted only 26 minutes. The other half of this two-fer reissued Go Power, a 3/66 date from Lennie's-on-the-Turnpike with the distinctive organ work of Milt Buckner and house drummer Alan Dawson. The material here was more condensed and directly dealt with in terms of both emotional involvement and group interaction. There was also the element here of a live and appreciative audience which, while encouraging some of the more grandstanding moments, also drove the musicians to dig in. This was a date with a party ambiance, but with enough fine improvisatory jazz to please those who wish to listen with both ears. (AllMusic)\n\nTrack list:\n01 - Frantic Fanny\n02 - Stella by Starlight\n03 - Satin Doll\n04 - Banned in Boston\n05 - Indiana\n06 - Ydeen-O\n07 - Imagination\n08 - How Now!\n09 - Reverie\n10 - Pucker Up\n\nPersonnel:\nOn Satin Doll and Pucker Up - Ernie Royal, Roy Eldridge, trumpets; Matthew Gee, trombone; Illinois Jacquet, tenor; Leo Parker, baritone; Sir Charles Thompson, piano; Kenny Burrell, guitar; Jimmy Crawford, drums; Jimmy Rowser, bass.\nOn Banned in Boston, Ydeen-O, Indiana, Reverie - Roy Eldridge, trumpet; Illinois Jacquet, tenor or alto; Charlie Davis, baritone; Sir Charles Thompson, piano; Barry Galbraith, guitar; Jo Jones, drums; George Duvivier, bass.\nOn How Now?, Frantic Fanny, Stella by Starlight, Imagination - Roy Eldridge, trumpet; Matthew Gee, trombone; Illinois Jacquet, tenor or alto; Cecil Payne, baritone; Sir Charles Thompson, piano; Kenny Burrell, guitar; Jo Jones, drums; George Duvivier, bass.\n\nEnjoy and share!","torrent":{"xt":"urn:btih:514da67135912ef233d2f5235beb8b01a475b318","amp;dn":"Illinois+Jacquet+-+1963+-+Illinois+Jacquet+%281997+vinyl+24+96%29+FL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"514da67135912ef233d2f5235beb8b01a475b318","infoHashBuffer":{"type":"Buffer","data":[81,77,166,113,53,145,46,242,51,210,245,35,91,235,139,1,164,117,179,24]},"announce":[],"urlList":[]}}