{"title":"Craving: Why We Can't Seem to Get Enough (2013) -epub","uid":8645305,"size":2230379,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:51f7170b2ce12fd2fb630d7db5f85be63ced5dab&amp;dn=Craving%3A+Why+We+Can%27t+Seem+to+Get+Enough+%282013%29+-epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bookzilla","files":1,"time":1372970022,"description":"A nationally recognized expert on compulsive behaviors explains the phenomenon of craving and gives us tools to achieve freedom from our seemingly insatiable desires by changing our actions to remap our brains.\n \nWhen we find ourselves wanting something strong enough, we'll do just about anything to get it--sometimes at the expense of our bodies, brains, banks accounts, and relationships. So why do we sometimes have the irrepressible feeling that we need something--such as food, cigarettes, alcohol, or sex-- that we really just want? And how do we satiate that feeling without indulging it?\n \nIn Craving, Omar Manejwala, M.D., translates the neurobiology of this phenomenon into real and accessible terms, explaining why we just can't seem to get enough. He then gives us tools and guidance to find satisfaction without giving in to our cravings. Dr. Manejwala explains:\n \n- how and why our brain drives behavior\n - how to change the part of our brain that fuels our cravings\n - the warning signs that craving is evolving into addiction\n - why craving is the most difficult component of addiction to address\n - why certain groups are so effective at changing behaviors, receiving encouragement, and remaining accountable\n\n2013","torrent":{"xt":"urn:btih:51f7170b2ce12fd2fb630d7db5f85be63ced5dab","amp;dn":"Craving%3A+Why+We+Can%27t+Seem+to+Get+Enough+%282013%29+-epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"51f7170b2ce12fd2fb630d7db5f85be63ced5dab","infoHashBuffer":{"type":"Buffer","data":[81,247,23,11,44,225,47,210,251,99,13,125,181,248,91,230,60,237,93,171]},"announce":[],"urlList":[]}}