{"title":"Norton.Internet.Security.2012.OEM.Multilenguaje.Incl.Serial.And.","uid":6518460,"size":125532644,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:52430af745a1669687615165a3441fc472541848&amp;dn=Norton.Internet.Security.2012.OEM.Multilenguaje.Incl.Serial.And.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mdq1","files":1,"time":1309910721,"description":"central-torrent.com\ncentral-torrent.com\n\nDatos TÃƒÂ©cnicos\nSymantec System Recovery 2011 v10.0.0.39952 Multilenguaje + Recovery Disk\nEnglish, Spanish, French, German, Italian, Chinese, Japanese, Korean, Portugese, Russian| 518 MB | NFO (RecoveryDisk) | NFO\nDescripciÃƒÂ³n\nConocido anteriormente como Backup Exec System Recovery\n\nSymantec System Recovery 2011 ofrece recuperaciÃƒÂ³n del sistema rÃƒÂ¡pida y confiable para ayudarle a reducir el tiempo fuera de servicio y cumplir los objetivos de tiempo de recuperaciÃƒÂ³n con confianza. Recupere rÃƒÂ¡pidamente sistemas virtuales y fÃƒÂ­sicos en minutos, incluso a estado bare-metal, hardware heterogÃƒÂ©neo, entornos virtuales o ubicaciones remotas. Con mÃƒÂ¡s de 787.000 sistemas protegidos, Symantec System Recovery es una de las soluciones de recuperaciÃƒÂ³n del sistema mÃƒÂ¡s probadas y confiables.\n\nFunciones principales\nRecupere servidores fÃƒÂ­sicos y virtuales en minutos desde ubicaciones locales o externas, incluso a estado bare-metal, hardware heterogÃƒÂ©neo, entornos virtuales o ubicaciones remotas.\nRealice copias de seguridad externas en una ubicaciÃƒÂ³n FTP o una unidad de disco secundaria para lograr mejores capacidades de recuperaciÃƒÂ³n despuÃƒÂ©s de un desastre.\nLleve a cabo conversiones automÃƒÂ¡ticas sin inconvenientes de equipo fÃƒÂ­sico a virtual (P2V) y de virtual a fÃƒÂ­sico (V2P).\nCapture y proteja todo el sistema, incluidos el SO, las aplicaciones, todos los archivos, los controladores de dispositivo, etc. en un punto de recuperaciÃƒÂ³n fÃƒÂ¡cil de administrar mediante tecnologÃƒÂ­a basada en imÃƒÂ¡genes.\nPrograme copias de seguridad para que se ejecuten automÃƒÂ¡ticamente, incluidas copias de seguridad activadas por eventos, sin interrumpir la productividad del usuario.\nEl cifrado AES incorporado de las copias de seguridad garantiza la seguridad de los datos empresariales crÃƒÂ­ticos.\nVentajas clave\n\nDisminuya significativamente el tiempo fuera de servicio y evite pÃƒÂ©rdidas de ganancias y de productividad de los empleados en caso de que falle un sistema.\nCumpla los objetivos de tiempo de recuperaciÃƒÂ³n mÃƒÂ¡s estrictos gracias a la recuperaciÃƒÂ³n rÃƒÂ¡pida y automÃƒÂ¡tica del sistema que se ejecuta en sÃƒÂ³lo cuatro sencillos pasos.\nRecupere todo lo que necesite, en el momento y lugar en que lo necesite, incluidos archivos o carpetas individuales, o sistemas completos, en minutos.\nElimine la necesidad de tener que duplicar el hardware de reemplazo para fines de recuperaciÃƒÂ³n y ahorre los costos de hardware.\nRealice fÃƒÂ¡cilmente actualizaciones y migraciones de hardware.\nSimplifique la administraciÃƒÂ³n de TI administrando de forma centralizada las tareas de recuperaciÃƒÂ³n y copia de seguridad para varios servidores en toda la organizaciÃƒÂ³n con Symantec System Recovery Management Solution (incluida sin costo adicional).\n\nRequerimientos del Sistema\nSistemas operativos\n\nSistemas operativos Windows de 32 bits o de 64 bits:\nWindows Server 2003\nWindows Essential Business Server 2008 y 2011\nWindows Server 2008 SP1/SP2\nWindows Server 2008 R2 SP1\n\nProcesador\n\n233 MHz o superior, segÃƒÂºn lo requiera el sistema operativo\n\nRAM\nRequisitos de memoria por componente clave:\n\nAgente de Symantec System Recovery: 512 MB\nInterfaz de usuario de Symantec System Recovery y Navegador de puntos de recuperaciÃƒÂ³n: 512 MB\nSymantec System Recovery Disk: 1 GB como mÃƒÂ­nimo (dedicado)\nFunciÃƒÂ³n Symantec System Recovery LightsOut Restore: 1 GB\n\nEspacio disponible en el disco duro\n\nCuando instale el producto entero: hasta 430 MB, segÃƒÂºn el idioma del producto que instala.\nMicrosoft .NET Framework 2.0: 280 MB de espacio en el disco duro necesario para equipos de 32 bits, y 610 MB para equipos de 64 bits.\nPuntos de recuperaciÃƒÂ³n: espacio suficiente en el disco duro, en un disco duro local o en un servidor de red para puntos de recuperaciÃƒÂ³n de almacenamiento.\nFunciÃƒÂ³n Symantec System Recovery LightsOut Restore: 2 GB\n\n\ncentral-torrent.com\ncentral-torrent.com","torrent":{"xt":"urn:btih:52430af745a1669687615165a3441fc472541848","amp;dn":"Norton.Internet.Security.2012.OEM.Multilenguaje.Incl.Serial.And.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52430af745a1669687615165a3441fc472541848","infoHashBuffer":{"type":"Buffer","data":[82,67,10,247,69,161,102,150,135,97,81,101,163,68,31,196,114,84,24,72]},"announce":[],"urlList":[]}}