{"title":"Dave Waite &amp; Marianne Segal - Paper Flowers [1970] {2010 LP","uid":9527230,"size":476828183,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5294afd5f42c5f4a9fcff1f4a7c8ece6d544114b&amp;dn=Dave+Waite+%26amp%3B+Marianne+Segal+-+Paper+Flowers+%5B1970%5D+%7B2010+LP+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":null,"files":-1,"time":1390771174,"description":"eac secure cue log scans\n\n2010 - Media Arte / MA-0024 / (LP MINIATURE) / CD\n\nPrior to taking on a third member to form the folk-rock group Jade, Dave Waite and Marianne Segal performed as a folk duo in the late 1960s, as well as doing a fair amount of recording in studios, at home, and on the radio. None of that material was released at the time, but 22 such previously unissued tracks from 1967-1970 appear on this CD, most of them original compositions, and most of them by Segal (who also takes most of the lead vocals). As Jade's sole album was highly reminiscent of the Sandy Denny-era Fairport Convention, it should come as no surprise that much of the music on this CD is reminiscent of Denny's pre-Fairport folk recordings, though it's somewhat more pop-oriented and not as striking. At times it seems to be plowing ground somewhere between the early Sandy Denny and the less hip, more folk-pop sound of the Seekers, though to be honest, Segal's voice isn't as distinctive or moving as Denny's, or even as the Seekers' Judith Durham's. Judging from the change of both songwriting and vocal phrasing in some of the later tracks, such as &quot;All the Reasons&quot; and &quot;Rainbow,&quot; it seems like Segal might have been heavily influenced by early Joni Mitchell as well, at least after Mitchell's first recordings became available. Three 1969 studio tracks recorded for a possible Polydor single show the duo moving into more of a folk-pop-rock direction with the addition of bass, drums, and string and brass arrangements, though as it happened nothing was issued from those sessions. The body of work on this disc is not as developed as, and certainly more acoustic folk-oriented than, the recordings Waite and Segal would make as part of Jade. And, like Jade, it's not among the most original folk or folk-rock of the era. But it's pleasant period late-'60s British folk-pop, with extensive historical liner notes by Waite and Segal themselves. ","torrent":{"xt":"urn:btih:5294afd5f42c5f4a9fcff1f4a7c8ece6d544114b","amp;dn":"Dave+Waite+%26amp%3B+Marianne+Segal+-+Paper+Flowers+%5B1970%5D+%7B2010+LP+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5294afd5f42c5f4a9fcff1f4a7c8ece6d544114b","infoHashBuffer":{"type":"Buffer","data":[82,148,175,213,244,44,95,74,159,207,241,244,167,200,236,230,213,68,17,75]},"announce":[],"urlList":[]}}