{"title":"Wings.1927.LazerDisc.Rip.OOP.1st.feature.film.to.win.Academy.Awa","uid":4808634,"size":981658324,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5346fc3d72346cd3e4c7d6b77572e8f6036f1e6f&amp;dn=Wings.1927.LazerDisc.Rip.OOP.1st.feature.film.to.win.Academy.Awa&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"st2580smile","files":-1,"time":1238283219,"description":"Wings, the first feature film to win an Academy Award, tends to disappoint a little when seen today. Too much time is afforded the wheezy old plotline about two World War I aviators (Buddy Rogers, Richard Arlen) in love with the same woman (Jobyna Ralston), while the comedy relief of El Brendel is decidedly not to everyone's taste. But during the aerial &quot;dogfight&quot; sequences, the film is something else again: a grand-scale spectacular, the likes of which has never been duplicated, not even by more expensive efforts like Hell's Angels (1930) and The Blue Max (1965). Twenty-eight-year-old director William Wellman, himself a wartime aviator, was fortunate enough to have the full cooperation of the US War department at his disposal (even though his legendary temper nearly lost him that cooperation on more than one occasion!) Brilliantly handled though the aerial scenes may be, they are matched by the Earthbound combat sequences, including the now-famous shot of a long trench caving in on hundreds of unfortunate doughboys. The storyline is as follows: Jack Powell (Rogers) and David Armstrong ($owell) hate each other during basic training, grow to like each other, and fall out again while competing for the affections of Sylvia Lewis (Ralston). Mary Preston (Clara Bow) sacrifices her own nursing career to save a drunken Powell from disgrace, Powell goes on a rampage when he believes his pal Armstrong has been killed, inadvertently shoots down Armstrong while decimating the German air corps, and is finally reunited with the nurse. Wrapped up in nurse's garb throughout most of the film, the ebullient Clara Bow is permitted a sequence in which, disguised as a Parisian floozie while trying to rescue a revelling Rogers, she displays a great deal of epidermis. One of the film's chief claims to fame is its &quot;introduction&quot; of Gary Cooper (who'd actually been in films since the early 1920s), in a brief but crucial role as veteran flyer with a cheerily fatalistic attitude. When originally released, Wings included a sequence lensed in the wide-screen &quot;Magnascope&quot; process; even when seen &quot;flat&quot;, however, the film contains some of the best flying sequences ever captured on celluloid.\n\n139 min.\n\n\nCAST:\n\nClara Bow   \t- Mary Preston\nCharles &quot;Buddy&quot; Rogers  \t- John &quot;Jack&quot; Powell\nRichard Arlen  \t- David Armstrong\nJobyna Ralston  \t- Sylvia Lewis\nGary Cooper  \t- Cadet White\nEl Brendel  \t- Patrick O'Brien\nArlette Marchal  \t- Celeste\nRichard Tucker  \t- Air Commander\n&quot;Gunboat&quot; Smith  \t- Sergeant\nJulia Swayne Gordon  \t- David's mother\nGeorge Irving  \t- Mr. Powell\nHedda Hopper  \t- Mrs. Powell\nCharles Barton  \t- Doughboy Hit by Ambulance\nThomas Carrigan  \t\nNigel de Brulier  \t- Peasant\nDick Grace  \t- Aviator\nRoscoe Karns  \t- Lt. Cameron\nJames Pierce  \t- M.P.\nRod Rogers  \t- Aviator\nFrank Tomick  \t\nCarl von Hartmann  \t- German Officer\nHenry B. Walthall  \t- David's father\nGloria Wellman  \t- Peasant Child\nMargery Chapin Wellman  \t- Peasant Woman\nWilliam Wellman  \t- A Doughboy \n\n\nRipped from a mid 80s LaserDisc. Incredible quality from an analog source.\n\nIf interested I can torrent the full DVD version I have created.\n\nHope you enjoy this rare treat.","torrent":{"xt":"urn:btih:5346fc3d72346cd3e4c7d6b77572e8f6036f1e6f","amp;dn":"Wings.1927.LazerDisc.Rip.OOP.1st.feature.film.to.win.Academy.Awa","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5346fc3d72346cd3e4c7d6b77572e8f6036f1e6f","infoHashBuffer":{"type":"Buffer","data":[83,70,252,61,114,52,108,211,228,199,214,183,117,114,232,246,3,111,30,111]},"announce":[],"urlList":[]}}