{"title":"Teitur - Poetry and Airplanes [EAC+Log]","uid":7789496,"size":234269003,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:53ba1ed32cd403cb9b99d79f546144597a3b45aa&amp;dn=Teitur+-+Poetry+and+Airplanes+%5BEAC%2BLog%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sq3ak_","files":13,"time":1351979415,"description":"Look it up on jewtube, download it if you like it. Support the artist if you'd like to.\n\nWikipedia copypasta:\nAfter finding both a publishing deal and a record contract with Universal Records, the Faroe Islands awarded him its 2004 &quot;Businessman of the Year&quot; award. His first major album, Poetry &amp; Aeroplanes, released in 2003, was recorded in Los Angeles and Spain and featured a number of prominent studio musicians and the production of Rupert Hine. Within months of its debut, the record found a following among many of popular music's inner circle. Extensive touring in the US and Canada and rave reviews and industry/musician buzz led to opening slots on tours with Suzanne Vega, Glen Phillips, Aimee Mann, and John Mayer. John Mayer later described the album in his Esquire magazine article: &quot;it may be one of the best albums to come around in the last five years...Music like this is jet fuel on the fire of a broken heart. Even if you think the flame has died, there's at least one lyric that'll hit that last hot spot, and then you'll find yourself as fucked as you were the day you lied and said you never wanted to see her again. Enjoy.&quot;\n\nTeitur was featured on MTV's You Heard it First program. While not picked up by mainstream radio, several of the songs on Poetry &amp; Aeroplanes found airplay on major television and motion picture soundtracks, most recently in the 2006 films Aquamarine and My Super Ex-Girlfriend. Teitur continued to tour extensively in 20 plus countries, building a firm following and respect amongst media and the musician community, despite the lack of commercial marketing by Universal Records.","torrent":{"xt":"urn:btih:53ba1ed32cd403cb9b99d79f546144597a3b45aa","amp;dn":"Teitur+-+Poetry+and+Airplanes+%5BEAC%2BLog%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53ba1ed32cd403cb9b99d79f546144597a3b45aa","infoHashBuffer":{"type":"Buffer","data":[83,186,30,211,44,212,3,203,155,153,215,159,84,97,68,89,122,59,69,170]},"announce":[],"urlList":[]}}