{"title":"Pope Francis Interview - A Big Heart Open to God (epub,mobi)","uid":8942266,"size":630801,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:53c9f2d39c57d155295363f4aa8bab77f65b27c0&amp;dn=Pope+Francis+Interview+-+A+Big+Heart+Open+to+God+%28epub%2Cmobi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"pharmakate","files":5,"time":1379692047,"description":"This interview was published yesterday on the website for America magazine in the US (and on many other websites around the world in various languages). It's easily accessible to anyone, but the ebook in this torrent converts the text to epub and mobi formats for anyone who prefers to read it and preserve it in these formats.\n\nIt's about 10,000 words long; I've added nothing to and removed nothing from the interview as it appears on the website. Basic formatting such as italics, emphasized text, headings, and paragraph breaks are all retained.\n\nThe content of the interview is truly surprising -- The Guardian describes it this way:\n\n\nPope Francis has set out his desire to find a &quot;new balance&quot; in the Catholic church, calling for greater involvement of women in key decisions and a less condemnatory approach towards gay people, divorcees and women who have had an abortion.\n\nIn a wide-ranging interview with an Italian Jesuit journal, the Pope calls for the Catholic church, the world's largest Christian church with 1.2bn members, to face up to the need for reform. Offering a dramatic contrast to the traditional conservative approach of his predecessor, Benedict XVI, Francis says the first reform must be one of &quot;attitude&quot;, adding that unless a new balance is found, &quot;the moral edifice of the church is likely to fall like a house of cards&quot;.\n\n","torrent":{"xt":"urn:btih:53c9f2d39c57d155295363f4aa8bab77f65b27c0","amp;dn":"Pope+Francis+Interview+-+A+Big+Heart+Open+to+God+%28epub%2Cmobi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53c9f2d39c57d155295363f4aa8bab77f65b27c0","infoHashBuffer":{"type":"Buffer","data":[83,201,242,211,156,87,209,85,41,83,99,244,170,139,171,119,246,91,39,192]},"announce":[],"urlList":[]}}