{"title":"The Simpsons, the complete 19th season","uid":4195512,"size":3670515160,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:54f644610024861631758752063f85cc5a42b703&amp;dn=The+Simpsons%2C+the+complete+19th+season&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HenrikOK","files":20,"time":1211155616,"description":"The Simpsons, the complete 19th season.\n\nSeason 19, Episode 1: He Loves to Fly and He D\\&amp;#039;ohs\nOriginal Air Date: 23 September 2007\nHomer falls in love with private planes after taking a flight to Chicago with Mr. Burns. So Marge hires Homer a \\&quot;life manager\\&quot; to help him think positively and find a job that will allow him to fly for a living.\n\nSeason 19, Episode 2: Homer of Seville\nOriginal Air Date: 30 September 2007\nHomer becomes an opera star after an injury improves his singing voice. His newfound popularity forces him to hire a personal assistant, who turns out to be an obsessed stalker.\n\nSeason 19, Episode 3: Midnight Towboy\nOriginal Air Date: 7 October 2007\nHomer becomes the most hated man in town after he becomes a tow truck driver, and Marge teaches Maggie to not be an over-dependent baby.\n\nSeason 19, Episode 4: I Don\\&amp;#039;t Wanna Know Why the Caged Bird Sings\nOriginal Air Date: 14 October 2007\nMarge promises to visit a convicted bank robber in prison, but is afraid to follow through. But when the convict escapes from prison, Marge is the first person he pays a visit to.\n\nSeason 19, Episode 5: Treehouse of Horror XVIII\nOriginal Air Date: 4 November 2007\nThe eighteenth Simpsons Halloween Special features parodies of the movies \\&quot;E.T.\\&quot; and \\&quot;Mr. and Mrs. Smith.\\&quot;\n\nSeason 19, Episode 6: Little Orphan Millie\nOriginal Air Date: 11 November 2007\nMilhouse\\&amp;#039;s parents are lost at sea, which causes him to become a troubled loner. But his new persona makes him the new most popular kid at school, which sparks jealousy in Bart.\n\nSeason 19, Episode 7: Husbands and Knives\nOriginal Air Date: 18 November 2007\nWhen Marge becomes a successful businesswoman, Homer becomes worried that she will dump him for a trophy husband. Therefore, he decides to have plastic surgery to make himself look like a hunk.\n\nSeason 19, Episode 8: Funeral for a Fiend\nOriginal Air Date: 25 November 2007\nBart is responsible for Sideshow Bob\\&amp;#039;s death after his latest attempt at revenge is foiled, but is his death actually part of the plan?\n\nSeason 19, Episode 9: Eternal Moonshine of the Simpson Mind\nOriginal Air Date: 16 December 2007\nHomer goes to Dr. Frink to help him recover his memories from the night before, and he discovers, based on his interpretation of the memories, that Marge is having an affair.\n\nSeason 19, Episode 10: E Pluribus Wiggum\nOriginal Air Date: 6 January 2008\nSpringfield becomes the site of the first presidential primary. The townspeople soon get sick of all of the presidential candidates sucking up to them, and decide to support their own write-in candidate: Ralph Wiggum.\n\nSeason 19, Episode 11: That 90\\&amp;#039;s Show\nOriginal Air Date: 27 January 2008\nHomer and Marge tell the kids about their life in the early 1990s before they were born, when Marge was enrolled in Springfield College and Homer was the lead singer of a grunge rock band\n\nSeason 19, Episode 12: Love, Springfieldian Style\nOriginal Air Date: 17 February 2008\nA series of romantic Valentine\\&amp;#039;s Day parodies based on \\&quot;Bonnie and Clyde,\\&quot; \\&quot;Lady and the Tramp,\\&quot; and \\&quot;Sid and Nancy.\\&quot;\n\nSeason 19, Episode 13: The DeBarted\nOriginal Air Date: 2 March 2008\nThe new prankster in Bart\\&amp;#039;s fourth grade class actually turns out to be a mole brought in by Principal Skinner to infiltrate Bart\\&amp;#039;s inner circle. Homer falls in love with his loaner car after Marge wrecks their old one.\n\nSeason 19, Episode 14: Dial \\&amp;#039;N\\&amp;#039; for Nerder\nOriginal Air Date: 9 March 2008\nOne of Bart\\&amp;#039;s pranks results in Martin\\&amp;#039;s death, but Lisa doesn\\&amp;#039;t want him to confess because she would be considered an accomplice. Marge hires a television crew to find out if Homer is cheating on his diet.\n\nSeason 19, Episode 15: Smoke on the Daughter\nOriginal Air Date: 30 March 2008\nMarge has Lisa take up ballet, mainly to have Lisa live out her own childhood dreams. Lisa then succumbs to peer pressure from her ballet mates and takes up smoking. Meanwhile, Homer and Bart try to start their own beef jerky business.\n\nSeason 19, Episode 16: Papa Don\\&amp;#039;t Leech\nOriginal Air Date: 13 April 2008\nWhen the Simpsons discover that Lurleen Lumpkin is on the skids, Marge reluctantly agrees to take her in and help her find her deadbeat dad who abandoned her 30 years ago.\n\nSeason 19, Episode 17: Apocalypse Cow\nOriginal Air Date: 27 April 2008\nBart tries to save the cow he raised for his 4-H club from the slaughterhouse, and in the process winds up getting accidentally engaged to one of Cletus\\&amp;#039;s daughters.\n\nSeason 19, Episode 18: Any Given Sundance\nOriginal Air Date: 4 May 2008\nLisa\\&amp;#039;s documentary about her family is accepted into the Sundance Film Festival. However, her family gets upset with her when they discover that the film is far from flattering.\n\nSeason 19, Episode 19: Mona Leaves-a\nOriginal Air Date: 11 May 2008\nHomer\\&amp;#039;s mom dies, and as part of her will, she asks him to spread her ashes. However, her request turns out to be part of her final act of rebellion against the system.\n\nSeason 19, Episode 20: All About Lisa\nOriginal Air Date: 18 May 2008\nLisa outshines Krusty as his new assistant and steals the spotlight from him, earning her own TV show. Meanwhile, Homer and Bart spend some quality time together with their new coin collecting hobby.","torrent":{"xt":"urn:btih:54f644610024861631758752063f85cc5a42b703","amp;dn":"The+Simpsons%2C+the+complete+19th+season","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54f644610024861631758752063f85cc5a42b703","infoHashBuffer":{"type":"Buffer","data":[84,246,68,97,0,36,134,22,49,117,135,82,6,63,133,204,90,66,183,3]},"announce":[],"urlList":[]}}