{"title":"Big Punisher - Capital Punishment (1998) 320 vtwin88cube","uid":6688697,"size":179897509,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:554a0c87b851d944ee0c2e2148fd85b82cabc39e&amp;dn=Big+Punisher+-+Capital+Punishment+%281998%29+320+vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"vtwin88cube","files":-1,"time":1316500354,"description":"Big Punisher\nCapital Punishment (1998)\n\n\n\n\n\nThe first solo Latino rapper to go platinum, Big Punisher was also yet another member of the hip-hop community to fall victim to an early death -- though in his case, it was due to health problems, not violence. In contrast to his large frame, Big Pun was a surprisingly graceful and nimble rapper, delivering his often clever, tongue-twisting rhymes at a torrential pace. Big Pun was born Christopher Rios on November 10, 1971, and grew up in the South Bronx's Puerto Rican community. He endured a rough childhood in an unstable home, and moved out when he was 15, dropping out of high school around the same time. Still, he continued his education on his own, and became interested in rapping and breakdancing (he was a solid athlete during his teen years). In 1989, under the name Big Moon Dog, he and several friends formed a street-corner rap group called the Full a Clips Crew. He later changed his name to Big Punisher, after the Marvel Comics superhero, and caught his big break when he met and impressed fellow Bronx rapper Fat Joe in 1995. He guested on a couple of Fat Joe tracks, &quot;Fire Water&quot; (which also featured Raekwon) and &quot;Watch Out,&quot; and following an appearance on Funkmaster Flex's The Mix Tape, Vol. 1, quickly made a name for himself in the underground community. He guested prominently on the Beatnuts' &quot;Off the Books&quot; in 1997, and also worked with B Real and Flesh-N-Bone. Pun scored an underground hit of his own with &quot;I'm Not a Player&quot; in 1997, and also contributed &quot;You Ain't a Killer&quot; to the Soul in the Hole basketball documentary. With Fat Joe's help, he secured a deal with Loud Records.\n\n\n\n\nFormat:\t\t\tMp3\nBitrate:\t\t320 CBR\nContains:\t\tAlbum Art &amp; ID Tags\n\n\n\n\nBig Punisher's debut album, Capital Punishment, established him as one of the stronger New York natives working hardcore territory toward the end of the '90s. He's a terrific lyricist with microphone technique to spare, and actually rhymes faster than his clear influence, the Notorious B.I.G.. He's also quite versatile, aiming for the dance clubs, the ladies, the hip-hop purists, and the mean streets at varying points on the album, and connecting with all of them pretty well. Similarly, the production -- by a cast of many -- is tough and funky, paced by deep street beats, but remains accessible to audiences outside the hardcore faithful. The close cousins &quot;I'm Not a Player&quot; and &quot;Still Not a Player,&quot; the latter Big Pun's breakthrough hit, manage to be cocky and self-deprecating at the same time, and the other widely exposed track, &quot;You Ain't a Killer,&quot; is Big Pun at his grittiest. There are numerous guest appearances, the best of which include mentor Fat Joe (on several tracks), the Roots' Black Thought on the MC showcase &quot;Super Lyrical,&quot; Prodigy and Inspectah Deck on &quot;Tres Leches (Triboro Trilogy),&quot; and an extra-insane Busta Rhymes on &quot;Parental Discretion.&quot; Capital Punishment isn't quite a classic -- for one thing, it's too long, and for another, it doesn't really break much new ground stylistically. But it's very well-executed, and demonstrates just how much talent and potential Big Punisher had.\n\n\n\n\n\n\nAudio-Info:\n\n\n\n\n01. Intro\n02. Beware\n03. Super Lyrical\n04. Taster's Choice (Skit)\n05. Still Not A Player\n06. Intermission\n07. Dream Shatterer\n08. Punish Me\n09. Pakinamac Pt. 1 (Skit)\n10. You Ain't A Killer\n11. Pakinamac Pt. 2 (Skit)\n12. Caribbean Connection\n13. Glamour Life\n14. Capital Punishment\n15. Uncensored (Skit)\n16. I'm Not A Player\n17. Twinz (Deep Cover 98)\n18. The Rain And The Sun (Interlude)\n19. Boomerang\n20. You Came Up\n21. Tres Leches (Triboro Trilogy)\n22. Charlie Rock Shout (Skit)\n23. Fast Money\n24. Parental Discretion\n\n\n\n\n\n\n\n\n\n\n             ****Support The Artists &amp; Buy It If You Like It.****\n\n\n                 ****Enjoy &amp; Please Don't Forget To Seed!****\n\n\n\n\n","torrent":{"xt":"urn:btih:554a0c87b851d944ee0c2e2148fd85b82cabc39e","amp;dn":"Big+Punisher+-+Capital+Punishment+%281998%29+320+vtwin88cube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"554a0c87b851d944ee0c2e2148fd85b82cabc39e","infoHashBuffer":{"type":"Buffer","data":[85,74,12,135,184,81,217,68,238,12,46,33,72,253,133,184,44,171,195,158]},"announce":[],"urlList":[]}}