{"title":"Iron Maiden - The X Factor [Flac] TNT Village","uid":8708542,"size":468652298,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:55738a293e82bf77c0f7f90d9711ef0e0b9e00b0&amp;dn=Iron+Maiden+-+The+X+Factor+%5BFlac%5D+TNT+Village&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"l.diliberto","files":15,"time":1374186265,"description":"Iron Maiden - The X Factor [Flac] TNT Village\n\n.: Release Originale :.\n &lt;a href=&quot;\nhttp://forum.tntvillage.scambioetico.org/index.php?showtopic=237585&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.tntvillage.scambioetico.org/index.php?showtopic=237585&lt;/a&gt;\n\nAfter 1992's Fear of the Dark, an album that, for the last time for another eleven years, hit #2 in the UK, Iron Maiden vocalist Bruce Dickinson left the band he fronted for 11 years. Iron Maiden than began auditioning for new vocalists, both known and unknown. After listening to dozens of tryouts, the band finally selected Wolfsbane singer, Blaze Bailey. I find the changing of vocalists very welcoming, as I am not a fan of the raspy style of singing Bruce used on the previous to albums.\n\nWith Blaze, a new era began for the band. It was on the band's first Blaze Bailey album that they began writing what ended up being the precursor to their current day songs. The X Factor, the band's tenth release, featured songs unlike ever heard before on a Maiden record. These songs featured slow, quieter intros courtesy of Steve Harris bass lines, often with Blaze softly singing the first verse over them. The song then becomes heavier and faster resembling the traditional Iron Maiden sound, before the song fades out just as it began. Of course, The X Factor also features short, speedy songs such as Man on the Edge.\n\nThe brooding and melancholic music found on this album fits both Blaze's voice and the dark atmospheric lyrics that were written. Song subjects range from the inquisition in Sign of the Cross; to war in songs such as Fortunes of War, The Aftermath, and Blood on the Worlds Hands; to insanity in Man on the Edge, and The Edge of Darkness; as well as many other introspective subjects. Primary songwriter Steve Harris (who wrote or co-wrote 10 out of 11 songs) must have been going through a rough time during the writing of The X-Factor as the lyrics are darker and more negative than they have been on any release prior to The X Factor and since it was released.\n\nAn important part of the album is the often criticized Blaze Bailey himself. With his lower vocal range, he may not have been able too sing the old Iron Maiden classics as well as Bruce, his voice was perfect for the new release. His singing fits the melancholic feelings of The X Factor, and he sings with the needed emotion throughout the album. Blaze enhances the album's mood and atmosphere with his lower vocal register, bringing the depressing feelings of the songs to life. The band made an excellent choice picking their new frontman, given the direction the wanted to take. Blaze doesn't disappoint [me] and was very fun to listen to, especially on Sign of the Cross, where he sings &quot;They'll be saying their prayers when the moment comes/There'll be penance to pay when it's Judgment Day&quot; or his performance on The Edge of Darkness, one of the band's best songs from the Blaze era.\n\nDespite the more metallic feel slightly disappearing, guitarists Dave Murray and Janick Gers are still excellent in The X Factor. While I don't like the production on their guitars at all, they work with what they have and churn out some impressive riffs. Catchy, melodic riffs (especially when combined with Blaze's singing) make up for the lack of heaviness. Murray and Gers solo at the right times, adding speed and power to songs. Dave and Janick are best on the opening, 11 minute epic Sign of the Cross, where they spearhead the long instrumental that makes up almost half of the song.\n\nThe X Factor was a change for Iron Maiden, and a very important one at that. At over 70 minutes, this album paved the way for future albums of similar length, like Brave New World, Dance of Death, and their upcoming album A Matter of Life and Death. To this very day, the album remains one of the more unpopular Iron Maiden albums, along with Virtual XI. The X Factor is the kind album you either really love or really hate, as it doesn't feature the band's traditional sound. If I could recommend one album to get samples from before purchasing, it would be The X Factor, as it seems to have a mixed bag of supporters and haters. Personally, I really enjoyed The X Factor, its introspective lyrics, and Blaze's singing. That said, I would prefer the band refraining from recording an album similar to this one.\n\n.: Cover :.\n &lt;a href=&quot;\nhttp://biotechpunk.de/wp-content/uploads/2010/08/Iron-Maiden-The-X-Factor.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://biotechpunk.de/wp-content/uploads/2010/08/Iron-Maiden-The-X-Factor.jpg&lt;/a&gt;\n\n.: TrackList :.\n\n1. Sign of the Cross (Harris) - 11:18\n2. Lord of the Flies (Harris/Gers) - 5:05\n3. Man on the Edge (Bayley/Gers) - 4:14\n4. Fortunes of War (Harris) - 7:25\n5. Look for the Truth (Bayley/Gers/Harris) - 5:12\n6. The Aftermath (Harris/Bayley/Gers) - 6:19\n7. Judgement of Heaven (Harris) - 5:12\n8. Blood on the World's Hands (Harris) - 5:58\n9. The Edge of Darkness (Harris/Bayley/Gers) - 6:37\n10. 2 A.M. (Bayley/Gers/Harris) - 5:39\n11. The Unbeliever (Harris/Gers) - 8:02","torrent":{"xt":"urn:btih:55738a293e82bf77c0f7f90d9711ef0e0b9e00b0","amp;dn":"Iron+Maiden+-+The+X+Factor+%5BFlac%5D+TNT+Village","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"55738a293e82bf77c0f7f90d9711ef0e0b9e00b0","infoHashBuffer":{"type":"Buffer","data":[85,115,138,41,62,130,191,119,192,247,249,13,151,17,239,14,11,158,0,176]},"announce":[],"urlList":[]}}