{"title":"The Dan Band - I Wanna Rock You Hard This Christmas  (2nafish)","uid":5205175,"size":141633540,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:558d5a4e8941ea92ee107f1ac390f95c659a18cd&amp;dn=The+Dan+Band+-+I+Wanna+Rock+You+Hard+This+Christmas++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1260348562,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\nThe Dan Band is a comedy band from Los Angeles, California, created by actor/comedian Dan Finnerty. The band is well known for its covers of originally female-performed pop songs, with added obscenities and swearing. Their live show has become a staple of Los Angeles nightlife, with Entertainment Weekly naming it &quot;the hottest ticket in town.&quot; The band members are David Arana (keys), Marc Strommer (guitar), Einar Pedersen (bass), Dave Johnstone (drums) and back up guys Gene Reed &amp; John Kozeluh.\n\nDan has made notable appearances in the movies Old School (singing &quot;Total Eclipse of the Heart&quot;), The Terminal, Starsky &amp; Hutch, where he performed Roberta Flack's &quot;Feel Like Makin' Love&quot; at a Bat Mitzvah, and most recently The Hangover (performing Candy Shop and Fame) in a wedding scene reminiscent of his appearance in Old School. In 2005, they released The Dan Band Live, their live full length debut album. They gained attention due to their expletive-heavy version of Bonnie Tyler's &quot;Total Eclipse of the Heart,&quot; as well as their cover versions of &quot;Lady&quot; by Styx, &quot;Milkshake&quot; by Kelis, Toni Basil's &quot;Mickey,&quot; and many others.\n\nThey filmed a one hour concert special of their live show called Dan Finnerty &amp; The Dan Band: I Am Woman, for the Bravo network, which was directed by McG and executive produced by Steven Spielberg. The band released a Christmas LP called Ho: A Dan Band Xmas through Razor &amp; Tie Records. The album consists completely of original Dan Band songs, with no covers. Songs on the album include &quot;Ho, Ho, Ho&quot; (a smooth R&amp;B Christmas song about a prostitute) &quot;Merry Christmakwanzakah&quot;, &quot;Please Don't Bomb Nobody This Holiday&quot; and &quot;I Wanna Rock U Hard This Christmas&quot; with a video featuring Florence Henderson from The Brady Bunch making the moves on Santa at a retirement home. The video for &quot;Please Don't Bomb Nobody This Holiday&quot; featured many celebrity cameos, including Sheryl Crow, Christina Applegate, Nicole Scherzinger from The Pussycat Dolls, Kyle Gass from Tenacious D, Neil Patrick Harris, Meg Ryan, Macy Gray, Christopher Guest, among others. They've been the house band on The Ellen DeGeneres Show, Pajama Party and Spike TV's Spike Guys' Choice Awards 2009 and have made numerous appearances on Jimmy Kimmel Live!, The Late Late Show, CD USA, Last Call with Carson Daly, and Dan can currently be seen as a correspondent on The Jay Leno Show.\n\n\nSome lyrics in this video are censored.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:558d5a4e8941ea92ee107f1ac390f95c659a18cd","amp;dn":"The+Dan+Band+-+I+Wanna+Rock+You+Hard+This+Christmas++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"558d5a4e8941ea92ee107f1ac390f95c659a18cd","infoHashBuffer":{"type":"Buffer","data":[85,141,90,78,137,65,234,146,238,16,127,26,195,144,249,92,101,154,24,205]},"announce":[],"urlList":[]}}