{"title":"Zoner Mobile Security v1.3.0 APK (Android)","uid":12212662,"size":2336248,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:562fae472bc166a5a8ee5217a343d0e5bcab2680&amp;dn=Zoner+Mobile+Security+v1.3.0+APK+%28Android%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Pahly","files":1,"time":1439146927,"description":"Zoner AntiVirusÂ® is a modern security and anti-virus solution for your device. It provides protection against viruses, dialers, trojans, worms, spyware, adware and other malware as well as phone call and message protection. This product has been developed in Europe where many good AV products like AVG, Avast, ESET, Avira or Kaspersky come from.\n\nFeatures:\nAds detection\nBackup &amp; Restore - SMS and Call logs\nTheft Protection (find and control your missing device)\nInstalled app protection\nOn-access and on-demand scan\nPhone filtering (block calls and messages)\nParental lock for calls\nPermission viewer\nTask Manager\nAutomatic and manual database updates\nHome screen widget\nSecure messages\nYou can test the antivirus using applications containing the EICAR test file:\nZoner AntiVirus Test\nor EICAR Anti-virus Test\nor Antivirus TESTVIRUS\n\n\nAds detection provides you with notifications about installed apps that include ads. You can get rid of Airpush or Leadbolt push notifications easily.\n\nBackup SMS and Call logs and move them between your devices, upload to Google Drive, Dropbox, Gmail, etc.\n\nTheft Protection enables you to remotely control and locate your device via SMS messages. If you have lost it somewhere you can get a location or sound an alarm for people to notice it. If it has been stolen you will be notified when SIM is changed.\n\nApp protection checks all newly installed applications for malware. You can scan any old installed applications from the menu.\n\nOn-access protection scans any downloaded files and optionally the whole SD Card when plugged in.\n\nPhone filtering provides blocking of unwanted SMS/MMS and also protects you from malicious apps that call paid numbers. As a bonus it provides a parental lock for outgoing calls.\n\nSecure messages are encrypted messages that you can send via SMS, email,twitter, etc.\nZoner AntiVirus uses strong encryption to send selected messages in unreadable form. The recipient can read those messages only when he has the right key (password).\n\nWhat's in this version:\nZoner Cloud Scanner\nRequired Android O/S : 2.1+","torrent":{"xt":"urn:btih:562fae472bc166a5a8ee5217a343d0e5bcab2680","amp;dn":"Zoner+Mobile+Security+v1.3.0+APK+%28Android%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"562fae472bc166a5a8ee5217a343d0e5bcab2680","infoHashBuffer":{"type":"Buffer","data":[86,47,174,71,43,193,102,165,168,238,82,23,163,67,208,229,188,171,38,128]},"announce":[],"urlList":[]}}