{"title":"Avril Lavigne - Quinte Spirit Festival, Napanee 2001 (SHN files)","uid":11401909,"size":77086296,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:56b27c353782e375edba4e9fbea45432f7aeca5d&amp;dn=Avril+Lavigne+-+Quinte+Spirit+Festival%2C+Napanee+2001+%28SHN+files%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"thewaymouth","files":-1,"time":1415420740,"description":"Absolute Avril Beginners Pluck\n\nAvril Lavigne\n2001-06-23\nQuinte Spirit Festival\nConservation Park\nNapanee Waterfront, Ontario, Canada\n\nVG+ AUD\n\nNotes: Quinte Spirit Festival is a yearly fair for local talent, arts &amp; crafts. Avril was 16 at the time of this recording. Slightly less than one year later, her debut CD &quot;Let Go&quot; would drop.\n\nFrom avrilfan of avril-media.com: Here is the oldest Avril performance I have in good quality.\n\nSource: Portable CD Recorder\n\nSHN\n\n\nt01: Kiss Me *\nt02: No One Needs To Know &amp;\nt03: You Were Mine $\n\n* Originally by Sixpence None The Richer (1997)\n&amp; Originally by Shania Twain (1995)\n$ Originally by Dixie Chicks (1998)\n\n\nAvril is accompanied by a local country-pop band.\n\n\nMore on dear Avy after the shin bump.\n\n_____________________________________\n\n\nIn this guide to free hot stuff, we will look at playing files with an .SHN extension. These are compressed audio files (not lossy compression and therefore, much larger than MP3 for example). These files are still widely available online despite Shorten being outdated by newer formats such as FLAC. \n\n\nWinamp ---&gt; Download and Install Winamp. \nShnAmp ---&gt; This is a plug-in for Winamp to play Shorten audio files. Download it. \nWinRAR ---&gt; You will need WinRAR to extract the SHN plug-in. \n\n\nDownload all of the above. The installation of WinAMP is briefly covered below the details of Shorten. \n &lt;a href=&quot;\nhttp://www.afterdawn.com/guides/archive/how_to_play_shn_files.cfm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.afterdawn.com/guides/archive/how_to_play_shn_files.cfm&lt;/a&gt;\n\n_________________________________________________________________\n\n\n\nNapanee Mourns The Loss Of Babysitting Avril\n\n02 April 2003, Contact Music -- Pop sensation AVRIL LAVIGNE's success has upset at least one family in her native Napanee, Ontario - because she was such a great babysitter.\n\nThe SK8ER BOI singer made a fortune looking after youngsters because kids loved the lively teenager.\n\nSTEPHEN MEDD, who used to hire Avril to look after his kids, says, &quot;My kids say to this day that Avril was the best babysitter we ever had.\n\n&quot;She was always a joy to work with - she had a real positive spirit about her.&quot; \n\n_______________________________________________________________________________\n\n\n\nAvril Will Travel\n\n2014-11-07 @ The Pirate Bay around thewaymouth aka mikedreams on: A sweet audience recording - a down-hometown mini-set - pre-legend.\n\n\nNOVEMBER 7 \n\nTENSKATAWA Mystical Shawnee prophet, twin brother of Tecumseh, forged a pan-Indian united front against US aggression.\nFESTIVAL OF STOLEN FIRE. \nFEAST OF FREE PAMPHLETEERS\n\n.TALK STOOL.\n\nThis is an upfront grab of Av at a country fair. You just must savor this tiny taste of the soon to be pop-rockin hot, apple-pie of our eye.\n\n\nUnfortunately though there is some kid just not paying attention, and so gabs on in the background of a touching, &quot;Kiss Me.&quot; The audience then gets pretty quiet for the rest. During &quot;No One Needs To Know,&quot; am I dreaming or boy does she hit me hard in the heart. \n\n\nAvril is lovely and growing here. She could have been a great country singer. Maybe she will do a country album someday. She could be just the miss to pull modern country from the abyss. But then she could go on to sing anything she sets her head on and puts her voice to.\n\n\nSPOILER ALERT:\n\nMy favorite part though is when nervously and excitedly Avril talks to the crowd (before &quot;You Were Mine,&quot; which I'm guessing is actually the first number of the set).\n\n\n&quot;OK I don't usually sit in a stool but, for these songs I just kind of prefer to sit in a stool [laughs]. \n\n...OK I have a Dixie Chicks song called, 'You Were Mine.' And this is my first time singing this in public, so I'm kind of excited [laughs]. OK.&quot;\n\n\nThey don't call Avril Miss A Thousand Thrills for nothing","torrent":{"xt":"urn:btih:56b27c353782e375edba4e9fbea45432f7aeca5d","amp;dn":"Avril+Lavigne+-+Quinte+Spirit+Festival%2C+Napanee+2001+%28SHN+files%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56b27c353782e375edba4e9fbea45432f7aeca5d","infoHashBuffer":{"type":"Buffer","data":[86,178,124,53,55,130,227,117,237,186,78,159,190,164,84,50,247,174,202,93]},"announce":[],"urlList":[]}}