{"title":"The Atheist Experience: all shows of 2012 (795-846) (ogg)","uid":9407157,"size":1728850652,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:57cfe8b1a42987a94abd31d556af57a0c3a5b531&amp;dn=+The+Atheist+Experience%3A+all+shows+of+2012+%28795-846%29+%28ogg%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anessieist","files":-1,"time":1388191199,"description":"The Atheist Experience is a call-in show on Austin's public access TV. It airs on Sundays 22:30-23:30 UTC or 21:30-22:30 UTC during DST and is sponsored by the Atheist Community of Austin. Live stream at that time:   &lt;a href=&quot;\nhttp://www.ustream.tv/channel/the-atheist-experience&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.ustream.tv/channel/the-atheist-experience&lt;/a&gt; \n\nFind more information and other recordings on TAE's website:   &lt;a href=&quot;\nhttp://www.atheist-experience.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.atheist-experience.com/&lt;/a&gt; \n \n\nHere are the topics with better layout:   &lt;a href=&quot;\nhttp://www.atheist-experience.com/archive/?y=2013#table&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.atheist-experience.com/archive/?y=2013#table&lt;/a&gt; \n\nAll shows of 2010:   &lt;a href=&quot;\nhttps://thepiratebay.se/torrent/6149275/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.se/torrent/6149275/&lt;/a&gt; \nmagnet:?xt=urn:btih:9c3d9d13bc06135da19719840a3fa53671114b85  \n\nAll shows of 2011:   &lt;a href=&quot;\nhttps://thepiratebay.se/torrent/6941386/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.se/torrent/6941386/&lt;/a&gt; \nmagnet:?xt=urn:btih:27069e6ede98aac63c765995556e780fdb2dc456  \n\nAll shows of 2012: &lt;a href=&quot;\nhttps://thepiratebay.se/torrent/7983148/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.se/torrent/7983148/&lt;/a&gt;  \nmagnet:?xt=urn:btih:d673145f649ab4192a9c585e31a65e73c9110c12  \n\n\nAre you wondering why the download is so slow? If everyone kept their Bittorrent client running to contribute bandwidth, things would not be as bad.\nPlease, do not shut yours off to hit and run after the download is done, but keep seeding. Thank you. :-)\n\n\n== Show topics ==\n\nArgument from &quot;&quot;Making Sense&quot;&quot; Tracie identifies a type of argument that we hear that a claim &quot;&quot;just makes sense,&quot;&quot; and therefore must be true.  \nViewer Calls. Russell and Jeff take callers.    \nViewer Calls. Matt and Martin take viewer calls.    \nNothing New Under the Son. Don shows how none of the supernatural claims about Jesus were novel.    \nSocialization vs. Indoctrination. Tracie describes the difference between socialization and indoctrination.    \nThe Bible as Fan Fiction. Jenn looks at the Bible as just fan fiction.    \nResponding to a Viewer E-mail. Matt responds to a viewer e-mail.    \nViewer Calls. Matt and Jeff take callers.    \nGod's Absolute Morality. Don examines the failure of God's absolute morality.    \nViewer Calls. Russell and Tracie discuss some news items and take viewer calls.    \nMarriage Equality. Jenn and Matt discuss the DOMA/Prop 8 challenge before the Supreme Court.    \nViewer Calls. John and Matt take callers. This is John's first time in front of the camera. He's been a crew member for years.    \nMatt Goes to Church. Matt describes his latest visit to a local Austin church.    \nChristian Message Subtext. Don describes what he hears in the subtext of the Christian message.    \nAtheist Parenting. Jenn and Russell talk with Dale McGowan about atheist parenting.    \nImagined Childhood Powers. Tracie describes her imagined childhood powers and invited others to contribute theirs.    \nViewer Calls. In a rare pairing, Jeff and Martin take calls.    \nPeer Review. Russell talks about the peer review process and how it helps to benefit scientific knowledge.    \nWhat's Possible? Tracie shows how, even with some uncertainty, some things are known to be impossible.    \nThe Failure of TRUTH. Don talks about how various religions/sects claims of TRUTH are obvious falsehoods.    \nWestpoint Religious Graduation. Jen describes the experience of an atheist officer at his Westpoint graduation.    \nObjective Morality. Russell and Martin talk with atheist Dan Fincke about objective morality.    \nViewer Calls. Matt and Jeff take callers.    \nThe Failure of Faith. Don discusses how faith is a path to harm and why chuch-state separation is so important.    \nTreatment of Gays in Iraq. Russell gives some atheist news and Tracie reads a letter concerning treatment of gays in Iraq.    \nPolls about Non-Belief. Jenn describes a new poll about what people think about the rise of non-belief in the US.    \nViewer Calls. Matt and Martin take viewer calls.    \nThe Failure of Scripture. Don talks about founder Thomas Paine and how he nailed most of the problems with the Bible.    \nViewer Calls. Matt and Jeff take callers.    \nInterview with Rob Poole. Tracie interviews Rob Poole, Professor of Social Psychiatry, Bangor University, North Wales.    \nAd Hominem Attacks. Jenn clarifies what an ad hominem attack is and isn't.    \nViewer Calls. Russell and Martin take viewer calls.    \nChristian Extended Universe. Lynnea talks about how Christianity (as fiction) has extended the basic story in various directions.    \nGod's Mistakes. Don talks about the mistakes the god of the Bible makes.    \nIndoctrination. Tracie talks about how children get indoctrinated into Christianity and other religions and its harmful effects.    \nReligion and Depression. Dave Silverman pimps the American Atheist Conv. Jen examines a study correlating religious belief and depression.    \nViewer Calls. Russell and Lynnea take callers.    \nMatt Flies Solo. Matt flies solo and spends the episode taking viewer calls.    \nHeaven. Don and Matt discuss the lack of consistency in beliefs about heaven.    \nRob Poole Recap. Tracie talks more about religious trauma syndrome.    \nJohn's Path to Atheism. John talks about his path to atheism.    \nViewer Calls. Matt and Martin take viewer calls.    \nMessianic Jews &amp; Other Crazy News. Jen talks about Messianic Jews, exorcisms against same-sex marriage, and North Korean killings.    \nLies: Modern Propaganda. Don talks about how Christianity seemingly needs lies for successful marketing.    \nViewer Calls. Russell and Martin take viewer calls.    \nPolar Express. Tracie talks about religious messages in the Christmas movie &quot;&quot;Polar Express&quot;&quot;.   \nWar on Xmas. Matt and Jen talk about some news stories related to the &quot;&quot;war&quot;&quot; on Christmas.  \nThe Failure of Fraternity. Don responds to the Pope's &quot;&quot;day of peace&quot;&quot; message and its central theme of fraternity.  \n","torrent":{"xt":"urn:btih:57cfe8b1a42987a94abd31d556af57a0c3a5b531","amp;dn":"+The+Atheist+Experience%3A+all+shows+of+2012+%28795-846%29+%28ogg%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"57cfe8b1a42987a94abd31d556af57a0c3a5b531","infoHashBuffer":{"type":"Buffer","data":[87,207,232,177,164,41,135,169,74,189,49,213,86,175,87,160,195,165,181,49]},"announce":[],"urlList":[]}}