{"title":"Truth Through Proof: A Formalist Foundation for Mathematics","uid":8011454,"size":6678283,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:586ca2c8f0149923242f10339267f71c7b1141ee&amp;dn=Truth+Through+Proof%3A+A+Formalist+Foundation+for+Mathematics&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1358004070,"description":"Alan Weir - Truth Through Proof: A Formalist Foundation for Mathematics\nPublished: 2010-12-09 | ISBN: 0199541493 | DJVU | 256 pages | 6 MB\n\n\nTruth Through Proof defends an anti-platonist philosophy of mathematics derived from game formalism. Classic formalists claimed implausibly that mathematical utterances are truth-valueless moves in a game. Alan Weir aims to develop a more satisfactory successor to game formalism utilising a widely accepted, broadly neo-Fregean framework, in which the proposition expressed by an utterance is a function of both sense and background circumstance. This framework allows for sentences whose truth-conditions are not representational, which are made true or false by conditions residing in the circumstances of utterances but not transparently in the sense.\nApplications to projectivism and fiction pave the way for the claim that mathematical utterances are made true or false by the existence of concrete proofs or refutations, though these truth-making conditions form no part of their sense or informational content.\nThe position is compared with rivals, an account of the applicability of mathematics developed, and a new account of the nature of idealisation proffered in which it is argued that the finitistic limitations Godel placed on proofs are without rational justification. Finally a non-classical logical system is provided in which excluded middle fails, yet enough logical power remains to recapture the results of standard mathematics.","torrent":{"xt":"urn:btih:586ca2c8f0149923242f10339267f71c7b1141ee","amp;dn":"Truth+Through+Proof%3A+A+Formalist+Foundation+for+Mathematics","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"586ca2c8f0149923242f10339267f71c7b1141ee","infoHashBuffer":{"type":"Buffer","data":[88,108,162,200,240,20,153,35,36,47,16,51,146,103,247,28,123,17,65,238]},"announce":[],"urlList":[]}}