{"title":"Resident Evil The Umbrella Chronicles Wii","uid":8789181,"size":1171365843,"categoryP":"games","categoryS":"wii","magnet":"?xt=urn:btih:58a56617441ba9e6f59518592b87c62e6259de46&amp;dn=Resident+Evil+The+Umbrella+Chronicles+Wii&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"globeplus","files":-1,"time":1375897477,"description":"Hi and play this resident evil game ...\n\nFile Info : Videos ripped but with a folder with the most important videos of the game included and inside the game the player get the perception of the location of the videos,\nthis file have applications included that creates the iso or the wbfs files from the main game easily to manage, all necessary instructions included\n\nPlot\n\nThe Umbrella Chronicles encompasses several scenarios, which are based on various plot elements from the Resident Evil series. The game's first three scenarios, &quot;Train Derailment&quot;, &quot;The Mansion Incident&quot;, and &quot;Raccoon's Destruction&quot;, are set within Raccoon City, or its surrounding area, in 1998. The final scenario, which is based on new material, is set in Russia, taking place in 2003. The game features eight playable characters from previous Resident Evil games, including Rebecca Chambers, Billy Coen, Chris Redfield, Jill Valentine, Carlos Oliviera, Albert Wesker, Ada Wong and two others from Resident Evil 2.\n\nThe game's first scenario, based on the events of Resident Evil Zero, follows STARS operative Rebecca Chambers, and former Marine Billy Coen as they venture through a train that eventually takes them to a derelict training facility. Once within the facility, they discover they are being stalked by James Marcus, one of the Umbrella Corporation's co-founders and former scientists, who has managed to resurrect himself with the aid of leech test-subjects. After a confrontation, Marcus mutates into a monstrosity, but is subdued by the duo. Chambers and Coen escape as the facility self-destructs. Another sub-chapter within the scenario traces Wesker's actions, now posing as the leader of STARS' Alpha team, as he attempts to escape the training facility. This chapter also introduces Sergei Vladimir and one of his bodyguard Tyrants, codenamed &quot;IVAN&quot;.\n\nThe game then proceeds to retell the events of the first Resident Evil. The scenario follows Chris Redfield and Jill Valentine, as opposed to the actual Resident Evil game, which features the two splitting up. Redfield and Valentine are forced to battle their way through a mansion full of undead residents, before stumbling upon a secret Umbrella Corporation research facility in the mansion's basement. The two then discover the facility's most powerful creation, a Tyrant, and destroy it. The scenario features two different sub-chapters, which reveal Chambers' action between Resident Evil Zero and Resident Evil, as well as Wesker's reanimation and escape after his apparent death.\n\n\n\n* enjoy ...","torrent":{"xt":"urn:btih:58a56617441ba9e6f59518592b87c62e6259de46","amp;dn":"Resident+Evil+The+Umbrella+Chronicles+Wii","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58a56617441ba9e6f59518592b87c62e6259de46","infoHashBuffer":{"type":"Buffer","data":[88,165,102,23,68,27,169,230,245,149,24,89,43,135,198,46,98,89,222,70]},"announce":[],"urlList":[]}}