{"title":"Mercier-Invisible Contracts(law as legalized slavery)(1984)","uid":4586172,"size":1847873,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5aa428893ec3de666c4c0836522239d56518a5aa&amp;dn=Mercier-Invisible+Contracts%28law+as+legalized+slavery%29%281984%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"red_gonzo","files":1,"time":1229630362,"description":"This is George Mercier's monumental book Invisible Contracts (1984) which is probably the biggest expose of obvious and not so obvious (read: secret) contracts between Man and his Government that have throughout history put the whole humanity in endless legal bondage because of some written words on pieces of paper. Whenever there is an exchange of benefits and there remain some lingering expectations of some duty between two parties, then an actual INVISIBLE CONTRACT is in effect, as it is said that the duty owed back to the party initially transferring the benefits is RECIPROCAL in nature. Example #1: If you sell a business to someone you enter into a continuing restriction to not turn around and build up the same duplicate business that was just sold; this would be a Covenant [a binding agreement] Not to Compete - an invisible contract. Example #2: Bank account instruments are conclusive evidence of Taxpayer Status by virtue of participation in the closed private domain of INTERSTATE COMMERCE. One of the reasons why lawyers try and raise numerous subclassifications of Tort up to the main level of Tort and Contract, is because they do not see the invisible contracts that are often quietly in effect, correctly overruling Tort Law intervention, since an examination of the factual setting seems void of any contract. Life is filled with &quot;invisible contracts&quot; and is important to know and understand what they are and how they affect you in your life and your day-to-day business. By the end of this book, you will see many invisible contracts for what they really are, and you will see how to identify the indicia that create invisible contracts. Example by example it provides the actual explanation of those tricky words that are used in contracts only to confuse the profane and put a chain around your neck forever. Did you know that:\n- your birth certificate is actually a contract between your mother and the government (we are government property the moment we come out of the womb)\n- the US Constitution is essentially a renamed enactment of English Common Law\n- private agreements will always overrule the Constitution and the Bill of Rights\n- the reason why the Constitution does not apply is because the Judge is merely enforcing private agreements the defendant signed with the Secretary of the Treasury\nInvisible Contracts is extensively documented and extremely revealing book that proves beyond a shadow of a doubt that all this law bussiness was created only to enslave humanity. With this amazing masterpiece you now hold a powerful weapon against &quot;the law&quot;, a completely artificial system that should make us all more free and safe but is in reality an enormous apparatus of legalized slavery. As all this legal propaganda becomes transparent to your eyes you will all of a sudden begin to see the system of contracts as chains waiting to be hung around your neck. 270 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:5aa428893ec3de666c4c0836522239d56518a5aa","amp;dn":"Mercier-Invisible+Contracts%28law+as+legalized+slavery%29%281984%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5aa428893ec3de666c4c0836522239d56518a5aa","infoHashBuffer":{"type":"Buffer","data":[90,164,40,137,62,195,222,102,108,76,8,54,82,34,57,213,101,24,165,170]},"announce":[],"urlList":[]}}