{"title":"Greg Laswell...Landline(2012)[FLAC]","uid":7259828,"size":274568498,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5abad130bc833a10c0e5de1c9ee88d49b346a1a2&amp;dn=Greg+Laswell...Landline%282012%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":15,"time":1336689118,"description":"\n1. Come Back Down (feat. Sara Bareilles)\n2. I Might Drop By\n3. Another Life To Lose\n4. Eyes on You\n5. Back To You (feat. Elizabeth Ziman)\n6. Late Arriving\n7. Dragging You Around (feat. Sia)\n8. Nicely Played\n9. New Year's Eves\n10. It's Settled Now\n11. Landline (feat. Ingrid Michaelson)\n\nProducer, singer, songwriter Greg Laswell is proud to announce the release of his newest full-length LP, Landline, to be released April 24th on Vanguard Records. Landline is Laswell's first album since 2010's Take A Bow, and his fourth full-length. Laswell, a talented producer and musician in his own right, self-produced the record. For full album track listing, please see below.\n\nLandline's 11 new tracks were recorded by Laswell in a church-turned-house in a small lobstering town in down-east Maine. Laswell's nomadic tendencies caused him to relocate from Los Angeles to New York City, eventually ending up at the church-turned-house that is owned by his wife's parents. The album's title was inspired by the fact that the home-recording-studio had no cell-phone reception, forcing Laswell to use landlines for all of his calls.\n\nThe album features collaborations with a number of well-known female singers, including Ingrid Michaelson, Sia, Elizabeth Ziman (of Elizabeth and the Catapult) and Sara Bareilles (on the album's lead single 'Come Back Down.') Inspired by hip-hop records that he was listening to while writing and recording the album, Laswell decided he wanted to work with and feature female vocals alongside his own. Each singer brings a new element and personality to the songs, whether it's Bareilles' energy that caused Laswell to need to re-record his vocals, or the fact that he co-wrote the album's title track with Ingrid Michaelson when the power went out one night.\n\nLaswell's songs have won over several of film and television's top music supervisors, who have featured his songs in films such as Friends With Benefits and My Sister's Keeper, and television placements in the season premieres of CBS' NCIS and NBC's Parenthood, as well as ten individual placements on ABC's hit drama Grey's Anatomy.\n\ncd ripped by EAC\n\nplease seed\n &lt;a href=&quot;\nhttp://dickthespic.org/2012/01/11/ingrid-michaelson/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/2012/01/11/ingrid-michaelson/&lt;/a&gt;","torrent":{"xt":"urn:btih:5abad130bc833a10c0e5de1c9ee88d49b346a1a2","amp;dn":"Greg+Laswell...Landline%282012%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5abad130bc833a10c0e5de1c9ee88d49b346a1a2","infoHashBuffer":{"type":"Buffer","data":[90,186,209,48,188,131,58,16,192,229,222,28,158,232,141,73,179,70,161,162]},"announce":[],"urlList":[]}}