{"title":"Major League: Back to the Minors (1998)","uid":7738294,"size":842477133,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5b2f8404b5d799443cff861f7a0a8dfe43d51d4c&amp;dn=Major+League%3A+Back+to+the+Minors+%281998%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GzUs42o0","files":2,"time":1350543683,"description":"Aging minor league pitcher Gus Cantrell is planning to retire, but then Roger recruits Gus to be the manager of the South Carolina Buzz, the Twins AAA minor league team. Gus's mission is to make a real team out of a bunch of players who include ballet dancer turned ballplayer Lance &quot;Lance the Dance&quot; Pere, Frank &quot;Pops&quot; Morgan, Rube Baker, Taka Tanaka, Pedro Cerrano, Hog Ellis, home run hitter Billy &quot;Downtown&quot; Anderson, and Carlton &quot;Doc&quot; Windgate, who throws the slowest fastball in professional baseball. Gus ends up clashing with Leonard Huff, the snobby, arrogant manager of the twins. One night in Minnestoa, Gus and his girlfriend Maggie Reynolds are having dinner with Roger and Huff at an expensive-looking restaurant, where Huff challenges Gus to a game between the Buzz and the Twins, then Huff starts a fight with Gus, who accepts the challenge. The game is scheduled to take place at the Hubert H. Humphrey Metrodome in Minnesota. The Twins take a 3-0 lead in the 6th inning, but Billy hits a home run that ties the game at 3-3 in the 8th inning, but in the top of the 9th inning, with two outs, while the Twins are up to bat, and Doc is one strike away from striking out bullying home run hitter Carlos Liston, Huff has the stadium's lights turned off so the game can end with a tie rather than give the Buzz a chance to win in the bottom of the 9th, and the media says that the Twins were still outplayed by the Buzz. Huff now wants to bring Billy up to the Twins, even though Billy is not yet ready to go up to the Twins. Billy jumps on the opportunity and turns his back on Gus. Without Billy, the Buzz start losing again. With the Twins, Billy starts hitting poorly, proving Huff wrong about Billy. Gus manages to get the Buzz back on track, and Billy is sent back down to the Buzz, where Gus teaches Billy how to hit for a higher batting average. Gus leads the Buzz to a division title in their league, then Gus issues a challenge for Huff to bring the Twins to Buzz stadium for another game. The way Gus has issued the challenge, if the Twins win, he'll give his salary for the year to Huff, and if Gus and the Buzz beat the Twins, Gus can take over as the manager of the Twins. Huff accepts the challenge and takes the Twins to South Carolina to play against the Buzz. This time, the Buzz are determined to complete the game and beat the Twins","torrent":{"xt":"urn:btih:5b2f8404b5d799443cff861f7a0a8dfe43d51d4c","amp;dn":"Major+League%3A+Back+to+the+Minors+%281998%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b2f8404b5d799443cff861f7a0a8dfe43d51d4c","infoHashBuffer":{"type":"Buffer","data":[91,47,132,4,181,215,153,68,60,255,134,31,122,10,141,254,67,213,29,76]},"announce":[],"urlList":[]}}