{"title":"Snafu Book","uid":8388028,"size":35579074,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5bd25b03c2ee78f2d0cc6ba712790c7b0a0f27dd&amp;dn=Snafu+Book&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"jakestkr","files":3,"time":1366339661,"description":"SNAFU\n-----\n\nOriginally I had completed a 20 page book, with included text describing, explaining and commentating my art work. I had plans to publish the book myself. Due to a very sad set of unknown events, the original artwork has vanished without a trace. (most likely left on top of my car before a long drive home.) \n\nafter much deliberation, I finally decided to reincarnate the book, so far I have completed 1 page. The first rendition of &quot;Snafu&quot; was slowly realized through high school classes and community college courses and after work hours over the course of 8 years. yes, it took me 8 years to draw on 20 (21 if you include the cover page) pages of white printer paper. I have a vague memory of the most significant parts of the original book and have been adding similar elements to this work of art. \n\nIn an attempt to save, preserve and preempt any loss or destruction of the newer version of this book, I decided to scan the pages as i finish them and upload them to the greatest website in the world (sorry le chive, you ain't got shit on TPB!)\n\nI hope that you come across this work of mine, enjoy it, or find it intriguing and follow my progress! Currently I plan on uploading 1 page as a PDF (aka THIS torrent you are viewing now) and as i finish the 2nd page, I will upload a new torrent as a two page PDF of this page, as well as the yet to be completed page 2. \n\nIf you have suggestions on format, photo-correcting the scans, etc. etc. please feel free to leave some feedback in the comments.\n\nIf all goes well, by the time i finish the 20th page (and cover page) I will release a full blown PDF &quot;e-Book&quot; here on the pirate bay. I will then release the book on itunes (for to make stacks of bread yo.) and I will also create a kickstarter profile for the physical prints of the book. \n\ni appreciate and welcome any criticism and support as I embark on this journey!\n\nenjoy!\n\n(or talk shit, or whatever, its cool man)","torrent":{"xt":"urn:btih:5bd25b03c2ee78f2d0cc6ba712790c7b0a0f27dd","amp;dn":"Snafu+Book","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5bd25b03c2ee78f2d0cc6ba712790c7b0a0f27dd","infoHashBuffer":{"type":"Buffer","data":[91,210,91,3,194,238,120,242,208,204,107,167,18,121,12,123,10,15,39,221]},"announce":[],"urlList":[]}}