{"title":"Pillars of Eternity (Patch 2.6.0.12) (GOG)","uid":12684472,"size":89612967,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5c7723971a7ff60bde8ac975c6c05b1bf32780fd&amp;dn=Pillars+of+Eternity+%28Patch+2.6.0.12%29+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mercs215","files":2,"time":1446582841,"description":"Install instructions:\r\n- Run &quot;patch_pillars_of_eternity_2.6.0.12.exe&quot;\r\n- Play\r\nPLEASE REMEMBER TO SEED, MANY OTHERS WANT THIS! :)\r\nIf you like this game, support the developers and BUY IT!\r\n\r\nChange log:\r\nKnown Issues\r\nPumpkinhead mode has some problems if you use it on a non-human subraced Godlike. The pumpkin can be too high or too low for the head height.\r\nUI for soulbound weapons is overlapping on itself.\r\nConcelhaut's Crushing Doom can be overpowered when cast by the Visage of Concelhaut.\r\nSteam Controller\r\nPillars of Eternity now has support for the Steam controller. The official controller settings are now set as the default.\r\nThere is a suggested configuration that can be found on the templates that are accessed in Steam's big screen mode.\r\nNew key bindings have been added to support additional actions needed for the Steam controller control schemes.\r\nFighter Changes\r\nBase Deflection raised up by 5.\r\nKnockdown gets a 1.20 damage multiplier (no longer gets bonus Crush damage)\r\nDisciplined Barrage raised from +10 to +15 Accuracy\r\nArmored Grace has been scaled from -15% to -20% Armor Recovery Penalty\r\nClear Out base Crush damage increased from 10-16 to 15-22. Scales every 3 levels after 7 by 15%.\r\nInto the Fray's damage scales every 3 levels after 5 by 15%.\r\nMajor Fixes\r\nFixed an issue that was causing certain quests to take experience instead of granting it.\r\nFixed a problem with chanters not being able to set their chants properly after they have retrained.\r\nFixed an issue where retraining was allowing characters to obtain unlimited skill points.\r\nUsing store filters now only shows the appropriate items instead of graying out other items in the store panel.\r\nFixed multiple issues with the stronghold and how it interacted with DLC content.\r\nFixed an issue that caused the main character to lose his or her background shortly after character creation.\r\nParty/Companion AI\r\nCan now enable/disable AI on multiple non-pet characters at the same time.\r\nFixed issues where AI would not automatically attack enemies.\r\nFixed issues where AI would engage enemies that were hidden by fog of war.\r\nFixed an issue where AI casters would cast per-rest abilities despite the option being turned off.\r\nFixed an issue that caused AI controlled party members to attack other party members that were charmed or confused.\r\nReviewed and updated what spells/abilities are cast in AI profiles for multiple classes.\r\nMonsters/Enemies/NPCs\r\nMultiple enemy types have been given immunities to certain afflictions.\r\nThese enemy types have had their bestiary updated to reflect these immunities.\r\nFixed multiple issues regarding NPC reactivity after completing certain quests\r\nFixed multiple bugs regarding Enemies/NPCs detecting stealthed characters and how they react to stealthed characters that they detect.\r\nRebalanced requirements for full bestiary unlocks for certain enemies that were not unlocking on easy difficulty.\r\nAdded additional bestiary information for multiple enemy types.\r\nAbilities/Talents\r\nMinor Grimoire Imprint has had multiple fixes and now works as intended.\r\nFixed an issue with the Ranger's Stalker's Link ability adding too much accuracy in some situations.\r\nFixed an issue that caused certain buffs and abilities to persist after combat ended.\r\nSt. Ydwen's Redeemer's Revive the Fallen ability now works correctly.\r\nFixed an issue that allowed Chanters to choose an extra talent.\r\nFixed an issue where the debuff &quot;Bonded Grief&quot; would not be removed after reviving animal companions.\r\nQuests\r\nFixed an issue with The Siege of Cragholdt that kept the quest from progressing.\r\nFixed an issue with the Grey Sleeper questline that would cause it fail after completing it.\r\nFixed multiple issues with the &quot;Sacrificial Bloodlines&quot; quest.\r\nFixed an issue that would break game progression after talking to Maerwald.\r\nFixed an issue that didn't allow the player to complete the game after killing Thaos.\r\nAchievement\r\nFixed an issue with the Herald of the Old Flame achievement being awarded prematurely.\r\nFixed an issue that kept players from receiving White March Part 1 achievements.\r\nItems\r\nFixed an issue that caused enchants to be removed when a character retrained.\r\nFixed an issue that allowed Sentinel's Girdle to be equipped in a ring slot.\r\nFixed enchantment issues with Badgradr's Barricade.\r\nFixed an issue where the draining modification on weapons would disappear.\r\nFixed an issue that caused Sabra Marie to be mis-categorized.\r\nLocalization\r\nFixed multiple issues with Korean text","torrent":{"xt":"urn:btih:5c7723971a7ff60bde8ac975c6c05b1bf32780fd","amp;dn":"Pillars+of+Eternity+%28Patch+2.6.0.12%29+%28GOG%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c7723971a7ff60bde8ac975c6c05b1bf32780fd","infoHashBuffer":{"type":"Buffer","data":[92,119,35,151,26,127,246,11,222,138,201,117,198,192,91,27,243,39,128,253]},"announce":[],"urlList":[]}}