{"title":"Down to the Wire - Orr, David [Non-Fiction] Mobi/Epub/PDF_(K-Sle","uid":8597182,"size":2824361,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5c8fb495e5eea97c1e8e02e35987bbea0a398951&amp;dn=Down+to+the+Wire+-+Orr%2C+David+%5BNon-Fiction%5D+Mobi%2FEpub%2FPDF_%28K-Sle&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"K-Slender","files":5,"time":1371782852,"description":"&quot;The real fault line in American politics is not between liberals and conservatives.... It is, rather, in how we orient ourselves to the generations to come who will bear the consequences, for better and for worse, of our actions.&quot;\n\nSo writes David Orr in Down to the Wire, a sober and eloquent assessment of climate destabilization and an urgent call to action. Orr describes how political negligence, an economy based on the insatiable consumption of trivial goods, and a disdain for the well-being of future generations have brought us to the tipping point that biologist Edward O. Wilson calls &quot;the bottleneck.&quot; Due to our refusal to live within natural limits, we now face a long emergency of rising temperatures, rising sea-levels, and a host of other related problems that will increasingly undermine human civilization. Climate destabilization to which we are already committed will change everything, and to those betting on quick technological fixes or minor adjustments to the way we live now, Down to the Wire is a major wake-up call. But this is not a doomsday book. Orr offers a wide range of pragmatic, far-reaching proposals--some of which have already been adopted by the Obama administration--for how we might reconnect public policy with rigorous science, bring our economy into alignment with ecological realities, and begin to regard ourselves as planetary trustees for future generations. He offers inspiring real-life examples of people already responding to the major threat to our future.\n\nAn exacting analysis of where we are in terms of climate change, how we got here, and what we must now do, Down to the Wire is essential reading for those wanting to join in the Great Work of our generation. ","torrent":{"xt":"urn:btih:5c8fb495e5eea97c1e8e02e35987bbea0a398951","amp;dn":"Down+to+the+Wire+-+Orr%2C+David+%5BNon-Fiction%5D+Mobi%2FEpub%2FPDF_%28K-Sle","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c8fb495e5eea97c1e8e02e35987bbea0a398951","infoHashBuffer":{"type":"Buffer","data":[92,143,180,149,229,238,169,124,30,142,2,227,89,135,187,234,10,57,137,81]},"announce":[],"urlList":[]}}