{"title":"PFConfig Version 1.0.144.zip","uid":3745979,"size":2931957,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5e35c0dc6cadeed670f552c9dad29053990fd759&amp;dn=PFConfig+Version+1.0.144.zip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"enjoiDK","files":1,"time":1184784661,"description":"Automatically forward your ports with PFConfig. If you are trying to run an application that requires ports to be forwarded, you can skip the work and just use PFConfig. With PFConfig, you don&amp;#039;t have to learn how to setup your router. It&amp;#039;s so easy to use, you just pick the program from a list and say &amp;#039;Update Router&amp;#039;.\n \n\t  \t \nFeatures\n  \t \n  \tConfigures your routers port forwarding section for you\n  \tIncreases security by allowing you to forward ports when you need them, and stop forwarding them when you do not.\n  \tOptimizes the use of your routers available memory\n  \tElimitates the hassle of logging in to your router everytime you want to make a change to your port forwarding setup.\n \n  Automatically Forwards Ports    \t \nWhen you want to run an application that requires a port to be forwarded, with PFConfig all you have to do is select that application from the list and choose &quot;Forward this App&quot;. If you want to forward different apps to different computers, you simply put the other computers address in and we take care of the rest.\n  Optimized Use of Ports    \t \nWhen you use PFConfig, our advanced optimization routines will actually combine multiple applications into less entries in your router. You can frequently forward more applications than your router would otherwise support.\n  Huge Increases in Security    \t \nWhen you use PFConfig, it is incredibly easy to forward ports as you need them, and turn them off when you do not. Turning off your forwarded ports when not in use is a huge increase in security.\n  Never Login to your Router Again    \t \nWith PFConfig, you do not have to log in to your router to add and remove forwarded ports. Simply tell PFConfig which ports to forward and where to forward them, and the rest is taken care of for you. You can pretty much forget your routers password.\n  Check out the Tour    \t \nYou won&amp;#039;t believe how easy it is to use. Check out the tour here!\n  Fully Supported by PortForward.com    \t \nWhen you buy PFConfig, you are buying a dedicated support service who will help you get your ports forwarded. We have a support team here for you. If you are a PFConfig user and you need support, please go here.\n  What it doesn&amp;#039;t do    \t \n\n    * Please note that PFConfig does not configure your firewall, it only configures your port fowarding. You may still have to configure your firewall to get some applications to work.\n    * PFConfig only works with supported routers. We are adding routers to this list every day, so if your router is not supported yet, please check back soon.\n    * More info here\n","torrent":{"xt":"urn:btih:5e35c0dc6cadeed670f552c9dad29053990fd759","amp;dn":"PFConfig+Version+1.0.144.zip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e35c0dc6cadeed670f552c9dad29053990fd759","infoHashBuffer":{"type":"Buffer","data":[94,53,192,220,108,173,238,214,112,245,82,201,218,210,144,83,153,15,215,89]},"announce":[],"urlList":[]}}