{"title":"American Railroads (Train History).pdf","uid":13701306,"size":59308686,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5ef377e8a4c5bc0bce39e2917c48848b9697ef20&amp;dn=American+Railroads+%28Train+History%29.pdf&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STBGD","files":1,"time":1456779160,"description":"American Railroads\r\nUniversity of Chicago Press | 1997 | ISBN 0226776573 | Eng | 332 pag | PDF | 56.6 MB\r\n\r\nFew scenes capture the American experience so eloquently as that of a lonely train chugging across the vastness of the Great Plains, or snaking through tortuous high mountain passes. Although this vision was eclipsed for a time by the rise of air travel and trucking, railroads have enjoyed a rebirth in recent years as profitable freight carriers. A fascinating account of the rise, decline, and rebirth of railroads in the United States, John F. Stover's American Railroads traces their history from the first lines that helped eastern seaports capture western markets to today's newly revitalized industry. Stover describes the growth of the railroads' monopoly, with the consequent need for state and federal regulations; relates the vital part played by the railroads during the Civil War and the two World Wars; and charts the railroads' decline due to the advent of air travel and trucking during the 1950s. In two new chapters, Stover recounts the remarkable recovery of the railroads, along with other pivotal events of the industry's recent history. During the 1960s declining passenger traffic and excessive federal regulation led to the federally-financed creation of Amtrak to revive passenger service and Conrail to provide freight service on bankrupt northeastern railroads. The real savior for the railroads, though, proved to be the Staggers Rail Act of 1980, which brought prosperity to rail freight carriers by substantially deregulating the industry. By 1995, renewed railroad freight traffic had reached nearly twice its former peak in 1944. Bringing both a seasoned eye and new insights to bear on one of the most American of industries, Stover has produced the definitive history of railroads in the United States","torrent":{"xt":"urn:btih:5ef377e8a4c5bc0bce39e2917c48848b9697ef20","amp;dn":"American+Railroads+%28Train+History%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ef377e8a4c5bc0bce39e2917c48848b9697ef20","infoHashBuffer":{"type":"Buffer","data":[94,243,119,232,164,197,188,11,206,57,226,145,124,72,132,139,150,151,239,32]},"announce":[],"urlList":[]}}