{"title":"XCOM Enemy Unknown + Patch 1 (based on FLT/FLTDOX)","uid":7767738,"size":9103774384,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5f06716d5c66fddf0ab616a1980d48e959e14d5d&amp;dn=XCOM+Enemy+Unknown+%2B+Patch+1+%28based+on+FLT%2FFLTDOX%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"hclivess","files":7,"time":1351431316,"description":"XCOM Enemy Unknown with the Patch 1 included, a setup built on the releases by FLT/FLTDOX using InnoSetup. The files are split into the set of 6 files per 1,18 GB (3 files per DVD, the total of 2 DVDs with the setup compression).\n\nContents:\n\nsetup.exe\nsetup-1a.bin\nsetup-1b.bin\nsetup-1c.bin\nsetup-2a.bin\nsetup-2b.bin\nsetup-2c.bin\n\nRegards\n\n---\n\nXCOM: Enemy Unknown is a turn-based tactical role-playing strategy video game developed by Firaxis Games for publisher 2K Games, released on October 9, 2012, in North America and three days later on October 12 in Europe and Australia for Microsoft Windows, PlayStation 3 and Xbox 360. The game is a &quot;reimagined&quot; remake of the 1994 cult classic strategy game UFO: Enemy Unknown (also known as X-COM: UFO Defense). The game returns to the roots of the X-COM series, differentiating it from the previously announced shooter XCOM by 2K Marin.\nSet in the near future following an alien invasion of earth, XCOM: Enemy Unknown puts the player in control of an elite multinational military organization called XCOM (extraterrestrial combat), which is tasked with defending the Earth against the alien forces. The player commands troops in the field in a series of turn-based tactical missions; between missions, the player directs the research and development of new technologies from recovered alien technology and captured prisoners, expands XCOM's base of operations, manages XCOM's finances, and monitors and responds to alien activity.\nXCOM: Enemy Unknown was critically acclaimed, with averaged ratings of close to 90% for all versions at both GameRankings and Metacritic. Upon its release, it was often regarded as one of best titles in its genre. Several reviewers also commented on the game's very high levels of difficulty, replayability and addictiveness.","torrent":{"xt":"urn:btih:5f06716d5c66fddf0ab616a1980d48e959e14d5d","amp;dn":"XCOM+Enemy+Unknown+%2B+Patch+1+%28based+on+FLT%2FFLTDOX%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f06716d5c66fddf0ab616a1980d48e959e14d5d","infoHashBuffer":{"type":"Buffer","data":[95,6,113,109,92,102,253,223,10,182,22,161,152,13,72,233,89,225,77,93]},"announce":[],"urlList":[]}}