{"title":"Clinical Pharmacology by P.N Benett, M. J. Brown 10th Ed. (2008)","uid":11532987,"size":16354005,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6201180671885a957eb32eefa394ec657894dca2&amp;dn=Clinical+Pharmacology+by+P.N+Benett%2C+M.+J.+Brown+10th+Ed.+%282008%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1416592846,"description":"\nClinical Pharmacology by Bennett, Brown 10th Edition (2008)\n\n TRUE PDF, BOOKMARKED &amp; INDEXED\n\nAuthors :\nPeter Bennett\nMorris Brown\nPankaj Sharma\n\nImprint[/color]   : Churchill Livingstone\nPublisher[/color] : Elsevier\nLanguage[/color]  : English\nPages[/color]     : 616\nFormat            : pdf    \nReader Required   : Adobe Reader, Foxit, Nitro etc.\n\nA thorough knowledge of pharmacological and therapeutic principles is vital if \ndrugs are to be used safely and effectively for increasingly informed patients.\nThose who clearly understand how drugs get into the body, how they produce \ntheir effects, what happens to them in the body, and how evidence of their therapeutic effect is assessed, will choose drugs more skilfully, and use them \nmore safely and successfully than those who do not.Clinical Pharmacology is essential reading for undergraduate medical students, junior doctors and \nanyone concerned with evidence-based drug therapy.\n\nContents:\nSection 1 General. Clinical pharmacology. Topics in drug therapy. Discovery and development of drugs. Evaluation of drugs in humans. Official regulation of medicines. Classification of drugs and naming of drugs. \n\nSection 2 From Pharmacology to Toxicology. General pharmacology. Unwanted effects of drugs: adverse reactions. Poisoning, drug overdose, antidotes. Drug abuse. \n\nSection 3 Infection and Inflammation.. Chemotherapy of infections. Antibacterial drugs. Chemotherapy of bacterial infections. Viral, fungal, protozoal and helminthis infections. Drugs for inflammation and rheumatological disease. Drugs and the skin. \n\nSection 4 Nervous System. Pain and analgesics. Anaesthesia and neuromuscular block. Psycotropic drugs. Epilepsy, parkinsonism and allied conditions. \n\nSection 5 Cardiorespiratory and Renal Systems. Cholinergic and antimuscarinic (anticholinergic) mechanisms and drugs. Adrenergic mechanisms and drugs. Arterial hypertension, angina pectoris, myocardial infarction. Cardiac arrhythmia and \nheart failure. Hyperlipidaemias. Kidney and urinary tract. Respiratory system. \n\nSection 6 Blood and Neoplastic Disease. Drugs and haemostasis. Cellular disorders and anaemias. Neoplastic disease and immunosuppression. \n\nSection 7 Gastrointestinal System. Oesophagus, stomach and duodenum. Intestines. Liver, biliary tract and pancreas. \n\nSection 8 Endocrine System, Metabolic Conditions. Adrenal corticosteroids, antagonists, corticotrophin. Diabetes mellitus, insulin, oral antidiabetic agents, obesity. Thyroid hormones, antithyroid drugs. Hypothalmic, pituitary and sex hormones. Vitamins, calcium, bone. \n\n\n\n\nPls Seed As Long As Possible","torrent":{"xt":"urn:btih:6201180671885a957eb32eefa394ec657894dca2","amp;dn":"Clinical+Pharmacology+by+P.N+Benett%2C+M.+J.+Brown+10th+Ed.+%282008%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6201180671885a957eb32eefa394ec657894dca2","infoHashBuffer":{"type":"Buffer","data":[98,1,24,6,113,136,90,149,126,179,46,239,163,148,236,101,120,148,220,162]},"announce":[],"urlList":[]}}