{"title":"Windows Entertainment Pack for Packard Bell (WEPPB)","uid":3874750,"size":2105025,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:62597afb59a53761014fb62a4ed7d3fe2fee1876&amp;dn=Windows+Entertainment+Pack+for+Packard+Bell+%28WEPPB%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"preservedforposterity","files":14,"time":1194318620,"description":"Games : Windows : Full Game : English\nMicrosoft Entertainment Pack for Packard Bell (PfP)\nWindows Entertainment Pack for Packard Bell (WEPPB)\nA Preserved for Posterity Release\nNovember 5, 2007\n\nAs the name implies, Preserved for Posterity exists for the sole\npurpose of preserving the past, well into the future. When PfP began,\nwe weren&amp;#039;t too certain as to the best method of achieving this goal.\nAs a result, there are a few PfP releases floating around out there in\ncyberspace that should probably be deleted and forgotten due to their\nextreme inelegance and awful design. In fact, any PfP release prior to\nOctober 1, 2007 should be considered Recycle Bin fodder! Uninstall and\ndelete those old releases and keep an eye out for much improved\nreplacements - You will not be disappointed!\n\nOur intent is to locate old software, which is no longer available for\nsale (this is typically referred to as Abandonware, Orphanware, or\nsome other such moniker) and create new setups (installers) which\nallow these blasts from the past to function correctly on modern PC&amp;#039;s.\nTo achieve this, we make the best possible use of tools such as\nDOSBox, VDMSound and the ever present Windows Command Interpreter\n(when working with MS-DOS applications). Improved installers are\ncreated for older Windows based applications.\n\nThis release contains the original Entertainment Pack for Packard Bell.\nThe original setup (installer) for WEPPB, unlike the earliest\nEntertainment Packs for Windows, actually installs perfectly on later\nversions of Windows. We have, however, created a 32-bit installer for\nWEPPB, just as we have with Entertainment Packs 1-4. This installer\nshould be compatible with most 32-bit versions of Windows (untested on\nVista). Remember, this is 16-bit software, even though our installer is\n32-bit. This may prevent the software from being compatible with Vista,\nas we have heard that Vista doesn&amp;#039;t support legacy 16-bit sofware,\nhowever, we are at present unsure of this. We don&amp;#039;t currently use\nVista, and have no immediate plans to migrate to it. This software\nshould function with Windows 9x, ME, NT and XP without problems.\nEventually, we will support Vista. In fact, we could launch DOSBox\nwithin Vista, Install Windows for Workgroups 3.11 (or other 3.x\nWindows) into DOSBox and install the original Windows Entertainment\nPack for Packard Bell into that environment and it would work. We have\ntested this method with DOSBox on Windows XP and it works well and\nshould also work with Vista as DOSBox is a 32-bit application (this\nmethod is also possible within Linux using the Linux version of\nDOSBox). Just thought we would give you a few hints on using legacy\n16-bit Windows software with Vista and Linux, in case the use of\nDOSBox to run Windows 3.1 had not occurred to you.\n\nThis setup creates the following DIRectories (folders):\nMy Documents\\Inno Setup scripts\nMy Documents\\Disk Images\\Floppy\\1.44M\nProgram Files\\Microsoft Games\\WEPPB\n\nThe WEPPB folder is the folder where the Windows Entertainment Pack for\nPackard Bell is installed. The 1.44M folder exists as part of our goal\nof preserving the original software for posterity. Within the 1.44M\nfolder is a floppy diskette image of the original Windows Entertainment\nPack for Packard Bell that we have. It was created using WinImage\n8.10.8100 directly from the original floppy diskette, and requires\nWinImage or other diskette image tool for manipulation. The diskette\nimage is named WEPPB.imz. The Inno Setup scripts folder will contain\nthe script used to generate this installer via Jordan Russell&amp;#039;s\nInno Setup software. This installer has been designed to completely\nremove itself when uninstalled, with the exception of the Disk Images\nand Inno Setup scripts folders. These folders may be safely deleted at\nany time, should you have no need or desire for the diskette images of\nthe original 16-bit installer and/or setup scripts.\n\n\nThe following program group will be created:\nSTART&gt;PROGRAMS&gt;MICROSOFT GAMES&gt;WINDOWS ENTERTAINMENT PACK&gt;PB\nwhich will contain the following icons (games):\nChess\nDr. Black Jack\nFuji Golf\nJigSawed\nLife Genesis\nRattler Race\nRodent&amp;#039;s Revenge\nSkiFree\n\nWe are certain that it will probably annoy some people that we are\nincluding original disk images with these distributions. Other people\nwill be ecstatic. We would just like to say that in order to fulfill\nour goal, the diskette images MUST be included. Certainly, some may be\nannoyed that we are including the Paint and Reversi applications from\nWindows 1.01, Windows 2.03, Windows 3.0 and Windows 3.1. ToastyTech.com\nsucceeded in patching the Windows 1.01 and 2.03 applications so that\nthey would function with later versions of Windows. The Windows 3.x\napplications work with all later versions of Windows out of the box. We\ndecided it would be cool to include the Paint 1.01 and Reversi 1.01\nwith Entertainment Pack 1, Paint 2.03 and Reversi 2.03 with\nEntertainment Pack 2, Paint and Reversi from Windows 3.0 with\nEntertainment Pack 3 and Paint and Reversi from Windows 3.11 with\nEntertainment Pack 4 (Note: Reversi 3.11 was NOT included with Windows\n3.11, but was offered as a download from Microsoft, which is where we\ngot it). We have decided to include Solitaire from Windows 3.0 with\nWindows Entertainment Pack : Volume Three.\n\nInstall and Enjoy these classic games on your modern PC! Look for more\nPfP releases, with Entertainment Pack #4 following next.\n(Entertainment Packs 1-3 are already available, 4 is in the works.)\nPfP - November 5, 2007\n\nThe following information is from WikiPedia:\n\nMicrosoft Entertainment Pack\nFrom Wikipedia, the free encyclopedia\n\nDeveloper(s) Microsoft\nPublisher(s) Microsoft Game Studios\nDistributor(s) Microsoft\nDesigner(s) Robert Andrews\nSeries Entertainment Pack\nRelease date(s) 1990\nGenre(s)\nMode(s) Single-player\nPlatform(s) Windows 3.x\n\nThe original Microsoft Windows Entertainment Pack (WEP) was a\ncollection of simply-designed computer games for Windows. These games\nwere somewhat unusual for the time, in that they would not run under\nMS-DOS. Many of the games were later released in the Best of Windows\nEntertainment Pack. There were four Entertainment Packs in the original\nseries.\n\nList of games\nHere is a complete list of the original Microsoft Windows Entertainment Pack titles:\n* Chess\n* Chip&amp;#039;s Challenge\n* Cruel (a card game)\n* Dr. Black Jack\n* FreeCell (a card game)\n* Fuji Golf\n* Go Figure!\n* Golf (a card game)\n* IdleWild (a screensaver program)\n* JezzBall\n* Jigsawed\n* Klotski\n* Life Genesis (based on the Life simulation by John Horton Conway)\n* Maxwell&amp;#039;s Maniac\n* Pegged\n* Pipe Dream (by LucasArts)\n* Rattler Race\n* Rodent&amp;#039;s Revenge\n* SkiFree\n* Stones\n* Taipei\n* Tetravex\n* Tetris (Windows version)\n* Tic Tac Drop (basically a Connect Four clone)\n* TicTactics\n* TriPeaks (a card game)\n* Tut&amp;#039;s Tomb (a card game)\n* WordZap\n\nGameSampler\nA version of the Entertainment Pack called the Gamesampler, small\nenough to fit on a single high-density disk, was shipped as the 11th\ndisk in a ten-pack by Verbatim for much of the early 1990s, allowing\nmany users to acquire them as a freebie. Games on the sampler included\nJezzball, Rodent&amp;#039;s Revenge, Tetris, and Skifree. A &quot;Best of&quot; disk of\nseveral of the games was also available at times as a mail-in premium\nfrom Kellogg&amp;#039;s cereals.\n\n* Microsoft Entertainment Pack: The Puzzle Collection - a later\ncollection for Windows 95: &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Microsoft_Entertainment_Pack:_The_Puzzle_Collection&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Microsoft_Entertainment_Pack:_The_Puzzle_Collection&lt;/a&gt;\n* Microsoft Arcade &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Microsoft_Arcade&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Microsoft_Arcade&lt;/a&gt;\n* Best of Microsoft Entertainment Pack &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Best_of_Microsoft_Entertainment_Pack&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Best_of_Microsoft_Entertainment_Pack&lt;/a&gt;\n\n\nEntertainment Pack for Packard Bell (PfP) a.k.a. Windows Entertainment Pack PB (WEPPB)","torrent":{"xt":"urn:btih:62597afb59a53761014fb62a4ed7d3fe2fee1876","amp;dn":"Windows+Entertainment+Pack+for+Packard+Bell+%28WEPPB%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62597afb59a53761014fb62a4ed7d3fe2fee1876","infoHashBuffer":{"type":"Buffer","data":[98,89,122,251,89,165,55,97,1,79,182,42,78,215,211,254,47,238,24,118]},"announce":[],"urlList":[]}}