{"title":"George Orwell - All Art Is Propaganda: Critical Essays (2008)","uid":8428474,"size":426555,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:62be1b77c2751736da2fa80d4910ec9db5584a11&amp;dn=George+Orwell+-+All+Art+Is+Propaganda%3A+Critical+Essays+%282008%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"workerbee","files":-1,"time":1367423922,"description":"George Orwell - All Art is Propaganda: Critical Essays (Houghton Mifflin Harcourt, 2008).\n\nISBN: 9780156033077 | 416 pages | EPUB\n\nAs a critic, George Orwell (1903-1950) cast a wide net. Equally at home discussing Charles Dickens and Charlie Chaplin, he moved back and forth across the porous borders between essay and journalism, high art and low. A frequent commentator on literature, language, film, and drama throughout his career, Orwell turned increasingly to the critical essay in the 1940s, when his most important experiences were behind him and some of his most incisive writing lay ahead.\n\nAll Art Is Propaganda, compiled by George Packer and with an Introduction by Keith Gessen, follows Orwell as he demonstrates in piece after piece how intent analysis of a work or body of work gives rise to trenchant aesthetic and philosophical commentary. With masterpieces such as &quot;Politics and the English Language&quot;, &quot;Rudyard Kipling&quot; and &quot;Good Bad Books,&quot; here is an unrivaled education in, as George Packer puts it, &quot;how to be interesting, line after line.&quot;\n\nReviews\n\n&quot;Spanning the 1940s, this companion to Facing Unpleasant Facts: Narrative Essays showcases Orwell in an often unexpected cavalcade of observations on diverse subjects--in the literary field alone as varied as T. S. Eliot, Charles Dickens, Henry Miller, Graham Greene and Kipling. But since this is Orwell, the book takes on a range of subjects with gusto: power and bully worship and the deleterious influence of Catholicism on literature. Orwell's withering observations on professional academic criticism ('Politics and the English Language') are tempered by his sly 'Confessions of a Book Reviewer' (constantly inventing reactions towards books about which one has no spontaneous feelings whatever) and 'Good Bad Books' (the supreme example being Uncle Tom's Cabin). Not to be overlooked is a freewheeling take on the naughty postcards of Donald McGill. Overall, this collection highlights the work of a writer who always put his money where his mouth was, reiterating frequently the importance of clarity of expression in enabling independent thought.&quot; -- Publishers Weekly\n\n&quot;What is most astonishing about these essays are their continuing freshness and relevancy more than half a century after Orwell's death. All are worth reading for some combination of literary, historical, or cautionary merit. His criticism of art and politics (and sometimes both) remains spot-on, and the 'unpleasant facts' he considers, including war, poverty, homelessness, lack of adequate medical care, and even schoolboy bullying, are unfortunately still familiar topics. Orwell's crisp and clear journalistic writing style remains highly accessible to 21st-century readers, with the occasional, now obscure reference illuminated by Packer's notes.&quot; -- Alison M. Lewis, School Library Journal\n","torrent":{"xt":"urn:btih:62be1b77c2751736da2fa80d4910ec9db5584a11","amp;dn":"George+Orwell+-+All+Art+Is+Propaganda%3A+Critical+Essays+%282008%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62be1b77c2751736da2fa80d4910ec9db5584a11","infoHashBuffer":{"type":"Buffer","data":[98,190,27,119,194,117,23,54,218,47,168,13,73,16,236,157,181,88,74,17]},"announce":[],"urlList":[]}}