{"title":"War Inc (1997) - WIN-ALL","uid":8791996,"size":543697578,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6303d3633452a20f244674d9612177146f896c6e&amp;dn=War+Inc+%281997%29+-+WIN-ALL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"AN0NYMOUS142857","files":1,"time":1375974010,"description":"War Inc. is a real time strategy game, featuring tech research for components used to build your own combat units. Set in the future where private security forces have evolved into a corporate world police force, you run the company 'Granite'; one of the leading such mercenary corporations. The game includes a stock market, R&amp;D area, and weapons design interfaces. Build your army to your specification, and dominate the competition.\n\nGame features include:\n\nOffice view - access the stock market to buy and sell to make money while you are in-between missions.\n\nTechnology research interface - hire scientists to research components used to build you war machines. Categories include, power plant, armor types, weapons, and vehicle chassis.\n\n20 mission single player campaign, and multiplayer support over IPX.\n\nWar, Inc. is an innovative real-time strategy game that unfortunately ruins a lot of potential and a great stock market (!) module with lackluster gameplay, annoying bugs, and an unbalanced difficulty level. Featuring tech research for components used to build your own combat units. Strategy Plus (now CDmag.com) says it all in their succinct review:\n\n&quot;Yes, again. Whether caused by the rush to catch the end of a fiscal quarter, or by design specs that outstrip budgets, or for reasons too arcane for a mortal reviewer to grasp, it seems like the market is being flooded by games that &quot;missed it by THAT much.&quot; In this case, developer Optic used a two layered approach in an attempt to combine the real-time strategy (RTS) aspects of a Clone &amp; Conquer game (the &quot;inner&quot; game) with the economic strategy of running a business (the &quot;outer&quot; game). The business in question is a mercenary outfit, and it's a brilliant concept. Rather than swarm the enemy with units, you're always thinking of the bottom line. What are the minimal resources needed to accomplish the mission at hand, and thus maximize profit margins? It gives the game a real edge.\n\nAnother stroke of brilliance was allowing players to design their own units. In the outer game, you'll spend money on researching many new and wonderful technologies. But in order to use these, you'll have to design a blueprint of a unit incorporating them. Combine a hull with weapons, armor, shields, and so on, then spend a wad of cash on developing a prototype. Thereafter, in the RTS section of the game, your vehicle factories can churn this new unit out in droves.\n\nAs well as developing new units and technologies in the outer game, you'll also want to play the stock market. War is expensive, and while in theory you can get by on just the profits made by successful campaigns, life will be a lot easier if you're money is making money while you're waiting for that next contract. When the contract finally arrives, you'll get to the meat of the game. Rather than being dumped into the usual tactical RTS map, you'll find yourself on an area map showing the location of your headquarters as well as the objectives required for this campaign. You then drill down to the Headquarters tactical map, and start building a base.\n\nResources here consist of cash (you have access to all your liquid assets) and Resource Units (RUs), which are generated by mining ore. When you've built up your HQ infrastructure and sufficient forces, it's time to go after those objectives. By exiting the headquarters map, you'll return to the area map, move units into a task force and send them to an objective location. When they arrive, you'll once again drill down to a fairly typical RTS tactical map. Once you completed all objectives on the area map, the campaign ends and you'll get payment, plus reimbursement for the buildings and RUs you've left on the various maps and be returned to the outer game.\n\nThe devil, they say, is in the details, and it is in the details that War, Inc. falls down. From an installation routine that doesn't warn of insufficient drive capacity, to the lack of documentation, to the sometimes clumsy interface, this game would have strongly benefited from some focus-group testing. The stock market is either random or affected by forces not apparent, with the result that you'll probably save/invest/restore until you find a winning stock. In the RTS section of the game, unit AI is sometimes horrible, with units getting stuck behind trees, or sitting quietly while the enemy attacks, never attempting to defend themselves. Most frustrating is the way your team is whisked away from the field of battle as soon as you meet mission objectives. Leaving behind several million dollars worth of installations when you're strapped for cash can be very disheartening. It would've made for a much more user friendly experience if you were given some warning so that you could sell off unneeded buildings and recover the capital to use for the next objective.\n\nSo yes, it's happened again. The clever folks at Optic thought up a unique and exciting twist to the RTS genre, but somewhere along the way, things went slightly wrong. A patch is being discussed, which may go a long ways towards improving the game, but as always caveat emptor. The point being, if you work at it, War, Inc. can be great fun. But, in the densely populated world of Clone &amp; Conquer games, it may be easier to just move on to something else.&quot;\n\n1.Extract anywhere.\n2.Press &quot;START THE GAME&quot; batch file.\n3.Play.\n\nCompatible with WIN-ALL","torrent":{"xt":"urn:btih:6303d3633452a20f244674d9612177146f896c6e","amp;dn":"War+Inc+%281997%29+-+WIN-ALL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6303d3633452a20f244674d9612177146f896c6e","infoHashBuffer":{"type":"Buffer","data":[99,3,211,99,52,82,162,15,36,70,116,217,97,33,119,20,111,137,108,110]},"announce":[],"urlList":[]}}