{"title":"Encyclopedia of Folk Heroes - (Malestrom)","uid":4757429,"size":3283291,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6344a1b035a895e420f8777fc3ef7993a6b44554&amp;dn=Encyclopedia+of+Folk+Heroes+-+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"malestrom_HH","files":1,"time":1236531314,"description":" &lt;a href=&quot;http://www.image-upload.net/images/s9xtn3fda4p4qve99wh.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.image-upload.net/images/s9xtn3fda4p4qve99wh.jpeg&lt;/a&gt;\n\nEncyclopedia of Folk Heroes by Graham Seal\nPublisher: ABC-Clio Inc | ISBN: 1576072169 | edition 2001 | CHM | 347 pages \n\nGrade 9 Up-This volume describes folk heroes from all times and cultures, both individually and as groups (&quot;Magicians,&quot; &quot;Occupational Heroes,&quot; etc.). There are indexes by heroic type, country/culture, and a chronology of folk heroes by century, in addition to a general index and a detailed bibliography. Each entry includes cross-references and citations. Black-and-white illustrations are scattered throughout. Seal states up front that his book is selective; he emphasizes folklore and fairy tales, and doesn't include characters from mythology, scripture, or literature (although he does treat larger-than-life historical figures who've passed into folklore, such as Napoleon Bonaparte, George Washington, and a whole host of outlaws). Unfortunately, the book has flaws, most relating to the way the entries are written. They vary considerably in content. Some explain the background, some give a historical treatment, some analyze customs and traditions, while others delve into psychology. Some articles use quotes from scholars, rhymes, or songs. Some quickly summarize the stories, others includeretellings in excruciating detail. As a result, the entries are inconsistent in substance, length, and value. While this volume can be interesting and informative, it can also be puzzling and frustrating, depending on a subject's treatment.","torrent":{"xt":"urn:btih:6344a1b035a895e420f8777fc3ef7993a6b44554","amp;dn":"Encyclopedia+of+Folk+Heroes+-+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6344a1b035a895e420f8777fc3ef7993a6b44554","infoHashBuffer":{"type":"Buffer","data":[99,68,161,176,53,168,149,228,32,248,119,127,195,239,121,147,166,180,69,84]},"announce":[],"urlList":[]}}