{"title":"Kiss Tomorrow Goodbye (1950) Xvid 1cd - James Cagney, Ward Bond ","uid":11335350,"size":734228480,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:63f263dc117e728a5bf451dc527368179abfb4f8&amp;dn=Kiss+Tomorrow+Goodbye+%281950%29+Xvid+1cd+-+James+Cagney%2C+Ward+Bond+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SaM","files":-1,"time":1414723081,"description":"Kiss Tomorrow Goodbye (1950) Xvid 1cd - James Cagney, Ward Bond [DDR]\n\nKiss Tomorrow Goodbye is a 1950 film noir starring James Cagney, directed by Gordon Douglas, produced by William Cagney and based on the novel by Horace McCoy. \nThe film was banned in Ohio as &quot;a sordid, sadistic presentation of brutality and an extreme presentation of crime with explicit steps in commission.&quot;\nSupporting Cagney are Luther Adler as a crooked lawyer, Ward Bond and Barton MacLane as two crooked cops, and Cagney's brother William (who produced the film) as Ralph Cotter's brother.\n\n    CAST:-\n    James Cagney as Ralph Cotter\n    Barbara Payton as Holiday Carleton\n    Helena Carter as Margaret Dobson\n    Ward Bond as Insp. Charles Weber\n    Luther Adler as Keith 'Cherokee' Mandon\n    Barton MacLane as Lt. John Reece\n    Steve Brodie as Joe 'Jinx' Raynor\n    Rhys Williams as Vic Mason\n    Herbert Heyes as Ezra Dobson\n    John Litel as Police Chief Tolgate\n    William Frawley as Byers\n\nDirected by Gordon Douglas\nProduced by William Cagney\nScreenplay by Harry Brown\nMusic by Carmen Dragon\nRunning time 102 minutes\n\nMOVIE PLOT:- Kiss Tomorrow Goodbye (1950)\nRalph Cotter is a career criminal who escapes from prison, then murders his partner in crime. Along the way he attempts to woo his ex-partner's sister (Barbara Payton) by threatening to expose her role in his escape.\nCotter quickly gets back into the crime business, only to be shaken down by corrupt local cops.\n\nFrom the trial of the survivors, we flash back to amoral crook Ralph Cotter's violent prison break, assisted by Holiday Carleton, sister of another prisoner...who doesn't make it. Soon Ralph manipulates the grieving Holiday into his arms, and two crooked cops follow her into his pocket. Ralph's total lack of scruple brings him great success in a series of robberies. But his easy conquest of gullible heiress Margaret Dobson proves more dangerous to him than any crime... \n\nCRITICAL RESPONSE:-\nThe film, often compared unfavorably to White Heat, received mixed reviews. Fred Camper, film critic for The Chicago Reader, called the film mis-directed, writing, &quot;Gordon Douglas's direction is almost incoherent compared to Raoul Walsh's in White Heat (1949), which features Cagney in a similar role; the compositions and camera movements, while momentarily effective, have little relationship to each other, and the film reads a bit like an orchestra playing without a conductor.&quot;\n\nFilm critic Dennis Schwartz generally liked the film and wrote, &quot;This is an energetic straightforward crime drama based on the book by Horace McCoy (They Shoot Horses, Don't They?) and the screen play, which hardly makes sense and is the root of the film's problems, is by Harry Brown. Gordon M. Douglas (Come Fill the Cup/Only the Valiant) helms it by keeping it fast-paced, brutal and cynical, and lets star James Cagney pick up where he left off in the year earlier White Heat as an unsympathetic mad dog killer. This was an even tougher film, but the crowds didn't respond to it as favorably as they did to White Heat (which seems odd, since it's basically the same type of B-movie).&quot;\n\nTECHNICAL SPECIFICATIONS\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 940 kbps\nVideo Resolution: 640x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 23.976\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  1\nAudio Languages: English\nRunTime 102 mins\nSubtitles: NONE\nRipped by: Trinidad [DDR]","torrent":{"xt":"urn:btih:63f263dc117e728a5bf451dc527368179abfb4f8","amp;dn":"Kiss+Tomorrow+Goodbye+%281950%29+Xvid+1cd+-+James+Cagney%2C+Ward+Bond+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"63f263dc117e728a5bf451dc527368179abfb4f8","infoHashBuffer":{"type":"Buffer","data":[99,242,99,220,17,126,114,138,91,244,81,220,82,115,104,23,154,191,180,248]},"announce":[],"urlList":[]}}