{"title":"A Comprehensive Windows Tutorial","uid":7528116,"size":1113476,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:649900cdc5e8f7f8b4ad6f5092d5265d8aff03e1&amp;dn=A+Comprehensive+Windows+Tutorial&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Prairie_Dog","files":2,"time":1344855428,"description":"From the Author\n\nThis article is a tutorial attempt to provide an easier analysis of how windows work. I begin by looking at individual spectrum bins as affected by off-bin-centered tones with six different windows. I define and use the convolution theorem to explain why the windows do what they do. I review the sophisticated misunderstood fat-center-peaked, picket-fence-looking FFTs of various windows that come from adding zeros to increase resolution. I then use these drawings in a step-by-step graphical convolution to show how this or that window will affect the FFT of your data. This is a procedure to demonstrate how any oddly shaped, even graphically defined, window affects data. These techniques are tools to allow you to invent a graphical window to affect data in new ways. To demonstrate how to use graphically defined windows, I use digitized drawings of a Hawaiian mountain and the popular cartoon beagle as windows. To use these windows, I demonstrate FFT-IFFT interpolation and resampling, which in itself is interesting. Finally, I compare how eight windows affect the spectrum of typical vibration data.","torrent":{"xt":"urn:btih:649900cdc5e8f7f8b4ad6f5092d5265d8aff03e1","amp;dn":"A+Comprehensive+Windows+Tutorial","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"649900cdc5e8f7f8b4ad6f5092d5265d8aff03e1","infoHashBuffer":{"type":"Buffer","data":[100,153,0,205,197,232,247,248,180,173,111,80,146,213,38,93,138,255,3,225]},"announce":[],"urlList":[]}}