{"title":"Pernice Brothers - Live A Little [2006] [EAC,log,cue. FLAC]","uid":8754360,"size":284890419,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:65cb36c1659d1760f8abd8f81ef8b920d680e6cf&amp;dn=Pernice+Brothers+-+Live+A+Little+%5B2006%5D+%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"dickspic","files":14,"time":1375113384,"description":"Artist: Pernice Brothers\nRelease: Live A Little\nReleased: 2006\nLabel: Ashmont Records\nCatalog#: 010\nFormat: FLAC / Lossless / Log (100%) / Cue\n[color=blue]Country: USA\nStyle: Pop/Rock\n\n01 - Automaton\n02 - Somerville\n03 - Cruelty To Animals\n04 - Zero Refills\n05 - Microscopic Views\n06 - How Can I Compare\n07 - B.S. Johnson\n08 - PCH One\n09 - Conscience Clean (I Went To Spain)\n10 - Lighheaded\n11 - High As A Kite\n12 - Grudge F (2006)\n\nReview:\nJoe Pernice and his compatriots have taken one step forward and one step back on the fifth studio album from the Pernice Brothers, Live a Little, and both moves have served them well. Live a Little finds the band teaming up again with Michael Deming, the producer who worked with Joe Pernice during the latter days of the Scud Mountain Boys and was behind the board for Overcome by Happiness, the Pernice Brothers' debut. Live a Little lacks the gloss of Discover a Lovelier You or the harder surfaces of Yours, Mine &amp; Ours (both of which were produced by Thom Monahan), but it also feels considerably fuller and more mature than the quiet, tentative texture of the debut. Live a Little sounds more open and roomy than the past few Pernice Brothers efforts, while at the same time reflecting the lusher pop sound the band has embraced since 1998; a bit of the gingerbread has been stripped away, but the sound is still classic-style pop at its most delicious, buoyed by Deming's subtle string charts. And while there's a bit less of the &quot;sunshine pop for a cloudy day&quot; mood of their previous albums on Live a Little, Joe Pernice remains one of the finest songwriters at work today, and these 11 new songs (plus a remake of &quot;Grudge F***&quot; from the final Scud Mountain Boys album) find him in superb form -- the melodies are intelligent but hooky, with the touches of tart sophistication never getting in the way of their sweetness, and his lyrics walk a glorious tightrope between the classic adolescent obsessions of rock (i.e., girls) and the more troubling concerns of adulthood (i.e., women). And as usual, Joe's collaborators deliver the goods, especially Peyton Pinkerton on guitar and James Wallborne on keyboards, playing these songs with the passion and skill they richly deserve. No one in indie pop has consistently delivered such impressive results in the new millennium as Joe Pernice, and Live a Little makes it clear he isn't done making superb music anytime soon.","torrent":{"xt":"urn:btih:65cb36c1659d1760f8abd8f81ef8b920d680e6cf","amp;dn":"Pernice+Brothers+-+Live+A+Little+%5B2006%5D+%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"65cb36c1659d1760f8abd8f81ef8b920d680e6cf","infoHashBuffer":{"type":"Buffer","data":[101,203,54,193,101,157,23,96,248,171,216,248,30,248,185,32,214,128,230,207]},"announce":[],"urlList":[]}}