{"title":"Ichimoku Charts: An Introduction to Ichimoku Kinko Clouds","uid":9312444,"size":2431317,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:662aa7c7953ca0bcbba132989f6059b316077457&amp;dn=Ichimoku+Charts%3A+An+Introduction+to+Ichimoku+Kinko+Clouds&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"moneymakestheworldgoround","files":-1,"time":1386424531,"description":"ABOUT THE BOOK\nCandlesticks charts, although originating in Japan, now play an important role in technical analysis worldwide. Now, for the first time in English, this book presents the next stage of candlestick analysis - Ichimoku Kinko Hyo. Sometimes called Cloud Charts, this analysis adds moving averages to candlestick charts. But moving averages a little different from those traditionally used in the West. For trending markets, Cloud Charts add an essential tool for analysing near-term areas of support and resistance.The book covers the history of candlestick charts - explaining the context in which they developed. And then moves on to explain how in the 1930s a journalist, with the pseudonym Ichimoku Sanjin, started refining candlestick analysis by adding a series of moving averages. The book explains in detail how to construct Cloud Charts and how to interpret them. A chapter is devoted to the advanced analysis of Cloud charts, with an in-depth study of the Three Principles: Wave Principle, Price Target and Timespan Principle. The book is illustrated throughout with numerous examples of Cloud Chart analysis.Walk into any Japanese dealing room today and you will see that the most common charts being used are Ichimoku Kinko Clouds. This book presents the definitive explanation of these charts for the first time to a Western audience.","torrent":{"xt":"urn:btih:662aa7c7953ca0bcbba132989f6059b316077457","amp;dn":"Ichimoku+Charts%3A+An+Introduction+to+Ichimoku+Kinko+Clouds","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"662aa7c7953ca0bcbba132989f6059b316077457","infoHashBuffer":{"type":"Buffer","data":[102,42,167,199,149,60,160,188,187,161,50,152,159,96,89,179,22,7,116,87]},"announce":[],"urlList":[]}}