{"title":"Kings Bounty Crossworlds-SKIDROW","uid":5837238,"size":1545995560,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6689f46773ac5845f0f7369ab1037acd9ae96129&amp;dn=Kings+Bounty+Crossworlds-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MAFIAA.","files":33,"time":1284767877,"description":"RELEASE DATE : 17-09-2010              PROTECTION : Steam\nGAME TYPE    : RPG                    DISKS      : 1 DVD\n\nRelease Notes:\n\nThe Skid Rowdies are looking new blood to fill up the ranks.\nWe're a professional team of dedicated sceners with big mark\nunder sceners. We believe on the ground idealism of the root\nof the real old school scene. We do all this for fun and\nnothing else. We don't earn anything on our hobby, as we do\nthis for the competition and the heart of what got the scene\nstarted in the mid eighties.\n\nIf you think you got something to offer, then don't hold back\non contacting us as soon as possible.\n\n/\n/ / //          / / /  /\n/ / / / //      //// / / / / / /\n/      /      / / / // / /// /\n/// / //////\ntwice the fun  / double the trouble\n\nOn with the game release information:\n\nKing's Bounty: Crossworlds is the expansion for the famous\nKing's Bounty: Armored Princess role-playing game. The new\nrelease in the series will include the &quot;Orcs on the March&quot;\nexpansion, the two new independent campaigns &quot;Champion of the\nArena&quot; and &quot;Defender of the Crown&quot; and a convenient editor\nwith help system. This editor will allow you to create\nadditional content for the game and alter it in any way you\nwish.\n\nKing's Bounty: Crossworlds requires King's Bounty: Armored\nPrincess installed on your PC\n\n2 brand new campaigns (Champion of the Arena with boss battles\nin a gladiatorial tournament and Defender of the Crown with\nbattles in unique tactical arenas with a random selection of\nenemies and allies)\n\nOrcs on the March - extensive update to the original King's\nBounty: Armored Princess\n\nNew creatures to slay or use in combat\n\n70 new items, 8 new item sets, including one for the pet\ndragon and 3 component artifacts.\n\n7 new quests allow players to continue their journey\n\n50 new abilities and skills\n\n13 new spells\n\nGame Editor for King's Bounty: Armored Princess\n\nInstall Notes:\n\n1. Unpack release\n2. Mount image or burn it\n3. Install (require King's Bounty: Armored Princess installed)\n4. Copy the cracked content from the SKIDROW folder on the DVD\nto the main installation folder and overwrite\n5. Play the game\n\nAdditional Notes:\n\nSince this expansion expands the original King's Bounty:\nArmoured Princess, you'll need our previously release from\nlast year: Kings.Bounty.Armored.Princess-SKIDROW\n\nAlso keep in mind, that this expansion installs into the main\nfolder of King's Bounty: Armored Princess, so when the setup\nlocates that folder, it's no mistake.\n\nDon't blame your stupidity on our behalf, because if it does\nnot work for you, you're not installing into the right folder.\n\nSupport the companies, which software you actually enjoy","torrent":{"xt":"urn:btih:6689f46773ac5845f0f7369ab1037acd9ae96129","amp;dn":"Kings+Bounty+Crossworlds-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6689f46773ac5845f0f7369ab1037acd9ae96129","infoHashBuffer":{"type":"Buffer","data":[102,137,244,103,115,172,88,69,240,247,54,154,177,3,122,205,154,233,97,41]},"announce":[],"urlList":[]}}