{"title":"Straight Outta Compton (20th Anniversary Edition)(FLAC)","uid":4881597,"size":599444768,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6769b5ba99de991128135daff9a252c505c78351&amp;dn=Straight+Outta+Compton+%2820th+Anniversary+Edition%29%28FLAC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"paperplatesarethebest","files":-1,"time":1241412680,"description":"It has been 20 years since N.W.A rocketed Straight Outta Compton to double platinum success and worldwide acclaim and notoriety as rap music's most powerful force, redefining forever the trajectory of popular music. On December 4, Capitol/Priority will release an expanded 20th Anniversary Edition of the landmark album in CD, vinyl and digital formats. The commemorative release adds five bonus tracks, including a live version of &quot;Compton's N The House,&quot; covers of Straight Outta Compton tracks by Snoop Dogg and C-Murder, Bone Thugs-N-Harmony, Mack 10, and WC, and a new package essay by music writer and author Soren Baker.\n\n&quot;You are about to witness the strength of street knowledge...&quot;\n\nIn the course of little more than three years, N.W.A's Dr. Dre, Eazy-E, Ice Cube, MC Ren and Yella reached unprecedented gangsta superstardom with their no-holds-barred missives from Los Angeles' toughest streets. Defining the style that came to be known as &quot;gangsta rap,&quot; N.W.A propelled the genre into an expanded musical realm and topped the charts with their own challenging and illuminating style of rhymes unprecedented in their brutal reality over complex, funk-fueled tracks. &quot;The World's Most Dangerous Group&quot; spawned three of the most important figures in gangsta rap's evolution: the late rapper and entrepreneur Eazy-E, street lyricist extraordinaire Ice Cube\nand mega-producer Dr. Dre.\n\nN.W.A.'s first album, N.W.A and the Posse, was released in 1987, but it is 1988's Straight Outta Compton that has endured as the group's genre-defining masterpiece. From the propulsive groove of &quot;Express Yourself&quot; to the title track's battering statement of purpose, nothing had prepared listeners for this album's uncompromising power.\n\n&quot;The listening experience,&quot; Cheo Coker wrote in The Vibe History of Hip-Hop, &quot;was akin to being wired into a sensory camera, where you could smell the room, sense the bullets whizzing by your head, and feel your adrenaline pump as the police raced you around the block.&quot;\n\nAlong with Run-D.M.C.'s self-titled debut album and Public Enemy's\nIt Takes a Nation of Millions to Hold Us Back, N.W.A's Straight Outta Compton stands, 20 years after its incendiary debut, as one of the pivotal recordings in the history of popular music.\n\nN.W.A: Straight Outta Compton (20th Anniversary Edition) [CD, Vinyl, Digital]\n\n1. Straight Outta Compton\n2. F*ck Tha Police\n3. Gangsta Gangsta\n4. If It Ain't Ruff\n5. Parental Discretion Iz Advised\n6. 8 Ball (remix)\n7. Something Like That\n8. Express Yourself\n9. Compton's N The House (remix)\n10. I Ain't Tha 1\n11. Dopeman (remix)\n12. Quiet On Tha Set\n13. Something 2 Dance 2\n20th Anniversary Edition bonus tracks:\n14. F*ck Tha Police (Bone Thugs-N-Harmony)\n15. Gangsta Gangsta (Snoop Dogg/C-Murder)\n16. Dopeman (Mack 10)\n17. If It Ain't Ruff (WC)\n18. Compton's N The House (live) (Dr. Dre/M.C. Ren)\n\n\nThanks for http://www.hiphopreaction.com/news/Nwa-Straight-Outta-Compton-20th-Anniversary for the description","torrent":{"xt":"urn:btih:6769b5ba99de991128135daff9a252c505c78351","amp;dn":"Straight+Outta+Compton+%2820th+Anniversary+Edition%29%28FLAC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6769b5ba99de991128135daff9a252c505c78351","infoHashBuffer":{"type":"Buffer","data":[103,105,181,186,153,222,153,17,40,19,93,175,249,162,82,197,5,199,131,81]},"announce":[],"urlList":[]}}