{"title":"Rescue Roby HD v1.6","uid":8656565,"size":43184593,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:67764fbe04a59f1ac512577a1768be055f499e28&amp;dn=Rescue+Roby+HD+v1.6&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Androider","files":-1,"time":1373229754,"description":"\nRescue Roby is an exciting new physics-based puzzle game designed by Runaway Studios - the casual play division of the preeminent app developer, Intellijoy.\n\nRunaway Studios' mission is to create a new category of handcrafted artisanal game apps, complete with one-of-a-kind immersive narratives, stunning graphics and unique game mechanics designed to inspire mobile gamers all over the world.\n\nFeatures:\n\n- A brain-teasing puzzler, Rescue Roby offers a unique robot-themed narrative, stunning graphics, realistic physics, compelling characters, and addictive and diverse game mechanics that will provide hours of mobile gaming fun!\n- This challenging brain teaser comes complete with 4 dynamic chapters and 180+ play levels that pack a punch by getting harder as you advance.\n\nThe Story:\n\nRescue Roby will take you on a wild, fantastical ride. Quirky yet adorable, Roby fails the quality inspection because of his odd looks and eccentric behavior. Instead of being shipped to his new owners, Roby is condemned to the scrap metal bin.\n\nYour Mission:\nYour mission, should you choose to accept it, is to help Roby avoid his fate and escape the robot factory.\n\nThis task is not for the faint of heart, as you'll soon discover. Roby must either use or take abuse from moving conveyor belts, suspended scaffolding, exploding boxes and giant magnets that quickly attract all metal objects (including robots) into their magnetic field.\n\nEscape is just a crane ride away. Help Roby get into the box, and he'll get carried to the next level.\n\nOur Mission:\nStay tuned for new updates including: more addicting game zones, play mechanics, obstacles + challenges and more advanced play levels to extend your mobile fun.\n\nWhat's in this version:\n\n1.6\n- Heyzap achievements were added!\n1.5\n- 100 brand new levels were added!\nOnce you reach level 71 in the new Love Story chapter, you'll be helping Colonel Green meet Major Robashka!\n1.4\n- Added capability to import progress from the Free version\n- Bug fixes\n\nMore info:\n &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=com.missingames.rescueroby&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=com.missingames.rescueroby&lt;/a&gt;\n","torrent":{"xt":"urn:btih:67764fbe04a59f1ac512577a1768be055f499e28","amp;dn":"Rescue+Roby+HD+v1.6","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67764fbe04a59f1ac512577a1768be055f499e28","infoHashBuffer":{"type":"Buffer","data":[103,118,79,190,4,165,159,26,197,18,87,122,23,104,190,5,95,73,158,40]},"announce":[],"urlList":[]}}