{"title":"[Eric Luhta]How to Cheat in Maya 2010 Tools and Techniques for t","uid":11291830,"size":161427361,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:68345317ab2323fbe9dacea881142103eabb6f2e&amp;dn=%5BEric+Luhta%5DHow+to+Cheat+in+Maya+2010+Tools+and+Techniques+for+t&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zombie_rox","files":1,"time":1414342140,"description":"Take your animations to the next level with this essential guide to Maya 2010. Packed with character animation techniques and the secrets of professional animators, How to Cheat in Maya 2010 provides the tips and tools to help you create high quality animation in the most efficient way possible. This comprehensive guide to animating with Maya contains gold-mine coverage, including animation techniques, using Maya's tools with the 12 animation principles, working with constraints, and even foolproof lighting tricks to show off your work.\n\nWith this essential handbook, learn which circumstances call for which techniques, and how to get quality results fast. You will not only learn how to be productive in Maya, but also be given access under the hood to the actual scene files of a professional animator. Covering such topics such as pose to pose blocking, layered animation, fixing gimbal lock, facial animation, and much more, How to Cheat in Maya 2010 is an invaluable resource for artists and animators alike.\n\n-- See &quot;under the hood&quot; of a professional animator's workflow with beginning and ending scene files for every technique and workflow example in the book.\n\n--Complete, step-by-step walkthroughs of essential techniques every animator needs to know such as walk cycles, pose-to-pose blocking, lip syncing to dialogue, and much, much more.\n\n-- Proven &quot;How to Cheat&quot; series - Learn to create impressive, appealing animations using the fastest techniques possible, containing everything you need to know about Maya as a character animator.\n\n--Includes rarely discussed topics, such as reading spline curves, avoiding gimbal lock, animation layers, creating appealing lighting for demo reels, and features interviews with some of the most experienced animation leads and TDs working in the industry\n\n-- Learn to apply these professional techniques to your own animations with the accompanying DVD which includes all scene files to follow along with, as well as final versions to study in the Graph Editor\n\nPublisher: Focal Press; 1 edition (January 6, 2010)\nLanguage: English\nISBN-10: 0240811887\nISBN-13: 978-0240811888","torrent":{"xt":"urn:btih:68345317ab2323fbe9dacea881142103eabb6f2e","amp;dn":"%5BEric+Luhta%5DHow+to+Cheat+in+Maya+2010+Tools+and+Techniques+for+t","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68345317ab2323fbe9dacea881142103eabb6f2e","infoHashBuffer":{"type":"Buffer","data":[104,52,83,23,171,35,35,251,233,218,206,168,129,20,33,3,234,187,111,46]},"announce":[],"urlList":[]}}