{"title":"WWE Monday Night Raw HDTV 2016-07-25 720p AVCHD-SC-SDH","uid":15406523,"size":5985395207,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:684404420da6c82a7168b9cbce4b4a009570ef7c&amp;dn=WWE+Monday+Night+Raw+HDTV+2016-07-25+720p+AVCHD-SC-SDH&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":4,"uploader":"SCSA420","files":9,"time":1469512504,"description":"StoneCold420 presents another High Quality 720p H264 release for the wrestling fans around the world here exclusively on ThePirateBay!!! KickassTorrents is gone so until it returns TPB is it!!!\r\n\r\n\r\nWWE Monday Night Raw HDTV 2016-07-25 720p AVCHD-SC-SDH\r\n\r\n\r\nThe Raw Preshow is included this week.\r\n\r\n\r\nWWE Monday Night Raw\r\nEpisode # 1,209\r\nSeason 24 Episode 31\r\nCONSOL Energy Center\r\nPittsburgh, PA\r\nJuly 25, 2016\r\n\r\n\r\n\r\n\r\nFinn Balor\r\nvs\r\nRoman Reigns\r\n\r\n\r\nEnzo Amore and Big Cass\r\nvs\r\nThe Shining Stars\r\nPrimo and Epico\r\n\r\n\r\nBraun Strowman\r\nvs\r\nJames Ellsworth\r\n\r\n\r\nWWE Womens Championship title match\r\nSasha Banks\r\nvs\r\nCharlotte\r\n\r\n\r\nNeville \r\nvs \r\nCurtis Axel\r\n\r\n\r\nThe Club come to the ring\r\n\r\n\r\nThe New Day comes to the ring\r\n\r\n\r\nChris Jericho \r\nvs \r\nSheamus \r\nvs \r\nSami Zayn \r\nvs \r\nRoman Reigns\r\n\r\n\r\nNia Jax \r\nvs \r\nBritt Baker\r\n\r\n\r\nFinn Balor \r\nvs \r\nRusev \r\nvs \r\nKevin Owens \r\nvs \r\nCesaro\r\n\r\n\r\nStephanie and Mick Foley come to the ring\r\n\r\n\r\n\r\nMichael Cole, Corey Graves, Byron Saxton call the action\r\n\r\n\r\nScott Stanford, Lita, Jerry the King Lawler host the Preshow\r\n\r\n\r\n\r\nThis is SDH release #2,230 for the wrestling fans from a wrestling fan. First aired and captured from HDMI in H264 AVCHD at 8,000 kbps from the 16:9 widescreen 1280 x 720p resolution HD source on 07/25/2016 on the USA HD channel on Cox Digital HD cable. Framerate is 29.970 with an average Video Bitrate of 4,500 kbps in a High Quality 5.57 GB 720p H264 AVCHD MP4 release with 48khz 384 kbps AAC 2 channel stereo audio the Raw show runtime is 2:14:54 Part 1 is 1:09:32 and Part 2 is 1:05:21 the preshow is 28:12 \r\n\r\n\r\nThis is my 1,500th official 720p H264 AVCHD-SC-SDH release. Enjoy the Monday Night Raw show WWE fans. \r\n\r\nThis release is 4 parts because the size is more then 4 GB. Part 1 is 2.39 GB and Part 2 is 2.29 GB. The Preshow is 953 MB the postshow is 187 MB This release is in H264 AVCHD MP4 format with AAC 2 channel stereo audio. This release is playable with Sony Playstation 3, Playstation 4, Xbox 360, Xbox One, Samsung Galaxy S III, S4, S5, S6, S7 smartphones, iPhone, iPad, VLC player as well as Media Player Classic, Windows Media Player, and any other devices capable of playing 720p HD MP4 video files with AAC 2 channel stereo audio.\r\n\r\nIf you want this show in MKV format it is easy to convert it from MP4 to MKV using MKVtoolnix 2.2.0(MKVmerge 2.2.0) which you can download from here: http://www.bunkus.org/videot...2/mkvtoolnix-2.2.0-setup.exe\r\n\r\nHere's how to do it: Download and install MKVMerge (Use link above). It is a free program that allows you to take video and audio files and convert them into MKV files on the fly, making it a very quick conversion.\r\n\r\nOpen MKVMerge on your computer, and you will be greeted by its home menu. Click the &quot;Add&quot; button that is near the top of the program, and a new window will appear giving you access to your computer's files. Locate your MP4 video and select it. Press &quot;Open,&quot; and it will load into MKVMerge.\r\n\r\nPress the &quot;Browse&quot; button at the bottom of the program, and a window will appear. Locate a place on your computer to save the new MKV file after it is created. Once you have found a place, click &quot;Save&quot; to save the location. Click the &quot;Start Muxing&quot; button at the bottom of the program and your MKV file will be created. Depending on the size of the file, it could take a few minutes. Once it is finished locate the MKV file after the program congratulates you on the conversion and play it as you would any other video file.\r\n\r\nTo ensure that you can get proper playback be sure you have installed the K-lite codec pack full version or mega version both of which comes with Media Player Classic Home Cinema and configure it properly for .mp4 and .mkv playback. If you do not have it you can get it here below: \r\n \nhttp://www.free-codecs.com/download/K_Lite_Codec_Pack.htm \r\n\r\nOnce installed you can playback any .mp4 and .mkv files with the following players:\r\n\r\nMedia Player Classic or Windows Media Player. \r\n\r\nEnjoy the WWE Monday Night Raw show wrestling fans and thanks for downloading my WWE Monday Night Raw HDTV 2016-07-25 720p AVCHD-SC-SDH release. \r\n\r\n\r\nUploaded by SCSA420 on The Pirate Bay\r\n\r\n\r\nStoneCold420 \r\nSmackDownHotel\r\nJuly 25, 2016\r\n\r\n\r\n@SCSA420 on Twitter\r\n\r\n\r\nFor SC-SDH releases find me on The Pirate Bay at: https://thepiratebay.org/user/SCSA420  \r\nuntil KAT makes a return.\r\n\r\n\r\nPlease check out the WrestleReaction show on https://WrestleReaction.net","torrent":{"xt":"urn:btih:684404420da6c82a7168b9cbce4b4a009570ef7c","amp;dn":"WWE+Monday+Night+Raw+HDTV+2016-07-25+720p+AVCHD-SC-SDH","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"684404420da6c82a7168b9cbce4b4a009570ef7c","infoHashBuffer":{"type":"Buffer","data":[104,68,4,66,13,166,200,42,113,104,185,203,206,75,74,0,149,112,239,124]},"announce":[],"urlList":[]}}