{"title":"French Poilu 1914-18","uid":11828663,"size":33060491,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6a26fa26c517c46e7f4d6257e20c654c248a2c04&amp;dn=French+Poilu+1914-18&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1429564315,"description":"'Why,' the Kaiser enquired of Czar Nicholas in 1913, did he wish to ally himself with France when 'the Frenchman is no longer capable of being a soldier?' Indeed, during World War I (1914-1918) the French Army was in a state of disarray, plagued by indiscipline, mutinies and desertion. The ordinary French citizens that were called upon to defend their motherland, the Poilu, were disrespected and demoralized, and the infamous mutinies of 1917 by the Poilu were not protests against the war itself, but against how the war was conducted. The rebellions sent a stark warning, forcing a reform in the management of the war. Consequently, the performance of many French regiments improved and the Poilu went on to become the only European troops to fight the entire war within their own borders. Ian Sumner expertly charts the history of the Poilu, from the conscription of hundreds of thousands of men, through their training, to the horrors of the trenches and the fear of no-man's land, providing a fascinating insight into the events that led to the 1917 revolts. New artwork and diagrams illustrate the experiences of the soldiers as the comforts of civilian life were stripped away from them and the trenches became their homes","torrent":{"xt":"urn:btih:6a26fa26c517c46e7f4d6257e20c654c248a2c04","amp;dn":"French+Poilu+1914-18","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a26fa26c517c46e7f4d6257e20c654c248a2c04","infoHashBuffer":{"type":"Buffer","data":[106,38,250,38,197,23,196,110,127,77,98,87,226,12,101,76,36,138,44,4]},"announce":[],"urlList":[]}}