{"title":"Soldier's Girl (2003)","uid":4350394,"size":4681213952,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:6a6c2a3efb481668686923611c8b49fa827d89c7&amp;dn=Soldier%5C%27s+Girl+%282003%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"EvilTSAngel","files":1,"time":1219114174,"description":"Enjoy and Seed!\nEvilTSAngel Original DVDRip! \nNTSC .ISO IMAGE FILE.\n\nTheatrical Release Information  |  See Details About All Versions\nA group of soldiers in the deep South take vengeance against one of their own when word circulates that he&amp;#039;s become involved with a transgendered nightclub performer in this drama based on a true story. Barry Winchell (Troy Garity) was a young man with an educational disability who volunteered for the United States Army and found himself stationed in Tennessee, where he soon struck up a friendship with Justin Fisher (Shawn Hatosy), a high-strung fellow GI with a drug problem. One night with nothing to do, Winchell and Fisher tagged along with a group of soldiers who ended up taking in a drag show at a bar in Nashville. One of the performers on the bill that night was Calpernia Addams (Lee Pace), a transsexual and former combat medic in the Navy who was a veteran of the Gulf War before taking the first steps towards sexual reassignment. While Winchell, who was straight, was aware that Addams was at least partially still male, he found himself attracted to her for her intelligence and sensitivity, while she found herself similarly drawn to him. As Winchell and Addams&amp;#039; mutual attraction grew into a romance, the unstable Fisher found himself increasingly confused and angry with Winchell, and he struck back by spreading rumors that one of the men in their company was gay, with fingers soon pointing towards Winchell. Despite the Army&amp;#039;s &quot;Don&amp;#039;t Ask, Don&amp;#039;t Tell&quot; policy, the company&amp;#039;s drill sergeant (Barclay Hope) took it upon himself to find and remove the gay soldier in his ranks, while the increasingly vicious Fisher aligned himself with Calvin Glover (Philip Eddolls), a young and narrow minded recruit eager to strike out with violence against those different from himself. Directed by veteran filmmaker Frank Pierson, Soldier&amp;#039;s Girl premiered at the 2003 Sundance Film Festival. ~ Mark Deming, All Movie Guide\n\nWarning: This product is intended for mature audiences only. It may contain violence, sexual content, drug abuse and/or strong language. You must be 17 or older to purchase it. By ordering this item you are certifying that you are at least 17 years of age.\n\n\nTheatrical Feature Running Time: 112 mins \nComplete Cast:\nTroy Garity - Pvt. Barry Winchell\nAndre Braugher - Sgt. Carlos Diaz\nPhilip Eddolls - Calvin Glover\nDaniel Petronijevic\nJeanie Calleja\nTulsi Balram\nLee Pace - Calpernia Addams\nShawn Hatosy - Justin Fisher\nMerwin Mondesir\nMike Realba\nBarclay Hope\n\n\nDirector(s):Frank Pierson\nWriter(s):Ron Nyswaner\nProducer(s):Linda Gottlieb, Doro Bachrach\nTheatrical MPAA Rating: R(Violence, Profanity, Sexual Situations)\nCategories:Drama\n\nFormat: DVD\nRelease Date: 01/27/2004\nMPAA Rating: R\nRunning Time: 112 min\nNumber of Discs: 1\nLanguage: Eng/Spa\n  Closed Caption \n","torrent":{"xt":"urn:btih:6a6c2a3efb481668686923611c8b49fa827d89c7","amp;dn":"Soldier%5C%27s+Girl+%282003%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a6c2a3efb481668686923611c8b49fa827d89c7","infoHashBuffer":{"type":"Buffer","data":[106,108,42,62,251,72,22,104,104,105,35,97,28,139,73,250,130,125,137,199]},"announce":[],"urlList":[]}}