{"title":"Resident Evil Revelations-=AviaRa=-","uid":8499381,"size":8755781467,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6ad3976317837bf2244c90015a8792a7caee0274&amp;dn=Resident+Evil+Revelations-%3DAviaRa%3D-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"aviara","files":-1,"time":1369253727,"description":"Game information:\n=================\n\nResident Evil Revelations returns redefined  for  PC  complete  with  high\nquality HD visuals, enhanced  lighting  effects  and  an  immersive  sound\nexperience. This latest version of Resident  Evil  Revelations  will  also\ndeliver  additional  content  including  a  terrifying  new  enemy,  extra\ndifficulty mode, integration with  ResidentEvil.net  and  improvements  to\nRaid Mode. Raid Mode, which was first introduced  to  the  series  in  the\noriginal version of Resident Evil Revelations, sees gamers play online  in\nco-op mode or alone in single player  taking  on  the  hordes  of  enemies\nacross a variety of missions whilst leveling  up  characters  and  earning\nweapon  upgrades.  New  weapons,  skill  sets,  and  playable   characters\nincluding  Hunk,  take  the  Raid   Mode   experience   to   new   depths.\n\nThe critically acclaimed survival horror title takes players back  to  the\nevents that took place between  Resident  Evil  4  and  Resident  Evil  5,\nrevealing the truth about the T-Abyss  virus.  Resident  Evil  Revelations\nfeatures series favorites Jill Valentine and Chris  Redfield,  plus  their\nrespective BSAA partners - Parker Luciani and Jessica Sherawat. The action\nbegins on board a supposedly abandoned cruise ship, the  'Queen  Zenobia',\nwhere horrors lurk around  every  corner,  before  players  head  for  the\nmainland and the devastated city of Terragrigia.  With  limited  ammo  and\nweapons available, the race is on to survive the horror of  Resident  Evil\nRevelations.\n\nFeatures:\n=========\n* Enhanced visual and aural fidelity - Resident Evil Revelations brings\nspine-chilling fear complete with high quality HD visuals, enhanced\nlighting effects and an immersive sound experience.\n* Classic survival horror gameplay returns - the campaign mode's single\nplayer experience sees gamers investigating a range of different\nlocations including the dark confined spaces of a cruise ship and the\ntreacherous snow covered mountains. With limited ammo and weapons, fight\noff infected enemies that lurk around every corner.\n* Hell just got hotter - Infernal Mode, a new difficulty mode for the\nre-mastered HD edition, is not just more challenging than Easy and\nNormal modes but also remixes enemy and item placement, so even those\nfamiliar with the game will discover new terrors.\n* Meet the Wall Blister - A brand new enemy, the Wall Blister is a mutated\ncreature borne from the T-Abyss virus that spreads through water, adding\nto the horrors that lurk around every corner.\n* Residentevil.net support - Resident Evil Revelations will take full\nadvantage of Residentevil.net with content available to users once the\ngame launches. Earn weapons and custom parts and use them in-game,\ncollect figures that can be used in dioramas and check your stats\nthrough the online web service.\n* Improved Raid Mode - New weapons, skill sets, playable characters\nincluding Rachel and Hunk and enemies exclusive to this mode are added\nfor the this latest version.\n* Use your equipment - Analyze enemies and investigate areas with the\nGenesis scanner to reveal hidden items.\n &lt;a href=&quot;\nhttp://s8.postimg.org/s1eqj2t9h/resident_evil_revel_1.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s8.postimg.org/s1eqj2t9h/resident_evil_revel_1.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://s7.postimg.org/oh01iyzfv/resident_evil_revel_2.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s7.postimg.org/oh01iyzfv/resident_evil_revel_2.jpg&lt;/a&gt;\n\nInstallation Information:\n=========================\n\n* Install game(run setup.exe)\n* Play the game\n\nNOTE\n============================\nYOU DON`T NEED TO COPY ANY CRACK\n\nNOTE: Say no, when asked if you want to send gameplay info to\nRESIDENT EVIL.NET\n\n\nWe are looking for nice coders\nWe are looking for seeders\nWe are looking for people who could help us\nWe are looking for Games Helpers\nwe are looking for people with seedbox\n\n\nIf you think you are one of those contact us at\n\nHow To Get Your Maxspeed (uTorrent)\n\nTorrent Client - Preferences - Bandwidth - Number of connections - Set aprox. 500 for each\nTorrent Client - Preferences - BiTorrent - Protocol Encryption - Forced\nBandwidth Allocation - High (Set download/upload limit - Unlimited)\nStop Other Active Torrents - Start downloading and wait for connections.\nEnjoy and Seed for at least 1:1 ratio. Don't forget to say thanks/leave reviews. \n\nCheck my user for more games: \n\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/aviara/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/aviara/&lt;/a&gt;\n\n\n\n\n\n","torrent":{"xt":"urn:btih:6ad3976317837bf2244c90015a8792a7caee0274","amp;dn":"Resident+Evil+Revelations-%3DAviaRa%3D-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ad3976317837bf2244c90015a8792a7caee0274","infoHashBuffer":{"type":"Buffer","data":[106,211,151,99,23,131,123,242,36,76,144,1,90,135,146,167,202,238,2,116]},"announce":[],"urlList":[]}}