{"title":"Fosar&amp;Bludorf-Status nicht existent(antigravity,space defense,st","uid":4746677,"size":19813259,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6b7f4266f617260b9e5c3080e136d21c6a72a1f3&amp;dn=Fosar%26Bludorf-Status+nicht+existent%28antigravity%2Cspace+defense%2Cst&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"red_gonzo","files":1,"time":1235921153,"description":"For english-only speaking:\nThis book is in german language. English title would be: Status non-existent - Antigravity deployed, space defense, stealth technology, mind control (2008). Grazyna Fosar and Franz Bludorf explain why the knowledge of antigravity never came to public arena as those who have discovered it made damn sure to keep it away from everyone else. Did you know that some secret military bases in Australia were actually built for space defense? But against whom? If you want to develop futuristic space weapon systems it is necessary to develop a new enemy who comes from outer space to justify all the enormous financial spending. Whether this enemy is real or not it's not so important as longer you can keep the population in an endless state of fear. Can cosmic communication be achieved with hexagonal antenna systems? Find out how technologies already exist that could dissolve us from addiction to fossil fuels. Also includes American study for space defense and former &quot;eyes only&quot; study of British military intelligence service DI55 dealing with UFOs over Great Britain. 170 pages, many pictures.\n\nFur Deutschsprachige:\nDas Wissen ÃƒÂ¼ber Antigravitation hat in unserer RealitÃƒÂ¤t den Status &quot;Nicht existent&quot;. Warum? Es erlaubt, vieles mÃƒÂ¶glich zu machen, was angeblich nicht mÃƒÂ¶glich ist dann sie ist die perfekte Tarnkappentechnologie. Wissen sie das die Geheimbasen North West Cape und Pine Gap in Australien bereits aktiv in der Weltraumverteidigung sind? Aber gegen wem denn? Konnen kosmische Kommunikation durch hexagonale Antennenfelder erreicht werden? Wollen sie die Zugang zu fast unerschÃƒÂ¶pflichen Energieressourcen, die uns von Kernkraft und fossilen Brennstoffen unabhÃƒÂ¤ngig machen kÃƒÂ¶nnten, haben? Wer ÃƒÂ¼ber solches Wissen verfÃƒÂ¼gt, will es nicht mit anderen teilen. Er kann sich dann fÃƒÂ¼r den Rest der Welt unangreifbar machen. Die Entwicklung futuristischer Weltraumwaffensysteme erfordert daher eine Doppelstrategie aus strikter Geheimhaltung - selbst vor den eigenen VerbÃƒÂ¼ndeten - und dem Aufbau neuer Feindbilder. Man erzeugt eine Dramaturgie der Angst vor einer Bedrohung der Erde aus dem Weltall. Erstmals in deutscher Sprache dokumentiert: Die US-Studie zur Weltraumverteidigung und die ehemals streng geheime (&quot;Eyes Only&quot;) Studie des britischen MilitÃƒÂ¤rgeheimdienstes DI55: &quot;Unidentified Aerial Phenomena in the UK Air Defence Region&quot; (&quot;Unidentifizierte LuftphÃƒÂ¤nomene im Luftverteidigungsraum des Vereinigten KÃƒÂ¶nigreichs&quot;). Offensiver und defensiver Einsatz gegen extraterrestrische, interdimensionale und militÃƒÂ¤rische Flugobjekte. Neue Fakten aus den USA, Australien, GroÃƒÅ¸britannien und RuÃƒÅ¸land. 170 Seiten, viele Abbildugen.\n","torrent":{"xt":"urn:btih:6b7f4266f617260b9e5c3080e136d21c6a72a1f3","amp;dn":"Fosar%26Bludorf-Status+nicht+existent%28antigravity%2Cspace+defense%2Cst","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b7f4266f617260b9e5c3080e136d21c6a72a1f3","infoHashBuffer":{"type":"Buffer","data":[107,127,66,102,246,23,38,11,158,92,48,128,225,54,210,28,106,114,161,243]},"announce":[],"urlList":[]}}