{"title":"George A. Maloney - Pilgrimage of the Heart (pdf)","uid":9299640,"size":2674029,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6ba96633b614538d6c57f127c31a97517d120ab8&amp;dn=George+A.+Maloney+-+Pilgrimage+of+the+Heart+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pharmakate","files":-1,"time":1386221090,"description":"George A. Maloney, S.J., ed. - Pilgrimage of the Heart: A Treasury of Eastern Christian Spirituality (Harper &amp; Row, 1983). 254 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\n\nFascinating book that seems to have gone out of print almost immediately after publication.\n\n\nback cover:\n\nThis most comprehensive one-volume collection of classic Eastern Christian readings from the first to the twentieth century touches all aspects of spiritual growth and development, including the mystical, contemplative, and ascensional dimensions, with practical applications. Noted scholar George A. Maloney, S.J., shows how the spiritual teachings of the Christian East offer a dynamic view of the inner life and spiritual disciplines quite different in accent from Western praxis.\n\nPilgrimage of the Heart opens with an enlightening introductory essay that surveys the breadth, diversity, and history of major teachers and movements from the Desert Fathers to recent Catholic and Orthodox writings and distills the distinctive features of Eastern spirituality. Selections are arranged so as to reflect the stages on the way of spiritual development from the point of view of the great writers of this tradition. Pilgrimage of the Heart commences with the Eastern Christian articulation of the human situation, explains the process by which we come to experience and understand the human and divine spheres, and unfolds what one must do to realize the potential for personal and corporate transformation. Along the way, key selections illumine disciplines and techniques to aid spiritual growth at various stages.\n\nGeorge A. Maloney, S.J., taught theology for sixteen years at Fordbam University, where he is currently the director of the Master's Program of the John XXIII Institute for Eastern Christian Studies. He travels widely throughout the United States and Canada, preaching retreats and giving workshops on prayer for priests, nuns, and laity. The editor of DIAKONIA: An Ecumenical Journal to Promote Eostem Christianity in the West, Father Maloney has published twenty-seven books, primarily concerned with prayer and the spiritual life and drawing largely on insights from Eastern Christianity.\n\n---\n\nFor a similar and extremely fine anthology of texts from the Eastern tradition, see The Roots of Christian Mysticism:\n &lt;a href=&quot;\nhttps://thepiratebay.se/torrent/8187292&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.se/torrent/8187292&lt;/a&gt;","torrent":{"xt":"urn:btih:6ba96633b614538d6c57f127c31a97517d120ab8","amp;dn":"George+A.+Maloney+-+Pilgrimage+of+the+Heart+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ba96633b614538d6c57f127c31a97517d120ab8","infoHashBuffer":{"type":"Buffer","data":[107,169,102,51,182,20,83,141,108,87,241,39,195,26,151,81,125,18,10,184]},"announce":[],"urlList":[]}}