{"title":"The Other Brain_ From Dementia to Schizophrenia, How New Discove","uid":6124222,"size":374797796,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:6bb806da6e6353f2bd42d0596fd0bed8cc2cb61d&amp;dn=The+Other+Brain_+From+Dementia+to+Schizophrenia%2C+How+New+Discove&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"ut1880h","files":101,"time":1295830186,"description":"General Information\n===================\n Title............: The Other Brain: From Dementia to Schizophrenia, How New Discoveries About the Brain are Revolutionizing Medicine and Science\n Author...........: R. Douglas Fields\n Read By..........: Victor Bevine \n Genre............: Neuroscience\n Publisher........: Audible\n Year.............: 2010\n Unabridged.......: Yes\n Language.........: English\n\nOriginal Media Information\n==========================\n Media............: Audible enhanced (.aax)\n \nFile Information\n================\n Number of MP3s...: 98\n Total Duration...: 12 hours 55 minutes\n Total MP3 Size...: 357 MB\n Ripped by........: me            \n Ripper...........: Tunebite                              \n Encoder..........: LAME 3.98         \n Encoder Settings.: CBR 64 kbit/s 22500 Hz Mono          \n ID3 Tags.........: v1.1, v2.3 (includes embedded album art)\n\nBook Description\n================\n\nDespite everything that has been written about the brain, a very important part of this vital organ has been overlooked in most books - until now. The Other Brain is the story of glia, which make up approximately 85 percent of the cells in the brain. Long neglected as little more than cerebral packing material (\\&quot;glia\\&quot; means glue), glia are sparking a revolution in brain science.\n\nGlia are completely different from neurons, the brain cells that we are familiar with. Scientists are discovering that glia have their own communication network, which operates in parallel to the more familiar communication among neurons. Glia provide the insulation for the neurons, and glia even regulate the flow of information between neurons.\n\nBut it is the potential breakthroughs for medical science that are the most exciting frontier in glia research today. Diseases such as brain cancer and multiple sclerosis are caused by diseased glia. Glia are now believed to play an important role in such psychiatric illnesses as schizophrenia and depression, and in neurodegenerative diseases such as Parkinson\\'s and Alzheimer\\'s. They are linked to infectious diseases such as HIV and prion disease (mad cow disease, for example) and to chronic pain. Scientists have discovered that glia repair the brain and spinal cord after injury and stroke. The more we learn about these cells that make up the \\&quot;other\\&quot; brain, the more important they seem to be.\n\nWritten by a neuroscientist who is a leader in the research to reveal the secrets of these brain cells, The Other Brain offers a firsthand account of science in action. It takes us into the laboratories where important discoveries are being made, and it explains how scientists are learning that glial cells come in different types, with different capabilities. It tells the story of glia research from its origins to the most recent discoveries and gives readers a much more complete understanding of how the brain works and where the next breakthroughs in brain science and medicine are likely to come. ","torrent":{"xt":"urn:btih:6bb806da6e6353f2bd42d0596fd0bed8cc2cb61d","amp;dn":"The+Other+Brain_+From+Dementia+to+Schizophrenia%2C+How+New+Discove","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6bb806da6e6353f2bd42d0596fd0bed8cc2cb61d","infoHashBuffer":{"type":"Buffer","data":[107,184,6,218,110,99,83,242,189,66,208,89,111,208,190,216,204,44,182,29]},"announce":[],"urlList":[]}}