{"title":"Tikhiye Stranitsky aka Whispering Pages 1994 DVDRip Sonata Premi","uid":8080055,"size":1031762578,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6d0a5fd64e1bba4a503668a778097c1e40711a2c&amp;dn=Tikhiye+Stranitsky+aka+Whispering+Pages+1994+DVDRip+Sonata+Premi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"klinho","files":2,"time":1359476474,"description":"&quot;Whispering Pages&quot; shows why Sokurov has such trouble with old Communist bosses or new capitalist distributors. The film, a lyrical distillation of Dostoyevsky's &quot;Crime and Punishment,&quot; is painfully sensitive, difficult, almost ethereally strange. It's an art film that makes as little concession as possible to mass tastes.\n\nBut if you accept that oddness, &quot;Whispering Pages&quot; can be a subtly beautiful and rewarding experience.\n\nSokurov's film uses &quot;Crime and Punishment&quot; the way a minimalist playwright might use Shakespeare. (The novel isn't even mentioned in the credits, which identify &quot;Pages&quot; as &quot;based on 19th Century Russian prose.&quot;)\n\nThe setting, supposedly 19th Century St. Petersburg, is a macabre hybrid of past and present Russia: walkways wreathed in mist, water from a sewage system swirling below, dark and boisterous streets, cavernous apartments. The photography is monochrome with hints of tint. The camera, like Tarkovsky's, crawls and floats languidly over the surfaces.\n\nIn the background, we hear a drone or whisper of voices, the lapping of water, the strains of Gustav Mahler's heart-stopping &quot;Kindertotenlieder&quot; (&quot;Songs on the Death of Children&quot;).\n\nThe atmosphere is as important as the characters. The story has been stripped to its core. There are only three important characters. And though they seem descended from Dostoyevsky's tormented murderer Raskolnikov (Aleksandr Cherednik as the Hero), his inquisitor Inspector Porfiry (Sergei Barkovsky as the Official) and his redeemer Sonya (Elizaveta Koroljova as the Girl), they have been so boiled down and purified, they're often unrecognizable.\n\nThey've become less characters than essences, as if Samuel Beckett were dramatically compressing a novel by Leo Tolstoy. Dostoyevsky's drama, personality and psychology have almost vanished. Left behind are themes and images, a few whispering pages in an indistinct shimmering realm.","torrent":{"xt":"urn:btih:6d0a5fd64e1bba4a503668a778097c1e40711a2c","amp;dn":"Tikhiye+Stranitsky+aka+Whispering+Pages+1994+DVDRip+Sonata+Premi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d0a5fd64e1bba4a503668a778097c1e40711a2c","infoHashBuffer":{"type":"Buffer","data":[109,10,95,214,78,27,186,74,80,54,104,167,120,9,124,30,64,113,26,44]},"announce":[],"urlList":[]}}