{"title":"The Venona Secrets (2001) by H. Romerstein &amp; E. Breindel","uid":10160565,"size":5079703,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6d583802e9097da4130d36c195da16a51b654f38&amp;dn=The+Venona+Secrets+%282001%29+by+H.+Romerstein+%26amp%3B+E.+Breindel&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1400240784,"description":"The Venona Secrets - Exposing Soviet Espionage and America's Traitors (2001) by Herbert Romerstein &amp; Eric Breindel.pdf\n\nThe Venona Secrets presents one of the last great, untold stories of World War II and the Cold War. In 1995 the Venona documents secret Soviet cable traffic from the 1940s that the United States intercepted and eventually decrypted finally became available to American historians. Now, after spending more than five years researching all the available evidence, espionage experts Herbert Romerstein and Eric Breindel reveal the full, shocking story of the days when Soviet spies ran their fingers through America s atomic-age secrets.\n\nIncluded in The Venona Secrets are the details of the spying activities that reached from Harry Hopkins in Franklin Roosevelt s White House to Alger Hiss in the State Department to Harry Dexter White in the Treasury. More than that, The Venona Secrets exposes: information that links Albert Einstein to Soviet intelligence and conclusive evidence showing that J. Robert Oppenheimer gave Moscow our atomic secrets How Soviet espionage reached its height when the United States and the Soviet Union were supposedly allies in World War II The previously unsuspected vast network of Soviet spies in America How the Venona documents confirm the controversial revelations made in the 1940s by former Soviet agents Whittaker Chambers and Elizabeth Bentley.\n\nThe role of the American Communist Party in supporting and directing Soviet agents How Stalin s paranoia had him target Jews (code-named Rats ) and Trotskyites even after Trotsky s death How the Soviets penetrated America s own intelligence services The Venona Secrets is a masterful compendium of spy versus spy that puts the Venona transcripts in context with secret FBI reports, congressional investigations, and documents recently uncovered in the former Soviet archives. Romerstein and Breindel cast a spotlight on one of the most shadowy episodes in recent American history a past when treason infected Washington and Soviet agents were shielded, either wittingly or unwittingly, by our very own government officials.\n\n608 pages\nPublisher: Regnery History (October 2001)\nLanguage: English\nISBN-10: 0895262258\nISBN-13: 978-0895262257","torrent":{"xt":"urn:btih:6d583802e9097da4130d36c195da16a51b654f38","amp;dn":"The+Venona+Secrets+%282001%29+by+H.+Romerstein+%26amp%3B+E.+Breindel","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d583802e9097da4130d36c195da16a51b654f38","infoHashBuffer":{"type":"Buffer","data":[109,88,56,2,233,9,125,164,19,13,54,193,149,218,22,165,27,101,79,56]},"announce":[],"urlList":[]}}