{"title":"4 Rare 80s Albums [Part 2]","uid":4069310,"size":195660988,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6d639d111d33da57841095901623107fe27db7e7&amp;dn=4+Rare+80s+Albums+%5BPart+2%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"80zforever","files":-1,"time":1204967398,"description":"I am featuring 4 more rare 80s gems as I promised, so what's to grab? ok:\n\n\nBlanket of Secrecy - Walls Have Ears [1982]\n\nBlanket of Secrecy was a popular British New Wave rock music trio. The band is notable for the fact that the band members, true to their band name, were never identified, using only pseudonyms (Tinker, Tailor and Soldier), leading to much speculation in the music press regarding their true identity. The band members could be seen in silhouette on the back cover of their one and only LP, 1982's Walls Have Ears in the U.K. (mysteriously renamed Ears Have Walls for its U.S. release). A single from the album, &quot;Say You Will,&quot; received considerable airplay on both sides of the Atlantic.\n \nTracklisting:\n\nBlanket Of Secrecy - Walls Have Ears [1982]\n\n01 Say You Will\n02 Young Heart\n03 Love Me Too\n04 Remember Me And You\n05 Long Cool Glass\n06 Photograph\n07 Yo Yo\n08 Close To Me\n09 Something I Don't Need\n10 Tell Me Baby\n11 Lovers\n12 B.O.S. Theme\n\n\n\n\nCee Farrow - Red and Blue\n\nCee Farrow was an 80s new wave/dance band that released one LP, Red And Blue and an EP in 1990. The most known song here is Should I Love You but overall it?s an enjoyable piece of new wave/dance music. The frontman, Chris, passed away in early 90s. \n\n\nTracklisting:\n\nCee Farrow - Red and Blue [1983]\n\n01 Don't Ask Why\n02 Heartbreaking Affair\n03 Touched\n04 Wildlife Romance\n05 Distant Picture\n06 Should I Love You\n07 Paint It Blue\n08 Backwards\n09 Lost and Memorized\n10 Think of Me\n\n\n\n\nColour Radio - Self-titled (1984)\n\nI first heard two singles of this LP in 1984 and fell in love with the band right away! But I was never able to get much information on them. You know those days we did not have access to the internet, just a crappy SW or high quality FM radio! For those who are curiuos, the style is what used to be called as &quot;new wave rock&quot;.\n\nTracklisting:\n\nColour Radio - Self-titled (1984)\n\n01 Adrianna Dreams\n02 Johnny\n03 Dancer\n04 Sheila\n05 The Beast (In Us All)\n06 The Hunter\n07 Bound For Life\n08 Kathleen\n09 Straight From The Heart\n10 Stand With You\n\n\n\n\nThe Nobodys - No Guarantees [1984]\n\nThe Nobodys' name became a self-fulfilling prophecy; hardly anyone knew who they were when the band disappeared from the music scene. Their debut LP, No Guarantees, reveals that the group deserved a more commercially rewarding fate. The driving synthesized rhythms of &quot;No Guarantees&quot; should've ensured the Nobodys a club hit. However, the Bob Dylan-esque whine of Safeway Goya's voice may have turned off DJs. Goya's vocals are an acquired taste; listeners will either love or loathe them. Nevertheless, Goya sings with passion, even when the lyrics venture into bizarre subject matter. In the hilarious &quot;Just One of Your Legs,&quot; Goya says, &quot;Please send me a photograph of your legs.&quot; The longing in Goya's voice turns what easily could've been a novelty song into an oddly touching admission of love. The funky &quot;I Am Helpless Without My Computers&quot; is ahead of its time, confessing a dependency on computers for social interaction years before the Internet. &quot;My terminal's been broken all day,&quot; Goya laments. &quot;I Scratch&quot; is one of the album's catchiest tracks; with its pulsating keyboards and ragged guitars, the song is also the LP's edgiest number. &quot;They Didn't Offer Me You&quot; is elevated by spiraling riffs. Sadly, all of the talent displayed on No Guarantees went nowhere. \n\n\n\nTracklisting:\n\nThe Nobodys - No Guarantees [1984]\n\n01 No Guarantees  \n02 I Scratch  \n03 They Didn't Offer Me You  \n04 Just One of Your Legs  \n05 What Can I Do?  \n06 I Am Helpless Without My Computers  \n07 Drops of Water  \n08 The Gang on Fortune Hill  \n09 I Don't Mind","torrent":{"xt":"urn:btih:6d639d111d33da57841095901623107fe27db7e7","amp;dn":"4+Rare+80s+Albums+%5BPart+2%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d639d111d33da57841095901623107fe27db7e7","infoHashBuffer":{"type":"Buffer","data":[109,99,157,17,29,51,218,87,132,16,149,144,22,35,16,127,226,125,183,231]},"announce":[],"urlList":[]}}