{"title":"Duster Graphic Novel","uid":7364798,"size":69341621,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:6e1c46992682c7900a0e815f6efa49d7b25dfc4b&amp;dn=Duster+Graphic+Novel&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Leperous","files":-1,"time":1340070445,"description":"DUSTER: In the closing days of World War II, a widowed housewife turned cropduster pilot struggles to rescue her teenage daughter from a band of Nazi war criminals who crash near her small Texas farm.\n\n&quot;DUSTER is a gripping, compelling story. I love the characters. I love the set-up. The art gives it all a gritty, authentic look. And I'm completely, nail-bittingly, breath-holdingly on the edge of my seat -- I only got to read through the end of Chapter 4, and I can't freakin' wait to see how it all works out. Action, suspense, humanity, drama, blood, love and heroics. Micah Ian Wright's coming back to comics, and he and his partners are throwing one hell of a party. Don't miss out on this terrific book.&quot; - Kurt Busiek (Astro City)\n\nDUSTER is a 240-page graphic novel written by Micah Ian Wright (Stormwatch: Team Achilles, Transformers, Destroy All Humans, the Angry Beavers, Looney Tunes) and Jay Lender (SpongeBob SquarePants, Phineus and Ferb) and illustrated by Cristian Mallea and JOK, with a cover by Howard Chaykin.\n\nThis is a 40-page preview of the book... it is available via a live Kickstarter campaign only for a limited time at: http://kck.st/NE6rVX\n\nIf you like this preview, please support the book on Kickstarter... please help support indy comics, even if only by tweeting and facebooking the link to your friends.\n\nThanks!","torrent":{"xt":"urn:btih:6e1c46992682c7900a0e815f6efa49d7b25dfc4b","amp;dn":"Duster+Graphic+Novel","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e1c46992682c7900a0e815f6efa49d7b25dfc4b","infoHashBuffer":{"type":"Buffer","data":[110,28,70,153,38,130,199,144,10,14,129,95,110,250,73,215,178,93,252,75]},"announce":[],"urlList":[]}}