{"title":"Autumn Moon / Qiu yue (1992)","uid":12088250,"size":942202760,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6fbf6226fd64886f11adac015057c7646e38af9f&amp;dn=Autumn+Moon+%2F+Qiu+yue+%281992%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":3,"time":1435957640,"description":"Autumn Moon/Qiu yue (1992)\nImdb: http://www.imdb.com/title/tt0105198/\nDirector: Clara Law\nWriter: Eddie Ling-Ching Fong (as Fong Ling Ching)\nStars: Masatoshi Nagase, Pui-Wai Li, Choi Siu Wan\n\nImdb plot summary:\nTwentysomething Japanese tourist, Tokio, comes to Hong Kong looking for good cusine. He does all that the tourist is expected to do, but is disappointed with the food so far. By chance, he meets 15-year-old Pui Wai. She's been left behind with her eighty-year-old Granny, her parents too busy with their immigration problems in Canada. Differences in culture, language and age serve as no barrier, as Tokio finds a soulmate in Granny, Hong Kong cook extraordinate. He discovers the secret to Granny's cooking and learns that she's known all along that her family will not be taking her to Canada when they leave.\n\nImdb review by naun:\nPast and future\n\nThis is an unusually subtle and beautiful film about the migrant experience. In small but resonant ways it explores themes of memory, identity and tradition both at the level of the culture and of the individual. In some ways it reminds me of _Hiroshima mon amour_, a much better known film on similar themes which may be a useful reference point for anyone who is not sure what to expect from this film.\n\nSome of the simplest images in this film are also its most powerful: there's poignancy in something as unremarkable as a shot of the contents of a refrigerator, or in a young girl's distress at being told that her cherished local McDonald's is not a &quot;traditional restaurant&quot;. It's not that the film is merely nostalgic, however. It's more about what it means to be poised in the instant between a meaningful past and an unknowable but very different future. At the very heart of the film is an unforgettable soliloquy by an old woman about her wishes for her descendants.\n\nThis is not a film that everybody will be able to relate to. But for the increasing number of us who find ourselves displaced from old certainties, it is gratifying, haunting and challenging to see a film like this one. \n\nSource: unknown\nFramerate: 29.97 fps\nResolution: 688x384\nLength: 1:42:54\nLanguages: Chinese, Japanese, Basic English\n\nEnglish .srt subtitle included","torrent":{"xt":"urn:btih:6fbf6226fd64886f11adac015057c7646e38af9f","amp;dn":"Autumn+Moon+%2F+Qiu+yue+%281992%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6fbf6226fd64886f11adac015057c7646e38af9f","infoHashBuffer":{"type":"Buffer","data":[111,191,98,38,253,100,136,111,17,173,172,1,80,87,199,100,110,56,175,159]},"announce":[],"urlList":[]}}