{"title":"Pink Floyd - 1973 to 1983 CDRips [Joined][Cov+6CD][Bubanee]","uid":5384381,"size":454979605,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:720ac6707a412b4e9cd08a999717e088fa52e461&amp;dn=Pink+Floyd+-+1973+to+1983+CDRips+%5BJoined%5D%5BCov%2B6CD%5D%5BBubanee%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bubanee","files":30,"time":1266845925,"description":"In this collection of CDRips i have provided the Covers and CD JPegs\nRecorded with Lame 3.99a MP3 VBRV0.... 2 Pass Secure/Accurate...\n\nPlease SEED for others to Enjoy!\nCheers, Bubanee\n\nPLEASE READ BEFORE DECIDING TO DOWNLOAD OR NOT\n\nThis collection i have based the music tracks on LP/Cassette Release\nI.E. The Wall has 4 sides.. (Double LP/Cassette)  \nso there for i have created 4 Tracks\nRepresenting one for each side\n(Single Discs 2 Tracks.. Double Discs 4 Tracks)\n\nWhy... Because Pink Floyd Shouldn't Have Gaps!\n\n1973 Dark Side Of The Moon \n\n1975 Wish You Were Here\n\n1977 Animals\n\n1979 The Wall\n\n1983 The Final Cut\n\nPink Floyd were an English rock band who earned recognition for their psychedelic music \nin the late 1960s and, as they evolved in the 1970s, for their progressive rock music. \nPink Floyd's work is marked by the use of philosophical lyrics, sonic experimentation, \ninnovative album cover art, and elaborate live shows. One of rock music's most critically acclaimed \nand commercially successful acts, the group has sold over 200 million albums worldwide, \nincluding 74.5 million certified units in the United States.\n\nPink Floyd were formed in 1965, \nand originally consisted of university students \nRoger Waters, Nick Mason, Richard Wright, Syd Barrett and, briefly, Bob Klose. \nThe group were a popular fixture on London's underground music scene, \nand under Barrett's leadership released two charting singles, &quot;Arnold Layne&quot; and &quot;See Emily Play&quot;, \nand a commercially and critically successful album, The Piper at the Gates of Dawn. \nIn 1968, guitarist and singer David Gilmour joined the line-up, \nand Barrett was removed due to his increasingly erratic behaviour. \nFollowing Barrett's departure, bass player and singer Roger Waters became \nthe lyricist and dominant figure in the band, which thereafter achieved \nworldwide critical and commercial success with the concept albums\n \nThe Dark Side of the Moon, \nWish You Were Here, \nAnimals,  \nThe Wall\nThe Final Cut\n\nWright left the band in 1979, and Waters in 1985, \nbut Gilmour and Mason (joined by Wright) continued recording and touring under the name Pink Floyd. \nWaters used legal means to try to keep them from using the name, \ndeclaring Pink Floyd a spent force, but the parties reached an out-of-court settlement \nallowing Gilmour, Mason and Wright to continue as Pink Floyd. \nThe band again enjoyed worldwide success with A Momentary Lapse of Reason (1987) \nand The Division Bell (1994), and Waters continued as a solo musician, \nreleasing three studio albums. Although for some years relations between Waters \nand the remaining three members were sour, the band reformed in 2005 for what would be a \nfinal one-off performance at Live 8.","torrent":{"xt":"urn:btih:720ac6707a412b4e9cd08a999717e088fa52e461","amp;dn":"Pink+Floyd+-+1973+to+1983+CDRips+%5BJoined%5D%5BCov%2B6CD%5D%5BBubanee%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"720ac6707a412b4e9cd08a999717e088fa52e461","infoHashBuffer":{"type":"Buffer","data":[114,10,198,112,122,65,43,78,156,208,138,153,151,23,224,136,250,82,228,97]},"announce":[],"urlList":[]}}