{"title":"Mozart - The Complete Piano Concertos (Geza Anda)","uid":5152443,"size":1471604247,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:73c310ebc82c262cacadb1426a3903fe2122c035&amp;dn=Mozart+-+The+Complete+Piano+Concertos+%28Geza+Anda%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"dougietrotter","files":-1,"time":1257635737,"description":"GÃƒÂ©za Anda's interpretations of Mozart's piano concertos are immortal classics that should not be overlooked. Granted, it is a crowded field, which include many excellent accounts (Perahia's, for example). But these recordings - made in Salzburg - are fine examples of the rare moments in music making when a soloist and ensemble forms a coherent unit. Anda and his Salzburger team know Mozart by heart, and they perform these works with an unmatched dedication and sophistication. Technical brilliance is not the ultimate goal here; it is rather the music itself, how to let it flow with a balanced passion. This keeps the element of spontaneity, so crucial in Mozart's music, alive and sparkling. \n\nAnda's Mozart is thus never dull, which occasionally is the case with Brendel's or Perahia's. In his hands, each phrase is given attention, vitality, and expressive nuance. As a result, it is a sheer delight to listen to all the 27 concertos for the (almost) ten hours it takes. \n\nSo far for the interpretations. Regarding recording quality, these recordings were made in the sixties at a time when the DG engineers really couldn't compete with, say Decca or HMV. The recordings are thus a bit dry, even if the remasterings are excellent. But do not let this very minor shortcoming prevent you from experience these outstanding interpretations. \n\nTo sum up: this set is strongly recommended for any music collector. Mozart's piano concertos have never been more attractively presented than in the hands of Anda.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:73c310ebc82c262cacadb1426a3903fe2122c035","amp;dn":"Mozart+-+The+Complete+Piano+Concertos+%28Geza+Anda%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73c310ebc82c262cacadb1426a3903fe2122c035","infoHashBuffer":{"type":"Buffer","data":[115,195,16,235,200,44,38,44,172,173,177,66,106,57,3,254,33,34,192,53]},"announce":[],"urlList":[]}}