{"title":"The Gun - Gunsight [1968][2011][320 KBPS][RMSTD]","uid":11789237,"size":224868156,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:74a806ccae31bac5539e17443c44d422df934f1b&amp;dn=The+Gun+-+Gunsight+%5B1968%5D%5B2011%5D%5B320+KBPS%5D%5BRMSTD%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LameDuck69","files":24,"time":1427867887,"description":"The Gun - Gunsight [1968][2011][RMSTD]\n\n\n\n01. Head In The Clouds  \n02. Drown Yourself In The River  \n03. Angeline  \n04. Dreams And Screams  \n05. Situation Vacant  \n06. Hobo  \n07. Lady Link Part One  \n08. Oh Lady You  \n09. Lady Link Part Two  \n10. Long Hair Wildman  \n11. Hobo (Single Version)  \n12. Don't Look Back  \n13. Runnin' Wild  \n--------------------------------\n**320 KBPS CBR\n**Cover Art\n--------------------------------\nThe Gun was a late 1960s British rock guitar trio who had a single British Top Ten hit, &quot;Race with the Devil&quot; and recorded two albums before disbanding. Two of its founders, brothers Paul Gurvitz and Adrian Gurvitz, later took the name Three Man Army and recorded three albums.\n\nAfter joining up with Ginger Baker (Cream, Blind Faith) as Baker Gurvitz Army, the trio recorded three albums: Baker Gurvitz Army, Elysian Encounter and Hearts On Fire. During the same period, the Gurvitz brothers recorded two albums with drummer Graeme Edge of The Moody Blues: Kick Off Your Muddy Boots and Paradise Ballroom, under the name The Graeme Edge Band; this was not a touring band, and also featured Baker.\n--------------------------------------------------------------------------------\nThe Gun were renamed in 1967 from The Knack, formed by guitarist/vocalist Paul Gurvitz (born Paul Anthony Gurvitz, 6 July 1944, High Wycombe, Buckinghamshire - he was known by the surname Curtis until the early 1970s after which he returned to his original name Gurvitz). The Knack changed their name in the spring/summer of 1966, and the setup was Paul Curtis (Gurvitz) on guitar and vocals, Louie Farrell (born Brian John Farrell, 8 December 1947, Goodmayes, Essex) [1] (who had joined The Knack in mid 1966) on drums, Gearie Kenworthy on bass guitar, Tim Mycroft organ, and later for a short while, Jon Anderson of Yes. The Gun performed at the UFO Club, supporting bands such as Pink Floyd, Arthur Brown and Tomorrow. Recording sessions at Olympic Studios produced the unreleased single &quot;Lights on the Wall&quot;, while in November 1967 they recorded for the BBC alternative music radio programme Top Gear[1] and twice played on air. In early 1968 the band changed its lineup to a three-piece, with Paul Curtis (Gurvitz) on bass, Louie Farrell on drums and Adrian Curtis (Gurvitz ) on guitar,additional Marco Monti voice and guitar in studio.\n\nAfter being signed to CBS Records in early 1968, the band scored a hit with the opening track from their eponymous album (1968), &quot;Race with the Devil&quot;. Issued as a single in October 1968, it reached the top 10 in its native UK, #35 on the Australian Singles Chart and no #1 in many UK territories (Go-Set) in March 1969.[2] Jimi Hendrix quoted the song's riff during his song &quot;Machine Gun&quot; at the Isle of Wight Festival in 1970.[3] &quot;Race with the Devil&quot; has been covered by Judas Priest (on the remastered CD version of Sin After Sin), Black Oak Arkansas (on their album Race with the Devil), Girlschool (on their album Demolition), and Church of Misery (on their 1996 demo, released as a split album with Acrimony, and on their full-length LP Vol. 1).\n\nTheir debut album's cover is noteworthy as it was the first by Roger Dean. Allmusic describes it as having a &quot;distinctive psych-flavoured proto-metal&quot; sound.[4] Their second album, Gunsight was released in 1969.\n\nDespite releasing a number of other singles, and an attempt by their record label to identify them with the underground counter-culture,[1] the band had no further hits. The Gurvitz brothers, after a short time working separately, formed Three Man Army in 1971, and between 1974 and 1976 became the Baker Gurvitz Army with Ginger Baker, the former drummer for Cream in the line-up.[1]","torrent":{"xt":"urn:btih:74a806ccae31bac5539e17443c44d422df934f1b","amp;dn":"The+Gun+-+Gunsight+%5B1968%5D%5B2011%5D%5B320+KBPS%5D%5BRMSTD%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"74a806ccae31bac5539e17443c44d422df934f1b","infoHashBuffer":{"type":"Buffer","data":[116,168,6,204,174,49,186,197,83,158,23,68,60,68,212,34,223,147,79,27]},"announce":[],"urlList":[]}}