{"title":"Whose Line is it Anyway? Music MP3s","uid":8360893,"size":1608760283,"categoryP":"audio","categoryS":"sound_clips","magnet":"?xt=urn:btih:76003f4177e4002b180bc7debd4bd76bf68fafa1&amp;dn=Whose+Line+is+it+Anyway%3F+Music+MP3s&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"evildevil97","files":739,"time":1365620740,"description":"Hello, hello! This is a complete collection of musical games from both versions of Whose Line is it Anyway?. There are also non-Whose Line songs included, from the cast. This includes Drew Carey's Improv-A-Ganza.\n\nAll non-Whose Line games (except for those that are similiar to WLiiA games. Mostly Song Styles) are at the bottom, under the label &quot;Xtra&quot;.\n\nThis is also the first torrent I've ever compiled and uploaded anywhere. If this doesn't work, please let me know.\n\nIf this works, I may add an amendment pack later with songs from the new season.\n\nAll in all, there is approximately 1.5 gigs of .mp3s in here. I spent a lot of time in the early 2000s scrounging the internet for a great collection, and I think I've succeeded.\n\nGotta give credit where it's due though. All those who have ripped the videos over the years - Prefect, Third Dimension, and of course, all the scene releases. TinGrin87 and Huzlinefan also helped quite a bit throughout the years with supplying me with some of these files.\n\nEvery musical game to ever be played in almost 20 seasons of Whose Line is included. And then some.\n\nI'm a little bit proud of this pack, so pardon some of my ramblings. Let me know if this works. I'll try to keep this seeded for as long as I possibly can, but my computer is prone to shut down due to overheating, so it may fizzle from time to time. Assuming this torrent works, of course.\n","torrent":{"xt":"urn:btih:76003f4177e4002b180bc7debd4bd76bf68fafa1","amp;dn":"Whose+Line+is+it+Anyway%3F+Music+MP3s","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76003f4177e4002b180bc7debd4bd76bf68fafa1","infoHashBuffer":{"type":"Buffer","data":[118,0,63,65,119,228,0,43,24,11,199,222,189,75,215,107,246,143,175,161]},"announce":[],"urlList":[]}}