{"title":"Precepts For Life With Kay Arthur - 75 Sermons","uid":7275450,"size":919424782,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:760939ef65f3b07e1fab25308ace27d004e08733&amp;dn=Precepts+For+Life+With+Kay+Arthur+-+75+Sermons&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TorrentTracts","files":75,"time":1337265724,"description":"-----------------------------------------------------------\nPRECEPTS FOR LIFE WITH KAY ARTHUR - 75 SERMONS\n-----------------------------------------------------------\n\nKay Arthur is an international Bible Teacher, four-time ECPA Christian Book Award winning author, and co-CEO of Precept Ministries International. Kay has sytematized studying the Bible, developing a set of steps to follow so as to &quot;mine&quot; the details of the given book under study. Being systematized, it is accessible to lay persons, rather than scholars only. Her method has been used by thousands, being taught and utilized in small to medium sized home study groups. This method does not teach anything as to what the book under study teaches, but guides the process of the student discovering what it within it. This method relies heavily on inductive study, the process of building the picture from the details. Her method of Bible study, as well as her Bible teaching, her championing of the Inductive Bible Study Method, and ner national and international media broadcasts have inspired many others to study the Bible methodically.\n\nKay hosts a daily radio, television and online Bible Study Teaching program called Precepts for Life, which walks listeners through the Bible, book-by-book and verse-by-verse, using the Inductive Bible Study Method. Precepts for Life has an audience reach of over 75 million households and broadcasts to over 30 countries. Precepts for Life was voted Best Television Teaching Program for 2004 and 2009 by the National Religious Broadcasters.\n\nThis torrent contains 75 messages with each running for about twenty five or so minutes in length.  Details of all 75 topics can be found in the thread further below.\n\nGod Bless,\nTorrentTracts - May 2012\n","torrent":{"xt":"urn:btih:760939ef65f3b07e1fab25308ace27d004e08733","amp;dn":"Precepts+For+Life+With+Kay+Arthur+-+75+Sermons","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"760939ef65f3b07e1fab25308ace27d004e08733","infoHashBuffer":{"type":"Buffer","data":[118,9,57,239,101,243,176,126,31,171,37,48,138,206,39,208,4,224,135,51]},"announce":[],"urlList":[]}}