{"title":"Half-Life 2 - Raising the Bar - Behind the Scenes Look (Art Chro","uid":5586618,"size":47095757,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:77788a7790abb010ac32631361b0958689cc11d6&amp;dn=Half-Life+2+-+Raising+the+Bar+-+Behind+the+Scenes+Look+%28Art+Chro&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1274718093,"description":"Half-Life 2 - Raising the Bar - Behind the Scenes Look (Art Chronicle, Interviews, etc.)\n\nAuthor: Valve Corporation, David SJ Hodgson\nLanguage: English\nSubject(s): Game design\nPublisher: Prima Games\nPublication date: 2004\nPages: 288\nISBN: 0-7615-4364-3\nOCLC Number: 320227788\nLC Classification: GV1469.25.H355 H35 2004\n\n\nHalf-Life 2: Raising the Bar - A Behind the Scenes Look: Prima's Official Insider's Guide is a coffee table book published by Prima Games in November 2004, comprising a collection of images chronicling the development of, but not limited to: Half-Life 2, Counter-Strike and Half-Life, all of which are developed by Valve Corporation. It also includes notes on the design of the game, information relating to voice actors and other areas. It was written by David Hodgson.\nThe book has been discontinued and has thus become a collectible item.\n\nThe book is divided up into two main sections with a foreword by Valve Corporation founder Gabe Newell. The two sections, titled: &quot;Investigation 1: Anomalous Materials&quot; and &quot;Investigation 2: Unexpected Interference&quot; are references to the opening levels of the Half-Life video game. The first section chronicles the evolution of the first Half-Life, containing much concept art and character designs: the various iterations of Gordon Freeman for example. It contains information relating to the mod scene that developed in the game's wake and the subsequent retail release of iconic mods, Counter-Strike being the most famous. The second section deals with the long development of Half-Life 2 containing much concept art. It also contains chapters dealing with the creation and design of the main characters, and their real life counterparts.","torrent":{"xt":"urn:btih:77788a7790abb010ac32631361b0958689cc11d6","amp;dn":"Half-Life+2+-+Raising+the+Bar+-+Behind+the+Scenes+Look+%28Art+Chro","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"77788a7790abb010ac32631361b0958689cc11d6","infoHashBuffer":{"type":"Buffer","data":[119,120,138,119,144,171,176,16,172,50,99,19,97,176,149,134,137,204,17,214]},"announce":[],"urlList":[]}}