{"title":"Spandex Tights 001 (1994) (Talon-Novus) [NVS-D]","uid":9191612,"size":66689602,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:7864cc408371ec3f98177b98640809126e86b2c5&amp;dn=Spandex+Tights+001+%281994%29+%28Talon-Novus%29+%5BNVS-D%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"blackcanary","files":-1,"time":1384393563,"description":"English | CBR | 34 Pages\n\nSpandex Tights #1\nPublisher:  Lost Cause Productions\nPublication Date:  September 1994\n\nWriter:  Bryan J.L. Glass\nPenciler:  Sky Owens\nInker:  Chris Fry\nScreens and Tones:  Priscilla Costello\nLetterer:  Jonathan Caldori\nCover:  Adam Hughes\n\nThe Aerobic Duo has an odd history in comics, indeed.  They were created by writer Bryan J.L. Glass and artist Michael Avon Oeming.  Always an independent comic, it originally went by the title &quot;Lycra Woman &amp; Spandex Girl&quot;.  It was a direct spoof on the 1976 Electra Woman &amp; Dyna Girl segments of the &quot;Krofft Supershow&quot; TV series.  That, in turn, was a play on the campy 1966 &quot;Batman&quot; TV series.\n\nAlthough not everyone would understand the reference to the short lived Electra Woman &amp; Dyna Girl, EVERYONE got the fact that it was a satire on comic book super heroines.  It was not a porno comic by any means, but it was most certainly suggestive and did all but show the women naked or committing sexual acts.  First and foremost, the series was meant to be funny.\n\nJust as &quot;Lycra Woman &amp; Spandex Girl&quot; was really starting to catch on with readers, the DuPont corporation took Comic Zone to court over what they considered bad use of the &quot;Lycra&quot; name that they trademarked.  The lawsuit ended with Comic Zone losing, and having to destroy all back stock of the &quot;Lycra Woman &amp; Spandex Girl&quot; comics.  That makes finding these first seven issues of the Aerobic Duo nearly impossible to find.  Some issues are much harder to find than others.  Issue #5, dubbed &quot;Jurassic Dinosaur Special&quot;, is the easiest to find.\n\nWhat came next were cameo appearances in Antarctic Press' &quot;Knightmare&quot; series.  These are okay if you like the Aerobic Duo, but that's about it.  They just don't fit in with the &quot;Knightmare&quot; series.  The Aerobic Duo really came into their own with Lost Cause Productions, under the title &quot;Spandex Tights&quot;.  Still called the Aerobic Duo, the name of Lycra Woman was changed to Flex Woman.  These were all original stories.  The &quot;Lycra Woman &amp; Spandex Girl&quot; series never saw reprint.  Why?  Surely the name of Lycra could have just been switched to Flex in all those past issues.  Truth is, creator Bryan Glass was not overly thrilled with the quality of the &quot;Lycra Woman &amp; Spandex Girl&quot; series.  He found those stories a bit too perverse, almost dirty, and the artwork cramped and rushed.  So he decided to just restart the Aerobic Duo.\n\nThe comics DID get better and better, and everything was kept about the same except for the change in Lycra's name.  Many of the villains from the original era appeared in this new wave.  A bigger focus seemed to be put on plucky, teenaged Spandex Girl than team leader Flex Woman.  The sexual insinuations were toned down for the sake of better stories.\n\nThanks goes to Talon for this release.\n\nDon't know how to view this comic book?  Use CDisplayEx or another comic book reader application. &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/8956400&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/8956400&lt;/a&gt;","torrent":{"xt":"urn:btih:7864cc408371ec3f98177b98640809126e86b2c5","amp;dn":"Spandex+Tights+001+%281994%29+%28Talon-Novus%29+%5BNVS-D%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7864cc408371ec3f98177b98640809126e86b2c5","infoHashBuffer":{"type":"Buffer","data":[120,100,204,64,131,113,236,63,152,23,123,152,100,8,9,18,110,134,178,197]},"announce":[],"urlList":[]}}