{"title":"VOX 2.7.3 - 3000 Unlocked Stations Radio","uid":13577398,"size":20007657,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:7939a42c1681f37f021ccde5b1e71ef02b262aae&amp;dn=VOX+2.7.3+-+3000+Unlocked+Stations+Radio&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zerocoolroot","files":1,"time":1455725693,"description":"Este aplicativo tem 3000 Estações de Rádio Desbloqueados.\r\n\r\nAssim como a maioria, ele também se integra ao iTunes, sendo possível reproduzir tudo a sua biblioteca por ele. Contudo, o VOX vai além, oferecendo a possibilidade de reproduzirmos arquivos ALAC (Apple Lossless Audio Codec), FLAC (Free Lossless Audio Codec), AAC (Advanced Audio Coding), OGG e, é claro, MP3.\r\n\r\nOutros recursos de destaque do reprodutor incluem sincronização com o serviço musical Last.fm, suporte a mais de 3.000 rádios online (desbloqueadas via compra dentro do app), busca automática de capas de álbuns através do MusicBrainz e do Last.fm, controle de músicas pelo teclado do Mac e pelos botões dos fones de ouvido e controle remoto da Apple, visualização das capas no próprio ícone do app (Dock), pause automático ao desconectar um fone do computador, suporte a notificações e ao AirPlay, capacidade de reproduzir músicas armazenadas em rede/drives externos, entre outras coisa.\r\n\r\n---------------------------------------------------------------------------------\r\n\r\nTranslated by Google Translator\r\n\r\nThis application has unlocked 3000 Radio Stations.\r\n\r\nLike most, it also integrates with iTunes, and you can play all your library for him. However, the VOX goes further, offering the ability to reproduce files ALAC (Apple Lossless Audio Codec), FLAC (Free Lossless Audio Codec), AAC (Advanced Audio Coding), OGG and of course MP3.\r\n\r\nOther player's outstanding features include synchronization with Last.fm music service, support more than 3,000 online radio (unlocked via purchase within the app), automatic covers search albums by MusicBrainz and Last.fm, music control the Mac keyboard and the buttons on the headphones and remote control Apple covers of viewing the app icon itself (Dock), automatic pause when you disconnect a computer headset, support notifications and AirPlay, ability to play music stored network / external drives, among other things","torrent":{"xt":"urn:btih:7939a42c1681f37f021ccde5b1e71ef02b262aae","amp;dn":"VOX+2.7.3+-+3000+Unlocked+Stations+Radio","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7939a42c1681f37f021ccde5b1e71ef02b262aae","infoHashBuffer":{"type":"Buffer","data":[121,57,164,44,22,129,243,127,2,28,205,229,177,231,30,240,43,38,42,174]},"announce":[],"urlList":[]}}