{"title":"World Religions (14 Books) {BBS}","uid":7360957,"size":93435545,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:796902d16a5b5b0fe04d56573f61e5c5bd6d3716&amp;dn=World+Religions+%2814+Books%29+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1339957191,"description":"                This Torrent Contains 14 Books In Pdf Format\n\n************************************************************************\n\n\n1)African Traditional Religion (World Religions by Aloysius Muzzanganda Lugira, Joanne O'Brien and Martin Palmer (Chelsea House, 2009)Pdf\n\n2)Baha'i Faith (World Religions by Paula Hartz, Joanne O'Brien and Martin Palmer (Chelsea House 2009)Pdf\n\n3)Buddhism (World Religions  by Madhu Bazaz Wangu, Joanne O'Brien and Martin Palmer (Chelsea House, 2009)Pdf\n\n4)Catholicism &amp; Orthodox Christianity (World Religions  by Stephen F. Brown, Khaled Anatolios and Joanne O'Brien (Chelsea House, 2009)Pdf\n\n5)Confucianism (World Religions  by Dorothy Hoobler, Thomas Hoobler and Joanne O'Brien (Chelsea House, 2009)Pdf\n\n6)Daoism (World Religions by Paula R. Hartz, Joanne O'Brien and Martin Palmer (Chelsea House,2009)Pdf\n\n7)Hinduism (World Religions  by Madhu Bazaz Wangu, Joanne O'Brien and Martin Palmer (Chelsea House, 2009)Pdf\n\n8)Islam (World Religions  by Matthew S. Gordon, Joanne O'Brien and Martin Palmer (Chelsea House,2009)Pdf\n\n9)Judaism (World Religions by Martha A. Morrison, Stephen F. Brown and Joanne O'Brien (Chelsea House, 2009)Pdf\n\n10)Native American Religions (World Religions  by Paula R. Hartz, Joanne O'Brien and Martin Palmer Chelsea House, 2009)Pdf\n\n11)Protestantism (World Religions (Facts on by Stephen F. Brown, Joanne O'Brien and Martin Palmer (Chelsea House,2009)Pdf\n\n12)Shinto (World Religions  by Paula R. Hartz, Joanne O'Brien and Martin Palmer (Chelsea House,, 2009)Pdf\n\n13)Sikhism (World Religions by Nikky-Guninder Kaur Singh, Joanne O'Brien and Martin Palmer Chelsea House, 2009Pdf\n\n14)Zoroastrianism (World Religions by Paula R. Hartz, Joanne O'Brien and Martin Palmer (Chelsea House, 2009)Pdf\n","torrent":{"xt":"urn:btih:796902d16a5b5b0fe04d56573f61e5c5bd6d3716","amp;dn":"World+Religions+%2814+Books%29+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"796902d16a5b5b0fe04d56573f61e5c5bd6d3716","infoHashBuffer":{"type":"Buffer","data":[121,105,2,209,106,91,91,15,224,77,86,87,63,97,229,197,189,109,55,22]},"announce":[],"urlList":[]}}