{"title":"Panic At The Disco - Pretty. Odd - 2008 - Jacl3","uid":4086967,"size":35182503,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:79bd506defc4428f812b76678c347bf56cf0591d&amp;dn=Panic+At+The+Disco+-+Pretty.+Odd+-+2008+-+Jacl3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Jacl3","files":17,"time":1205865842,"description":"Pretty. Odd. is the second studio album by rock band Panic at the Disco, to be released in the United Kingdom on March 24, 2008, the United States on March 25, 2008 and March 29 in Australia on the record label Fueled by Ramen. The first single from the album is &quot;Nine in the Afternoon&quot;.\n\n\nProduction and marketing\nPanic at the Disco began to create their follow up to A Fever You Can&amp;#039;t Sweat Out after being on tour for roughly two years, with no new material to perform. In January 2007 the band went into &quot;hibernation&quot; in a cabin (just outside the strip), as they began writing new material for the next six months for a planned fall 2007 release. On July 7, 2007 they performed the song &quot;It&amp;#039;s True Love&quot; live during their first performance since going into writing, later that night however the band decided that they didn&amp;#039;t like the direction the music had gone and scrapped all the songs they had written (which was roughly about 3/4 an album, as they were almost done recording).\n\nA month later Panic introduced two newly written songs, the tentatively entitled &quot;Middle of Summer&quot; (later changed to &quot;When the Day Met the Night&quot;), and &quot;Nine in the Afternoon&quot;. In December, a part of &quot;Nine in the Afternoon&quot; was played on an episode of the television show Heroes. Panic then began viral marketing, building puzzles on their official website. For about two weeks the puzzle gave snippets from an unknown song, along with the caption &quot;YOU DONT HAVE TO WORRY...&quot;. On January 1, 2008, the snippets finally were revealed to be part of a new song entitled &quot;We&amp;#039;re So Starving&quot;. A rough version of this song was then released for listening on their official MySpace page, but was later pulled with the release of &quot;Nine in the Afternoon&quot;. A review from NME magazine was published on the internet with descriptions of each song. These reviews show the immensely different direction that Panic have taken with their new album.\n\nThe band announced the title of the new album, Pretty. Odd. The title comes from a line from the song &quot;That Green Gentlemen.&quot; &quot;Things are shaping up to be pretty odd/ Little deaths in musical beds.&quot; Through their website on January 9, and dropped the &quot;!&quot; from their band name at the same time. They&amp;#039;ve responded to this by saying &quot;We&amp;#039;ve just traded the exclamation point for a few periods.&quot; [2] They announced the next day that they would be headlining the Honda Civic Tour in support of the album. The band then began a second puzzle[3] on January 17, challenging fans to find puzzle pieces scattered throughout Panic-related websites, in order to reveal the album cover. The cover was officially unraveled on January 22; four days later, a new scavenger hunt was hidden on the official site, revealing the tracklist of the album and offering a prize to the three who could find all 15 song titles first. This was completed later that day.\n\nOn January 28 the winners were revealed. That very same day, the band posted the final version of &quot;Nine in the Afternoon&quot; on their MySpace page. The band also revealed on their official site they were releasing a Deluxe Edition of Pretty. Odd. along with a version with alternate artwork. iTunes made these editions available for pre-order on January 29, 2008.\n\nOn February 10, the video for &quot;Nine in the Afternoon&quot; was premiered on mtv.com. The day after it premiered, Panic at the Disco got to work on making the video for &quot;That Green Gentlemen&quot;.\n\nOn February 23, Panic at the Disco hosted a private event with fan club members at The Fillmore New York at Irving Plaza in New York City. The band held a Q&amp;A session with the fans and those in attendance got to hear for the first time three new songs: &quot;She&amp;#039;s a Handsome Woman&quot;, &quot;That Green Gentlemen&quot;, and &quot;Mad as Rabbits&quot;. A poster for the event featured the Wal-Mart Soundcheck logo,[citation needed] making it possible that the performance will be released to the general public in the future.\n\nOn March 6, it was announced that Pretty. Odd. would be on MTV/VH1&amp;#039;s The Leak on March 18. Short ringtone previews of the songs were accidentally leaked for a short while on the US Cellular webpage.[1]\n\nOn March 11, a teaser for the &quot;Mad as Rabbits&quot; video was put on Fueled by Ramen&amp;#039;s YouTube channel making it a digital single since it will exclusively be available through iTunes. It also features lead guitarist Ryan Ross sharing lead vocals with regular singer Brendon Urie. Ross also sings lead vocals in &amp;#039;Behind the Sea&amp;#039;.\n\nOn March 18, MTV Canada put the album on its album showcase feature, The Leak.\n\n\n[edit] Track listing\n&quot;We&amp;#039;re So Starving&quot; - 1:21 \n&quot;Nine in the Afternoon&quot; - 3:11 \n&quot;She&amp;#039;s a Handsome Woman&quot; - 3:12 \n&quot;Do You Know What I&amp;#039;m Seeing?&quot; - 4:14 \n&quot;That Green Gentlemen&quot; - 3:15 \n&quot;I Have Friends in Holy Spaces&quot; - 1:56 \n&quot;Northern Downpour&quot; - 4:07 \n&quot;When the Day Met the Night&quot; - 4:53 \n&quot;Pas de Cheval&quot; - 2:39 \n&quot;The Piano Knows Something I Don&amp;#039;t Know&quot; - 3:43 \n&quot;Behind the Sea&quot; - 3:33 \n&quot;Folkin&amp;#039; Around&quot; - 1:55 \n&quot;She Had the World&quot; - 3:47 \n&quot;From a Mountain in the Middle of the Cabins&quot; - 3:02 \n&quot;Mad as Rabbits&quot; - 3:48 ","torrent":{"xt":"urn:btih:79bd506defc4428f812b76678c347bf56cf0591d","amp;dn":"Panic+At+The+Disco+-+Pretty.+Odd+-+2008+-+Jacl3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"79bd506defc4428f812b76678c347bf56cf0591d","infoHashBuffer":{"type":"Buffer","data":[121,189,80,109,239,196,66,143,129,43,118,103,140,52,123,245,108,240,89,29]},"announce":[],"urlList":[]}}