{"title":"Brittown (2008) vintage Triumph documentary.mp4","uid":7240380,"size":769722394,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7adfa4dd007cdf673222bcd2afa3bcf0444eb16f&amp;dn=Brittown+%282008%29+vintage+Triumph+documentary.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"V100","files":-1,"time":1336118958,"description":"    Replay Video Capture of a streaming video, ripped with Handbrake. Quality like VHS w/some minor jerkiness. 84 minutes. Closing sequence after credits. $16.50 on E-bay. Free to you. I'll delete this when someone comes up with a better rip (DVD). Until then please help seed to at least 1.0. Your peers have the same interests as you...\n\nVideo: MPEG4 Video (H264), 1,050 Kbps, 768x424 (19:6), 29.97fps \nAudio: AAC 44100Hz stereo 159Kbps \nOverall bit rate: 1,215 Kbps \n \n\n\nFrom IMDB:\n    Brittown - a motorcycle documentary featuring Meatball from the Hell On Wheels bike shop in Anaheim, California. As a master mechanic, vintage Brit bike connoisseur and dirt-track racer, Meatball splits his time between family, his shop and his rock band Smiling Face Down. Brittown joins Meatball for several months as he heads to races, plays gigs and uses all his skill to turn an old 650 Triumph Bonneville motor into a 130 mph road-ready screamer.\n\n\n\n\nFrom Bikerlinkz:\n    Brittown: a British motorcycle documentary film features legendary underground mechanic and Britbike connoisseur &quot;Meatball&quot; from the Hell On Wheels bike shop in Anaheim, CA as he eats, drinks, and sleeps British iron; using all his skill to transform an old 650 Triumph Bonneville motor into a barely-legal road racer.\n\n    Embracing the legacy of Steve McQueen, Meatball runs his old BSA in vintage motocross races, flies down the Willow Springs raceway on his Norstar, and conquers the So Cal freeways with the No Gooders motorcycle club while still finding time for his family and his rock band Smiling Face Down.\n\n   From Scott Di Lalla and Zack Coffman, directors of the award-winning custom motorcycle documentary Choppertown comes a second intimate inside look at biker culture.\nWith more skoots, grease, and honeys than you can shake a stick at,\nBrittown is a true-life adventure not to be missed! &lt;a href=&quot;\nhttp://www.bikerlinkz.com/bilder/dvd/dvd.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.bikerlinkz.com/bilder/dvd/dvd.html&lt;/a&gt;\n","torrent":{"xt":"urn:btih:7adfa4dd007cdf673222bcd2afa3bcf0444eb16f","amp;dn":"Brittown+%282008%29+vintage+Triumph+documentary.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7adfa4dd007cdf673222bcd2afa3bcf0444eb16f","infoHashBuffer":{"type":"Buffer","data":[122,223,164,221,0,124,223,103,50,34,188,210,175,163,188,240,68,78,177,111]},"announce":[],"urlList":[]}}