{"title":"Assepoester 3 Terug in de tijd2007/Audio-ENG+Ned/NLSUBS","uid":5149371,"size":4469100713,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:7bab99374a75eb81f5b23c835a5f965a11a641bf&amp;dn=Assepoester+3+Terug+in+de+tijd2007%2FAudio-ENG%2BNed%2FNLSUBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"NLUPPER","files":-1,"time":1257462411,"description":"Assepoester 3 Terug in de tijd\n\nAlternatieve titel, Cinderella III: A Twist in Time (2007) \n\n\n\nVerenigde Staten\nAnimatie / Familie\n\nHet is precies een jaar geleden dat Assepoester en de prins zijn getrouwd.\nOm dit te vieren houden ze een picknick in het bos samen met de fee en de muizen.\nZe worden echter gezien door Anastasia, Assepoesters voormalige stiefzuster.\nZe steelt de toverstaf van de fee en brengt die naar haar moeder, mevrouw Tremaine. Deze ontdekt al snel hoe ze de staf kan gebruiken wanneer ze de fee er per ongeluk mee in steen verandert. Ze gebruikt de magie om de tijd terug te draaien naar het moment dat de hertog hun huis bezocht met het glazen muiltje, en past het muiltje op magische wijze aan zodat het Anastasia past. Anastasia wordt nu tot de bruid van de prins gemaakt en Assepoester blijft met niets achter.\nAssepoester is ervan overtuigd dat de prins zich haar nog wel zal herinneren als hij haar ziet en volgt haar stieffamilie naar het paleis.\nTremaine gebruikt haar magie echter om de prins Assepoester te laten vergeten.\nBovendien laat ze Assepoester arresteren en beveelt de wachters haar te verbannen uit het koninkrijk. De muizen besluiten hierop in te grijpen.\nZe tonen de prins het andere muiltje dat Assepoester nog bij zich had om hun verhaal te bevestigen.\nHij reist Assepoester achterna en kan voorkomen dat ze wordt verbannen.\nHet ware plan van Tremaine wordt onthuld en de koning beveelt om haar te laten arresteren.\nTremaine heeft nog een troef achter de hand. Ze verandert Anastasia in een dubbelgangster van Assepoester, en zet de echte Assepoester gevangen in een duivelse koets samen met Tom en Pieter. Met veel moeite kunnen de drie ontkomen en haasten zich naar het paleis. Daar is de bruiloftsceremonie tussen de prins en de valse Assepoester al aan de gang. Anastasia krijgt echter steeds meer last van haar geweten, en onthult wie ze werkelijk is. Tremaine probeert haar en Assepoester in padden te veranderen, maar de prins kaatst de spreuk terug met zijn zwaard waardoor Tremaine zelf een pad wordt. Anastasia gebruikt de staf om zichzelf en de fee weer normaal te maken, waarna de fee de tijd herstelt naar hoe alles hoorde te zijn.\n\nINFO\n\nMM...............: http://www.moviemeter.nl/film/39759\n\nIMDB.............: http://www.imdb.com/title/tt0465940/\n\n\nDistributie......: Walt Disney Pictures\nUitgebracht......: 6 februari 2007\nMenu.............: Ja\nExtras...........: Ja\nNederlands en Engels gesproken\nOndertiteling....: Nederlands\nCategorie........: Beeld\nFormaat..........: DVD5\nBron.............: Retail\n","torrent":{"xt":"urn:btih:7bab99374a75eb81f5b23c835a5f965a11a641bf","amp;dn":"Assepoester+3+Terug+in+de+tijd2007%2FAudio-ENG%2BNed%2FNLSUBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7bab99374a75eb81f5b23c835a5f965a11a641bf","infoHashBuffer":{"type":"Buffer","data":[123,171,153,55,74,117,235,129,245,178,60,131,90,95,150,90,17,166,65,191]},"announce":[],"urlList":[]}}