{"title":"Lady for a Day (1933)","uid":4688055,"size":734040064,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7bc43005477f972632b5f9435eb34dc62d639ceb&amp;dn=Lady+for+a+Day+%281933%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Willams","files":1,"time":1233302875,"description":"Lady for a Day (1933)\n\n\nLady for a Day is a 1933 film which was nominated for the Academy Award for Best Picture. It was written by Robert Riskin, based on the Damon Runyon story Madame la Gimp. The film was directed by Frank Capra.\n\nThe movie was remade as Pocketful of Miracles in 1961, starring Bette Davis and Glenn Ford.\n\nIn the movie, Apple Annie (May Robson) is a street peddler who had sent away her daughter as a young child to be raised in Europe, letting her believe that Annie was a member of New York high society. Now her grown-up daughter Louise (Jean Parker) is engaged to marry Carlos Romero (Barry Norton), a Spanish aristocrat. They are coming for a visit and Annie must somehow maintain the masquerade or the fiancÃƒÂ©'s father, the Count (Walter Connolly), will not give his blessing to the marriage. Dave the Dude (Warren William), a superstitious gambler who considers her his good luck charm, is talked into providing a luxury apartment, clothes and a husband, 'Judge' Henry Blake (Guy Kibbee) (a pool hall hustler), to deceive her guests.\n\nIMDB: 7.6/10\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0024240/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0024240/&lt;/a&gt;\n\n\n*********************************** FREAKYFLICKS ************************************\n\nFreakyFlicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe FreakyFlicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n   &lt;a href=&quot;\nhttp://freakyflicks.proboards54.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://freakyflicks.proboards54.com&lt;/a&gt;\n\nIf we all seed just 1:1, give at least what we take, this torrent will NEVER DIE\n\n*************************************************************************************\t","torrent":{"xt":"urn:btih:7bc43005477f972632b5f9435eb34dc62d639ceb","amp;dn":"Lady+for+a+Day+%281933%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7bc43005477f972632b5f9435eb34dc62d639ceb","infoHashBuffer":{"type":"Buffer","data":[123,196,48,5,71,127,151,38,50,181,249,67,94,179,77,198,45,99,156,235]},"announce":[],"urlList":[]}}