{"title":"Bernard Lewis-What Went Wrong ?","uid":4776118,"size":2259485,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7f08b71b561821df1263b4e5f51cd77f094cc8cd&amp;dn=Bernard+Lewis-What+Went+Wrong+%3F&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"boutros_0","files":1,"time":1237219951,"description":"In the fields of Islamic and Middle Eastern history, few people are as prominent and prolific as Lewis, emeritus professor at Princeton. This time around, however, he has written a book with an inconsistent argument and an erratic narrative consisting of recycled themes from his earlier books, a work that sheds no new light on Middle Eastern history or on the events of September 11. His general argument is that Islamic civilization, once flourishing and tolerant, has in modern times become stagnant. This, he contends, has led to considerable soul-searching among Muslims, who ask themselves, &quot;What went wrong?&quot; But while sometimes the author states that there is a critical inquiry into the source of economic weakness in Muslim civilizations, other times he says that, instead of looking into the mirror, Muslims have blamed their problems on Europeans or Jews and thus fed their sense of victimhood. In medieval times, Lewis notes, Muslim civilization transmitted scientific ideas into Europe. But after offering intriguing examples of Muslim physicians and astronomers on the cutting edge in the 13th to 15th centuries, this chapter abruptly ends by stating that in modern times the roles have reversed, leaving the reader baffled over what between the 15th and the 20th centuries may have contributed to this reversal. Thus, the book raises more questions than it answers. Furthermore, Lewis discounts the effects of various decisions made by European and American colonial powers that negatively impacted the development of a democratic political community and a viable economy in the Middle East. Lewis's earlier books, such as The Muslim Discovery of Europe and The Middle East and the West, are much more useful for anyone seeking to understand the historical dynamic between these two parts of the world. First serial to Atlantic Monthly.","torrent":{"xt":"urn:btih:7f08b71b561821df1263b4e5f51cd77f094cc8cd","amp;dn":"Bernard+Lewis-What+Went+Wrong+%3F","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f08b71b561821df1263b4e5f51cd77f094cc8cd","infoHashBuffer":{"type":"Buffer","data":[127,8,183,27,86,24,33,223,18,99,180,229,245,28,215,127,9,76,200,205]},"announce":[],"urlList":[]}}