{"title":"ACDC - T.N.T. (1975) WMA320","uid":6088885,"size":104105849,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7f77fdac5e218b586c5897dda57d3276b3237dcb&amp;dn=ACDC+-+T.N.T.+%281975%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"MARCELODRGZ","files":-1,"time":1294460303,"description":"Actually this was NOT the first release by AC/DC. Their first release was actually the 1974 Australia-only 8-song release of the album &quot;High Voltage&quot; (which oddly did not feature the track of the same name), which is certainly not the same album as the American release of the same name. As a matter of fact the American &quot;High Voltage&quot; release is basically the same as &quot;T.N.T.&quot; with a couple of tracks from the 1974 H.V. thrown on. BUT!!! it was &quot;T.N.T.&quot; that absolutely broke AC/DC, it was 'THE' album, and is a quintessential MUST-HAVE for any AC/DC fanatic. In 1975 this was THE album that shook Australian society to its roots with it's pure brashness: Parents hated AC/DC, mothers were locking up their daughters, meantime their sons were toughing up, hang-banging along to T.N.T. doing Bon or Angus impersonations and screaming &quot;Oy!&quot; It happened during that horrendously crappy campy era of tacky glam hairstyle rock in the mid-70s, a time when we really NEEDED a T.N.T. as a way of smashing all that glam crap out of the way. With T.N.T. the Australian music scene opened right up to hard raw guitar rock. Following in T.N.T's wake in Australia the following year, 1976, came Brisbane band The Saints with &quot;I'm Stranded&quot; and Sydney band Radio Birdman's Stooges-inspired &quot;Burn My Eye&quot;... suddenly Molly's &quot;Countdown&quot; show, ABBA and K-Tel records were blown right into the weeds by the new raw power of hard-core - and there you had a whole &quot;new music&quot;! T.N.T is a piece of pivotal music history. I think T.N.T. must be ONE OF THE MOST IMPORTANT PRE-PUNK ALBUM EVER! \n\nby A CUSTOMER\n\nTRACKLIST:\n\n01 - It's A Long Way To The Top (If You Wanna Rock And Roll).wma      \n02 - Rock And Roll Singer.wma                                         \n03 - The Jack.wma                                                     \n04 - Live Wire.wma                                                    \n05 - T.N.T..wma                                                       \n06 - Rocker.wma                                                       \n07 - Can I Sit Next To You Girl.wma                                   \n08 - High Voltage.wma                                                 \n09 - School Days.wma \n\nWMA 320Kbps 44100Hz STEREO","torrent":{"xt":"urn:btih:7f77fdac5e218b586c5897dda57d3276b3237dcb","amp;dn":"ACDC+-+T.N.T.+%281975%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f77fdac5e218b586c5897dda57d3276b3237dcb","infoHashBuffer":{"type":"Buffer","data":[127,119,253,172,94,33,139,88,108,88,151,221,165,125,50,118,179,35,125,203]},"announce":[],"urlList":[]}}