{"title":"FreedomFest Las Vegas 2002-2008","uid":7305145,"size":5217335870,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:8006bb61906b2e3ee61af3bfcd5b04bf8be8c110&amp;dn=FreedomFest+Las+Vegas+2002-2008&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Freedom37","files":-1,"time":1338168575,"description":"ABOUT\n\nFreedomFest is an annual festival where free minds meet to celebrate &quot;great books, great ideas, and great thinkers&quot; in an open-minded society. It is independent, non-partisan, and not affiliated with any organization or think tank. Founded and produced by Mark Skousen since 2002, FreedomFest invites the &quot;best and the brightest&quot; from around the world to talk, strategize, socialize, and celebrate liberty. FreedomFest is open to all and is purely egalitarian, where speakers, attendees, and exhibitors are treated as equals.\n\n\nIf you have never attended FreedomFest, you are in for a treat. FreedomFest is an intense three days. It's different from any conference you have ever attended. Have you been to a seminar where you were bored by the speaker? Well, there's never a dull moment at FreedomFest, because we offer seven sessions simultaneously, including discussions and debates about philosophy and history; arts and entertainment; public policy and geo-politics; science and technology; economics and finance; law and religion. (For those who wish to attend more than one session at a time, we tape all forums and workshops and made them available for sale during the festival. We sell a lot of audio CDs!) We have separate forums on philosophy, science and technology, art and entertainment, economics, geo-politics, finance, and literature, among others. There's a debate room, where a new hot topic is debated every hour and general sessions where we hear world-renown experts. No other conference in the world offers these opportunities.\n\n\nWEBSITES\n\nFor more information or to attend the next conference, visit http://freedomfest.com/\n\nFreedomFest on Twitter:\n\nFreedomFest on Facebook:\n\nCSPAN features select video from past FreedomFests: http://www.c-spanvideo.org\n\n\nPURCHASE FREEDOMFEST\n\nCd's &amp; Dvd's from past FreedomFests can be purchased at: http://www.miracleofamerica.com/","torrent":{"xt":"urn:btih:8006bb61906b2e3ee61af3bfcd5b04bf8be8c110","amp;dn":"FreedomFest+Las+Vegas+2002-2008","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8006bb61906b2e3ee61af3bfcd5b04bf8be8c110","infoHashBuffer":{"type":"Buffer","data":[128,6,187,97,144,107,46,62,230,26,243,191,205,91,4,191,139,232,193,16]},"announce":[],"urlList":[]}}