{"title":"Free Radicals: A History of Experimental Film","uid":9621691,"size":3944800480,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:8037f0c8b3dfbf18c7ef4984600bc9cfbf300c21&amp;dn=Free+Radicals%3A+A+History+of+Experimental+Film&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Frankenchrist","files":13,"time":1392507612,"description":"Free Radicals: A History of Experimental Film\n\nThis feature-length documentary provides a vivid, eye-opening, and appropriately personal introduction to one of the most important, yet perpetually marginalized, realms of filmmaking: avant-garde cinema.\n\nAchieving the near-impossible task of doing justice in a mere 82 minutes to this incredibly rich, varied, and expansive domain, FREE RADICALS is as expertly constructed an introduction to the topic as one could hope for, thanks in large part to the film's privileging of rare interviews with some of the most important filmmakers in the avant-garde tradition (including Jonas Mekas, Peter Kubelka, Stan Brakhage, and Hans Richter), and its inclusion of several films in their entirety. The film's sincere admiration for its subject is best reflected by Chodorov's own description: &quot;I wanted to share a few of the films I love and introduce you to some of the free, radical artists who made them.&quot;\n\n&quot;Named after the experimental film classic by Len Lye, FREE RADICALS is an informative yet above all passionate film essay, as well as a fine introduction to the world of avant-garde film. Using a range of different film formats along the way, Chodorov sketches out the genealogy of avant-garde filmmaking in a playful, yet ultimately very accessible documentary that aims to transmit this legacy to a new audience.\n\n-- ROTTERDAM INTERNATIONAL FILM FESTIVAL\n\nFormat: DVD\nLength: 82 minutes\n\nPLEASE SEED!","torrent":{"xt":"urn:btih:8037f0c8b3dfbf18c7ef4984600bc9cfbf300c21","amp;dn":"Free+Radicals%3A+A+History+of+Experimental+Film","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8037f0c8b3dfbf18c7ef4984600bc9cfbf300c21","infoHashBuffer":{"type":"Buffer","data":[128,55,240,200,179,223,191,24,199,239,73,132,96,11,201,207,191,48,12,33]},"announce":[],"urlList":[]}}