{"title":"A Practical Guide to Teaching and Assessing the ACGME, 2E [PDF][","uid":11805369,"size":6405432,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:80b206d68c7fcfb6b7002a837e9c4fae70f627fd&amp;dn=A+Practical+Guide+to+Teaching+and+Assessing+the+ACGME%2C+2E+%5BPDF%5D%5B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"0xmovva","files":3,"time":1428556882,"description":"TITLE/EDITIONA Practical Guide to Teaching and Assessing the ACGME Core Competencies, Second Edition\nBy: Elizabeth Rider (Author), Ruth Nawotniak (Author)\nPerfect Paperback: 394 pages\nPublisher: HCPro; 2nd edition (June 18, 2010)\nLanguage: English\nISBN-10: 1601467400\nISBN-13: 978-1601467409\nNOTE: This is the standalone ebook and may not include access codes that come packaged with the bound book\n\n\n\n\nTeach, assess, and document the competencies with this best-selling, step-by-step guide.\n\nThis book and downloadable tools provide a fully updated, step-by-step guide to help residency program directors, coordinators, and medical educators teach, assess, and document all six ACGME core competencies. With expanded content from 11 experts in the field, this resource offers best practices, sample tools, and in-depth expert insights for each of the competencies. Moreover, this second edition includes learning activities for each competency, as well as a new chapter on 'the hidden curriculum.'\n\nWhat's new in this edition?\n\n- New chapter examining the 'hidden curriculum' in GME, focusing on ways that the culture of the learning environment influences how residents learn to treat their patients and coworkers, as well as approaches to align the hidden and formal curricula\n- Six new contributing authors who share their best practices for teaching and assessing the core competencies\n- Fully updated reviews of the medical education literature to ensure you have the most up-to-date methods for documenting and measuring resident competency\n- Expanded evaluation tools, forms, and resources.\n\nWith this book and downloadable tools, you will be able to:\n\n- Get the in-depth understanding needed to teach the competencies to faculty and residents\n- Use sample tools, forms, and methodologies as a basis for teaching and assessing the competencies\n- Save time otherwise spent searching for competency-specific articles and resources, synthesizing the information, and developing tools from scratch\n- Master difficult competencies like practice-based learning and improvement and systems-based practice\n- Develop objective measures and evaluations for the traditionally more subjective competencies like professionalism and interpersonal and communication skills\n\nThis resource is organized by competency for your convenience. Each competency chapter includes:\n\n- Definition of the competency and introduction\n- Teaching suggestions\n- Assessment tools\n- Sample forms\n- Curriculum ideas\n\nSave time with best practices, sample tools, and in-depth expert insights into the core competencies. Order your copy today.\n\nWho will benefit?\n\nResidency/fellowship program director, residency/fellowship program coordinator, designated institution official, graduate medical education coordinator, GME administrator, GME committee members and leadership, director of medical education\n\nCheck out what your peers have to say about the first edition:\n\n'A Practical Guide To Teaching and Assessing the ACGME Core Competencies is a succinct and well-organized publication that addresses each competency in its own chapter, making it easy for us to find specifics when updating our program's assessment tools. Not all groups learn by the same method, and in this book each chapter includes basic definitions, multiple strategies to incorporate the competency into the program's curriculum, and different tools to assess the effectiveness.'\n\n\n- Katherine Newsum, Program Coordinator, General Surgery Residency Florida Hospital, Orlando","torrent":{"xt":"urn:btih:80b206d68c7fcfb6b7002a837e9c4fae70f627fd","amp;dn":"A+Practical+Guide+to+Teaching+and+Assessing+the+ACGME%2C+2E+%5BPDF%5D%5B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"80b206d68c7fcfb6b7002a837e9c4fae70f627fd","infoHashBuffer":{"type":"Buffer","data":[128,178,6,214,140,127,207,182,183,0,42,131,126,156,79,174,112,246,39,253]},"announce":[],"urlList":[]}}