{"title":"The Woodcutter: A Novel By Reginald Hill [PDF, ePub, Mobi]","uid":9674174,"size":3937610,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:815877f44f2e5b4ddc43176e8cf3179412da6c45&amp;dn=The+Woodcutter%3A+A+Novel+By+Reginald+Hill+%5BPDF%2C+ePub%2C+Mobi%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xXGalaxyXx","files":-1,"time":1393529221,"description":"---------------------------------------------------------------------------------\n---------------------------------------------------------------------------------\n\nAuthor(s): Reginald Hill\nPublisher: Harper\nDate: 2011\nPages: 341 \nFormat: PDF\nLanguage: English\nISBN-10: 0062060740\nISBN-13: 978-0062060747\nSize: 3.75 MB\n\n---------------------------------------------------------------------------------\nDescription:\n---------------------------------------------------------------------------------\n\nIn a stand-alone psychological thriller from acclaimed mystery master Reginald Hill, a mysterious ex-con returns to his remote childhood home on a deadly hunt for revenge. Combining the chilling atmospheres of Thomas Harris's The Silence of the Lambs, the narrative ingenuity of P.D. James's The Private Patient, and the compelling characterizations of Hill's own Dalziel and Pascoeseries, Hill delivers a frightful, fast-paced study of suspense at its most sinister in The Woodcutter.\n\n---------------------------------------------------------------------------------\nFrom the Back Cover:\n---------------------------------------------------------------------------------\n\nWolf Hadda's life has been a fairy tale. From his humble origins as a Cumbrian woodcutter's son, he has risen to become a hugely successful entrepreneur, happily married to the woman of his dreams.\n\nA knock on the door one morning ends it all. Universally reviled, thrown into prison while protesting his innocence, abandoned by friends and family, Wolf retreats into silence. Seven years later, prison psychiatrist Alva Ozigbo makes a breakthrough. Wolf begins to talk, and under her guidance he is paroled, returning to his family home in rural Cumbria.\n\nBut there was a mysterious period in Wolf's youth when he disappeared from home and was known to his employers as the Woodcutter. And now the Woodcutter is back, looking for the truth - and revenge. Can Alva intervene before his pursuit of vengeance takes him to a place from which he can never come back?\n\nThe Woodcutter is a treat that both lovers of the Dalziel and Pascoe series and newcomers to the always masterful work of Reginald Hill will devour.\n\n---------------------------------------------------------------------------------\nReviews:\n---------------------------------------------------------------------------------\n\nReginald Hill...turns a contemporary crime of greed into a timeless morality tale....Hill's storytelling is its own delight, a fun house of shifting timelines and multiple perspectives.\n\n--New York Times Book Review on The Woodcutter\n\nEvokes the spirit of storytellers from Dumas and Dickens to Jeffery Deaver and Jeffrey Archer.\n\n--Wall Street Journal on The Woodcutter\n\n[A] tour de force.\n\n--People magazine on The Woodcutter\n\nSly, enchanting...[with] strong characters that complement the fast-paced, unpredictable plot.\n\n--Publishers Weekly (starred review)\n\nThere's nothing drab about this dark and compelling novel.\n\n--Kirkus Reviews on The Woodcutter\n\nHe's lost none of his sardonic wit, punch and complexity... The result is an epic, unbeatable mystery.\n\n--Financial Times\n\nHill's plotting...is brilliant, the jokes first-rate, the prose supple: it's his humble awe at the power of the English language that enables him to be a minor master of it.\n\n--Daily Telegraph (London)\n\n---------------------------------------------------------------------------------\nAbout the Author:\n---------------------------------------------------------------------------------\n\nReginald Hill is a native of Cumbria and a former resident of Yorkshire, the setting for his novels featuring Superintendent Dalziel and DCI Pascoe. Their appearances have won him numerous awards, including a CWA Gold Dagger and the Car-tier Diamond Dagger Lifetime Achievement Award. The Dalziel and Pascoe stories have also been adapted into a hugely popular BBC TV series.\n","torrent":{"xt":"urn:btih:815877f44f2e5b4ddc43176e8cf3179412da6c45","amp;dn":"The+Woodcutter%3A+A+Novel+By+Reginald+Hill+%5BPDF%2C+ePub%2C+Mobi%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"815877f44f2e5b4ddc43176e8cf3179412da6c45","infoHashBuffer":{"type":"Buffer","data":[129,88,119,244,79,46,91,77,220,67,23,110,140,243,23,148,18,218,108,69]},"announce":[],"urlList":[]}}