{"title":"Ship.Simulator.Extremes-SKIDROW","uid":5791414,"size":1663093958,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:81bab52a952d8042855b71ec924910e37bbb7efd&amp;dn=Ship.Simulator.Extremes-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"thenoobish","files":-1,"time":1282858013,"description":"Eboy\n\nS   K   i   D   R   O   W\n\n-  T H E   L E A D i N G   F O R C E   -\n\nproudly presents\nShip Simulator: Extremes / Paradox Interactive\n\nRELEASE DATE : 25-08-2010             PROTECTION : Steam + cgr + Serial\nGAME TYPE    : Ship Simulator         DISKS      : 1 DVD\n\nRelease Notes:\n\nThe Skid Rowdies are looking new blood to fill up the ranks.\nWere a professional team of dedicated sceners with big mark\nunder sceners. We believe on the ground idealism of the root\nof the real old school scene. We do all this for fun and\nnothing else. We dont earn anything on our hobby, as we do\nthis for the competition and the heart of what got the scene\nstarted in the mid eighties.\n\nIf you think you got something to offer, then dont hold back\non contacting us as soon as possible.\n\n\ntwice the fun   / double the trouble\n\n\nOn with the game release information:\n\nEver wonder how it feels to sail a half-million-ton\nsupertanker through the perfect storm? To take on illegal\nwhale hunters in the Antarctic? Or to feel the rush of being\npart of the Coast Guard as you evacuate a cruise liner in\ndistress? Ship Simulator Extremes has players take on exciting\nmissions all over the world as they pilot an impressive array\nof vessels and live the stories of real ship captains. With\nmissions based on actual events in realistic environments at\nlocations all over the world, the new Ship Simulator game is\nsure to take you to extremes!\n\nFrom the very hot to the very cold, sail to the most enchanted\nregions in the world. Explore the Antarctic or take in\nbeautiful Bora Bora. Includes famous harbors and locations\nfrom around the world\n\nWide range of vessels to captain, including hovercraft, Coast\nGuard interceptors, mammoth tankers, tugs, cruise liners, and\nmany others\n\nIncludes exciting storylines and missions from all over the\nworld\n\nOfficial Greenpeace license: sail famous Greenpeace ships and\ntake on ecological missions based on real events!\n\nRealistic water and weather system. Sail calm waters or take\non the most extreme weather ever witnessed at sea\n\nOnline multiplayer mode. Sail online with your friends\n\n\nInstall Notes:\n\n1. Unpack release\n2. Mount image or burn it\n3. Install\n4. Copy the content from the SKIDROW folder on the DVD to your\ninstallation directory and overwrite\n5. Type anything at the serial check screen (only needed once)\n6. Play the game\n\nSupport the companies, which software you actually enjoy!\n\n\n\nGreetings:\n\nSalutes to our old Amiga friends from:\n\nFAIRLIGHT - RAZOR 1911 - VISION FACTORY - PARADOX - QUARTEX\nDCS - CRYSTAL - ZENITH - ACCESSION - ALPHA FLIGHT - PRODIGY\nTHE COMPANY - LEGEND - TRSI - ORACLE - ANTHROX - CLASSIC\n\nSalutes to our new friends in:\n\nUNLEASHED - TiNYiSO - BReWErS - RADIKAL - POSTMORTEM - SHOCK\nFAIRLIGHT - CRUDE - VACE - ReUnion - OUTLAWS - GENESIS\n\nLogo and layout by: Eboy/SAE\nLast updated 21/07/2007 by [XXX]","torrent":{"xt":"urn:btih:81bab52a952d8042855b71ec924910e37bbb7efd","amp;dn":"Ship.Simulator.Extremes-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"81bab52a952d8042855b71ec924910e37bbb7efd","infoHashBuffer":{"type":"Buffer","data":[129,186,181,42,149,45,128,66,133,91,113,236,146,73,16,227,123,187,126,253]},"announce":[],"urlList":[]}}