{"title":"Mats Ahlstedt 2016-När inget annat . . . . - Svensk","uid":14662329,"size":558479054,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:824bf8789dbac1f1df9ae27a73d788224ddd23b4&amp;dn=Mats+Ahlstedt+2016-N%26auml%3Br+inget+annat+.+.+.+.+-+Svensk&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"boktoken","files":108,"time":1463775717,"description":"När inget annat återstår av Mats Ahlstedt/2016\r\n\r\nElla Werner är ny profilerare vid Göteborgspolisen. Som första fall får hon ta sig an mordet på en ung man. Ledtrådarna för henne ut till ett ensligt beläget hus på Brännö utanför Göteborg där den excentriske forskaren Egon Guthlin bor.\t\r\n\r\nEgon har utvecklat en banbrytande substans som kan rädda miljoner människor från Alzheimers. Testerna är ytterst lovande, men Egon plågas fortfarande av minnet efter ett misslyckat experiment flera år tidigare. Resultatet den gången var skrämmande. När Egon till slut hittar orsaken är den långt värre än han någonsin kunnat ana.\r\n\r\nSent en kväll får Egons brorsdotter Sandra besök av en ung man som påstår sig vara hennes kusin. Han verkar rädd och vädjar till henne om att släppa in honom, men hon vågar inte öppna dörren. \r\n\r\nSandra kan inte släppa tanken på att hennes farbror kan ha haft en för henne okänd son. För att få reda på hur det förhåller sig söker hon upp honom i hans hem. Men det förflutna kastar mörka skuggor över såväl henne som Egon. Vem ljuger och vem talar sanning? Vad är det mer för hemligheter som Egon bär på? Snart inser Sandra att hennes liv är i fara.\r\n\r\nNär inget annat återstår är en psykologisk thriller om hur girighet och maktbegär kan förvandlas till ren ondska och vilka konsekvenser våra livsval kan få.\r\n\r\nSpeltid: ca 10tim.\r\n\r\nUppläsare: Anna Maria Käll","torrent":{"xt":"urn:btih:824bf8789dbac1f1df9ae27a73d788224ddd23b4","amp;dn":"Mats+Ahlstedt+2016-N%26auml%3Br+inget+annat+.+.+.+.+-+Svensk","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"824bf8789dbac1f1df9ae27a73d788224ddd23b4","infoHashBuffer":{"type":"Buffer","data":[130,75,248,120,157,186,193,241,223,154,226,122,115,215,136,34,77,221,35,180]},"announce":[],"urlList":[]}}