{"title":"Ilayaraja Hits","uid":7673529,"size":1408633354,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8443f76a04df1f1d4441124fdac774c125b1c1cc&amp;dn=Ilayaraja+Hits+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"deathwisher08","files":307,"time":1348639799,"description":"laiyaraaja (born Gnanadesikan on 2 June 1943) is an Indian film composer, singer, and lyricist, mainly in Tamil film Industry and other Indian film industries like Telugu, Malayalam, Kannada, Hindi and Marathi. He is regarded as one of the finest music composers in India. Ilaiyaraaja is also an instrumentalist, conductor, singer, and a songwriter. To date, he has composed over 4500 songs and provided film scores for more than 950 Indian films in various languages in a career spanning more than 30 years, particularly being acclaimed for his background scoring for Indian films. His songs and background score played a very crucial role in the success of many films. He remains one of the most popular composers to have emerged from India.\n\nIlaiyaraaja has been a prominent composer of film music in South Indian cinema since the late 1970s. His works are mainly in Tamil, but has also scored music for numerous films in Telugu, Malayalam, Kannada, Hindi and one in Marathi. He integrated folk lyricism (in Tamil) and introduced broader Western musical sensibilities into the South Indian musical mainstream. A gold medalist in classical guitar from Trinity College of Music, London, in 1993, he became the first Asian to compose a full symphony performed by the Royal Philharmonic Orchestra in London's Walthamstow Town Hall. In 2003, according to a BBC international poll, people from 155 countries voted his composition &quot;Rakkamma Kaiya Thattu&quot; from the 1991 film Thalapathi fourth in the world's top 10 most popular songs of all time. He was also nominated in the Best Indian album Music Awards category at US based Just Plain Folks Music Organization, which is the largest grassroots music organization in the world, and stood third for his &quot;Music Journey: Live in Italy&quot;.\n\nIn the 2000s, he composed a variety of non-film music, including religious and devotional songs, an oratorio, and world music, while shifting his focus to Malayalam films. He is usually referred to by the title Isaignani (Tamil: à®‡à®šà¯ˆà®žà®¾à®©à®¿; English: A man with great knowledge in music), or as The Maestro. He has won four Indian National Film Awards; three for Best Music Direction and one for Best Background Score and is a recipient of the prestigious Padma Bhushan Award from the Government of India. He also received the NTR National Award in 2004.\n\ncourtsey: Wikipedia\n\n\nAbout 307 Greatest Hits Of Ilayaraja","torrent":{"xt":"urn:btih:8443f76a04df1f1d4441124fdac774c125b1c1cc","amp;dn":"Ilayaraja+Hits+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8443f76a04df1f1d4441124fdac774c125b1c1cc","infoHashBuffer":{"type":"Buffer","data":[132,67,247,106,4,223,31,29,68,65,18,79,218,199,116,193,37,177,193,204]},"announce":[],"urlList":[]}}