{"title":"Seal - Kiss From A Rose","uid":4720828,"size":129005572,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:84abbb06937051a7e44575e41fa8b8adacc1a1c3&amp;dn=Seal+-+Kiss+From+A+Rose&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"2nafish","files":-1,"time":1234516138,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Kiss from a Rose&quot; is a song from Seal's second eponymous album Seal (aka Seal II). The song was first released as a single in July 1994. Re-released in 1995, it was included on the Batman Forever film soundtrack, helping it top the charts in the U.S. and Australia.\n\nWritten by Seal, the single &quot;Kiss from a Rose&quot;, the second taken from the &quot;Batman Forever&quot; film soundtrack, topped the U.S. Billboard Hot 100 for one week in August 1995. It also went to #4 on the UK singles chart. The single originally made it to #20 in 1994, but upon being re-released after being featured in the film, it reached the top position. It won two Grammy Awards, for 'Song of the Year' and 'Record of the Year'. It was also nominated for a 1996 MTV Movie Award.\n\nSeal Henry Olusegun Kwassi Olumide Adelo Samuel (born 19 February 1963 in Paddington, London) is a British soul singer and songwriter. His name Olusegun means &quot;God is victorious&quot;. Known professionally by his first name, Seal is known for his numerous international hits and his marriage to supermodel Heidi Klum.\n\nHis second album, also self-titled Seal, was released in 1994. A success, the album featured the singles &quot;Prayer for the Dying&quot; and &quot;Newborn Friend&quot;, later receiving a Grammy nomination for Album of the Year. &quot;Prayer for the Dying&quot; became a minor pop hit in the U.S., peaking at #21 on the Billboard charts. A third single, &quot;Kiss from a Rose&quot;, performed modestly when released but was later featured in the film Batman Forever. &quot;Kiss from a Rose&quot; won a Grammy Award for Record of the Year and Song of the Year in 1996, becoming Seal's best performing single on the US market (it topped the Billboard Hot 100 in late August 1995).\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:84abbb06937051a7e44575e41fa8b8adacc1a1c3","amp;dn":"Seal+-+Kiss+From+A+Rose","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"84abbb06937051a7e44575e41fa8b8adacc1a1c3","infoHashBuffer":{"type":"Buffer","data":[132,171,187,6,147,112,81,167,228,69,117,228,31,168,184,173,172,193,161,195]},"announce":[],"urlList":[]}}