{"title":"Cast - Mother Nature Calls [1997]","uid":9364664,"size":372306168,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:84e18cf3c7bcddd9d864913be1a4ab5f88992c8c&amp;dn=Cast+-+Mother+Nature+Calls+%5B1997%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GenXRock","files":-1,"time":1387389288,"description":"If Cast's debut album All Change was trad-rock at its most joyous, their second album Mother Nature Calls is considerably more problematic. Electing to expand their sound slightly instead of replicating All Change, Cast paints itself into a corner. They haven't abandoned the traditional Brit-pop stylings of their debut, but they've strengthened it with a tougher sound and neo-hippie mysticism that manifests itself not only in John Power's dippy lyrics, but also in trippy instrumental sections. In theory, this is a way out of the trad-rock straitjacket, but in practice it falls flat. The main problem is that Power's melodies aren't nearly as sharp or memorable as they were on the debut; this immediately brings attention toward his lyrics, which are naive and often embarassingly simplistic. Cast also doesn't have enough charisma to save the songs with energetic, distinctive performances when they're flailing. These problems become all the more evident when they do get it right, such as on the shimmering &quot;Guiding Star,&quot; the punchy &quot;She Sun Shines&quot; and the heart-tugging &quot;I'm So Lonely (Calling You Back),&quot; and they have the same sparkling joy that made All Change a delight. But that's a rarity on Mother Nature Calls. When the tunes and attitude are there, such weaknesses are easy to overlook, but since Cast comes up deficient on both counts, Mother Nature Calls is simply a dull listen. (2.5/5)","torrent":{"xt":"urn:btih:84e18cf3c7bcddd9d864913be1a4ab5f88992c8c","amp;dn":"Cast+-+Mother+Nature+Calls+%5B1997%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"84e18cf3c7bcddd9d864913be1a4ab5f88992c8c","infoHashBuffer":{"type":"Buffer","data":[132,225,140,243,199,188,221,217,216,100,145,59,225,164,171,95,136,153,44,140]},"announce":[],"urlList":[]}}