{"title":"Life: A Natural History of the First Four Billion Years_ Kindle","uid":12027067,"size":7339412,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8585f2a2f94327f2faa4addba9d5b9463f5f92c6&amp;dn=Life%3A+A+Natural+History+of+the+First+Four+Billion+Years_+Kindle&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"manav32","files":3,"time":1434501007,"description":"Life: A Natural History of the First Four Billion Years of Life on Earth\nby Richard Fortey for Kindle.\n\n..................................................................\n..................................................................\n\nLife: A Natural History of the First Four Billion Years of Life on Earth is a non-fiction book written by British paleontologist Richard A. Fortey. It was originally published in hardcover in Great Britain by HarperCollins Publishers, under the title Life: An Unauthorised Biography. Fortey used this book to explain how life has evolved over the last four billion years. It discusses evolution, biology, the origin of life, and paleontology. Under its various titles it has become a best-seller; according to WorldCat, it is in over a thousand public libraries in the United States alone.\n\nA New York Times Book Review Editors' Choice\n\n&quot;Extraordinary. . . . Anyone with the slightest interest in biology should read this book.&quot;--The New York Times Book Review\n\n&quot;A marvelous museum of the past four billion years on earth--capacious, jammed with treasures, full of learning and wide-eyed wonder.&quot;--The Boston Globe\n\nFrom its origins on the still-forming planet to the recent emergence of Homo sapiens--one of the world's leading paleontologists offers an absorbing account of how and why life on earth developed as it did. Interlacing the tale of his own adventures in the field with vivid descriptions of creatures who emerged and disappeared in the long march of geologic time, Richard Fortey sheds light upon a fascinating array of evolutionary wonders, mysteries, and debates. Brimming with wit, literary style, and the joy of discovery, this is an indispensable book that will delight the general reader and the scientist alike.\n\n&quot;A drama bolder and more sweeping than Gone with the Wind . . . a pleasure to read.&quot;--Science\n\n&quot;A beautifully written and structured work . . . packed with lucid expositions of science.&quot;--Natural History","torrent":{"xt":"urn:btih:8585f2a2f94327f2faa4addba9d5b9463f5f92c6","amp;dn":"Life%3A+A+Natural+History+of+the+First+Four+Billion+Years_+Kindle","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8585f2a2f94327f2faa4addba9d5b9463f5f92c6","infoHashBuffer":{"type":"Buffer","data":[133,133,242,162,249,67,39,242,250,164,173,219,169,213,185,70,63,95,146,198]},"announce":[],"urlList":[]}}