{"title":"Cyndi Lauper - 12 Deadly Cyns (Best Of) 1995 [FLAC] Kitlope","uid":6879669,"size":393939159,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:87b6dd93cd2b26beb5a47036d1fffa26e403b985&amp;dn=Cyndi+Lauper+-+12+Deadly+Cyns+%28Best+Of%29+1995+%5BFLAC%5D+Kitlope&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Kitlope","files":18,"time":1323563595,"description":"PC Software: Windows 7 Ultimate Build 7600 \nFile Type: FLAC Compression 6\nOptical Drive Hardware: Samsung SH-S223L\nOptical Drive Firmware: SB04\nCd Software: Exact Audio Copy V1.0 Beta 3 (Secure Mode)\nEAC Log: Yes\nEAC Cue Sheet: Yes\nM3U Playlist: Yes\nTracker(s):http://tracker.openbittorrent.com/announce; \nTorrent Hash: 87B6DD93CD2B26BEB5A47036D1FFFA26E403B985\nFile Size: 375.68 MB\nYear: 1994\nLabel: Epic\nCatalog #: EK 66100\n\n\nPlease help seed these FLACs! \n\n\n\n\nFrom Wiki:\n\n\nCynthia Ann Stephanie &quot;Cyndi&quot; Lauper (born June 22, 1953) is an American singer, songwriter, actress and LGBT rights activist. She achieved success in the mid-1980s with the release of the album She's So Unusual and became the first female singer to have four top-five singles released from one album. The Top 5 hits &quot;Girls Just Wanna Have Fun&quot;, &quot;She Bop&quot;, &quot;All Through the Night&quot; and number-one single &quot;Time After Time&quot; became some of the most important and influential singles of the 80s. The album earned Lauper two 27th Grammy Awards in 1985, including Best New Artist. She continued success with their follow-up, True Colors, which launched several more hits including the number-one single &quot;True Colors&quot;, and earned her two nominations at 29th Grammy Awards. Lauper has since released 11 albums, her most recent the acclaimed grammy nominated Memphis Blues which was Billboards biggest selling blues album of 2010. Lauper has also released over 40 singles, and as of 2011 had sold more than more 50 million records worldwide,[1] and 1 million DVDs and 20 million singles.[2] Throughout her career, Lauper has won numerous awards, including Grammy, Emmy, MTV VMA, Billboard and AMA, which makes her one of the best selling artists of all time. In 1999, Lauper ranked #58 of the 100 Greatest Women of Rock &amp; Roll by VH1[3] and In 2008 she was elected by the British tabloid The Sun ranked #4 of the Singer Who Will Never Be Forgotten at All Times, according to a survey conducted in the same year. \n\n\n\n\n\n\n\n\n\nTwelve Deadly Cyns... And Then Some  1994\n\n\n\nTwelve Deadly Cyns...and Then Some is musician Cyndi Lauper's greatest hits CD, released in 1994. The album sold over 6 million copies worldwide.\n\nIn the United States the album has 14 tracks. 11 are previously released hits; &quot;I'm Gonna Be Strong&quot; is a Barry Mann and Cynthia Weil track Lauper re-recorded, having previously performed it on her debut album Blue Angel. &quot;(Hey Now) Girls Just Want to Have Fun&quot; is a re-recording of one of her biggest hits; it has been completely reworked to incorporate a reggae feel. A music video featuring drag queens was shot to accompany this single and it aired heavily on television. It was also featured in the film To Wong Foo, Thanks for Everything! Julie Newmar. The track &quot;Come On Home&quot; was also new; two versions were recorded, one running 4:33 (The US Version) and one running 4:36 (the international version). Internationally the album has 16 tracks (17 in Japan).\n\nThere was some issue with the division of royalties due to the wide array of co-writers on the various tracks that prevented Lauper from releasing the longer version in the United States. Conceptually the album was originally called &quot;13 Deadly Cyns&quot; and in fact a promotional cassette with this title (and an alternate track listing) was pressed and distributed in the United Kingdom in June 1992.\n\n\nTracks: \n\n\n1.\t&quot;I'm Gonna Be Strong&quot; (new recording)\n2.\t&quot;Girls Just Want to Have Fun&quot; (from She's So Unusual, 1983)\n3.\t&quot;Money Changes Everything&quot; (from She's So Unusual, 1983)\n4.\t&quot;Time After Time&quot; (from She's So Unusual, 1983)\n5.\t&quot;She Bop (7&quot; Single Remix)&quot; (from She's So Unusual, 1983)\n6.\t&quot;All Through the Night&quot; (from She's So Unusual, 1983)\n7.\t&quot;Change of Heart&quot; (from True Colors, 1986)\n8.\t&quot;True Colors&quot; (from True Colors, 1986)\n9.\t&quot;What's Going On (7&quot; Single Remix)&quot; (from True Colors, 1986)\n10.\t&quot;I Drove All Night&quot; (from A Night to Remember, 1989)\n11.\t&quot;That's What I Think (Single Edit)&quot; (from Hat Full of Stars, 1993)\n12.\t&quot;Sally's Pigeons&quot; (from Hat Full of Stars, 1993)\n13.\t&quot;(Hey Now) Girls Just Want to Have Fun&quot; (new recording)\n14.\t&quot;Come on Home&quot; (new recording; US version released in 1995 (instead of 1994 as the rest of the world) contains unique alternate mix)\n\n\n\nEnjoy :)\n","torrent":{"xt":"urn:btih:87b6dd93cd2b26beb5a47036d1fffa26e403b985","amp;dn":"Cyndi+Lauper+-+12+Deadly+Cyns+%28Best+Of%29+1995+%5BFLAC%5D+Kitlope","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87b6dd93cd2b26beb5a47036d1fffa26e403b985","infoHashBuffer":{"type":"Buffer","data":[135,182,221,147,205,43,38,190,181,164,112,54,209,255,250,38,228,3,185,133]},"announce":[],"urlList":[]}}