{"title":"Champion Jack Dupree - The Sonet Blues Story (1971) [Blues][mp3","uid":4799158,"size":171710450,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:87eae77949b1d43881d4bb9d0a1fce9279a80fcf&amp;dn=Champion+Jack+Dupree+-+The+Sonet+Blues+Story+%281971%29+%5BBlues%5D%5Bmp3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"schon55","files":28,"time":1237942454,"description":"Champion Jack Dupree - The Sonet Blues Story\nYear: 1971, 2005 CD Remastered Release\nBitrate: CBR 320 kbps\n\nBiography:\nA formidable contender in the ring before he shifted his focus to pounding the piano instead, Champion Jack Dupree often injected his lyrics with a rowdy sense of down-home humor. But there was nothing lighthearted about his rock-solid way with a boogie; when he shouted &quot;Shake Baby Shake,&quot; the entire room had no choice but to acquiesce.\n\nDupree was notoriously vague about his beginnings, claiming in some interviews that his parents died in a fire set by the Ku Klux Klan, at other times saying that the blaze was accidental.  Whatever the circumstances of the tragic conflagration, Dupree grew up in New Orleans' Colored Waifs' Home for Boys (Louis Armstrong also spent his formative years there). Learning his trade from barrelhouse 88s ace Willie &quot;Drive 'em Down&quot; Hall, Dupree left the Crescent City in 1930 for Chicago and then Detroit. By 1935, he was boxing professionally in Indianapolis, battling in an estimated 107 bouts.\n\nIn 1940, Dupree made his recording debut for Chicago A&amp;R man extraordinaire Lester Melrose and OKeh Records. Dupree's 1940-1941 output for the Columbia subsidiary exhibited a strong New Orleans tinge despite the Chicago surroundings; his driving &quot;Junker's Blues&quot; was later cleaned up as Fats Domino's 1949 debut, &quot;The Fat Man.&quot; After a stretch in the Navy during World War II (he was a Japanese P.O.W. for two years), Dupree decided tickling the 88s beat pugilism any old day. He spent most of his time in New York and quickly became a prolific recording artist, cutting for Continental, Joe Davis, Alert, Apollo, and Red Robin (where he cut a blasting &quot;Shim Sham Shimmy&quot; in 1953), often in the company of Brownie McGhee. Contracts meant little; Dupree masqueraded as Brother Blues on Abbey, Lightnin' Jr. on Empire, and the truly imaginative Meat Head Johnson for Gotham and Apex.\n\nChampion Jack Dupree - The Sonet Blues Story Tracklist:\n01  Vietnam Blues\n02  Drunk Again\n03  Found My Baby Gone\n04  Anything You Want\n05  Will It Be\n06  You're The One\n07  Down And Out\n08  Roamin' Special\n09  The Life I Lead\n10  Jit-A-Bug Jump\n11  Vietnam Blues (Alt. Take)\n12  One Scotch, One Bourbon, One Beer\n13  Drinking And Gambling\n14  Rolling And Tumbling\n15  Every Man's A King","torrent":{"xt":"urn:btih:87eae77949b1d43881d4bb9d0a1fce9279a80fcf","amp;dn":"Champion+Jack+Dupree+-+The+Sonet+Blues+Story+%281971%29+%5BBlues%5D%5Bmp3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87eae77949b1d43881d4bb9d0a1fce9279a80fcf","infoHashBuffer":{"type":"Buffer","data":[135,234,231,121,73,177,212,56,129,212,187,157,10,31,206,146,121,168,15,207]},"announce":[],"urlList":[]}}