{"title":"As cronicas do gelo e do fogo - A guerra dos tronos (Games of th","uid":6991547,"size":1171385,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:88608405d85e0edab222b5ad112fcae96c75542d&amp;dn=As+cronicas+do+gelo+e+do+fogo+-+A+guerra+dos+tronos+%28Games+of+th&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Flagmam","files":1,"time":1327721987,"description":"A Game of Thrones ÃƒÂ© o primeiro livro da sÃƒÂ©rie de fantasia ÃƒÂ©pica A Song of Ice and Fire, escrita pelo norte-americano George R. R. Martin e publicada pela editora Bantam Spectra. LanÃƒÂ§ado originalmente em 6 de agosto de 1996, o livro venceu o PrÃƒÂªmio Locus de 1997 e o PrÃƒÂªmio Nebula de 1998, tendo sido indicado tambÃƒÂ©m ao World Fantasy Award de 1997. A novela Blood of the Dragon, compreendendo os capÃƒÂ­tulos de Daenerys Targaryen do romance, venceu o PrÃƒÂªmio Hugo de 1997 para \\&quot;Melhor Novela\\&quot;.\nO livro dÃƒÂ¡ nome a vÃƒÂ¡rios itens derivados baseados na saga, incluindo jogos de cartas colecionÃƒÂ¡veis, jogos de tabuleiro e um RPG. Uma sÃƒÂ©rie televisiva baseada em A Song of Ice and Fire, intitulada Game of Thrones, estreou em 17 de abril de 2011 nos Estados Unidos.Produzida pelo canal HBO, sua primeira temporada adapta o enredo de A Game of Thrones.No Brasil, a obra foi publicada pela editora LeYa em setembro de 2010 com o tÃƒÂ­tulo A Guerra dos Tronos. Por sua extensÃƒÂ£o, em Portugal foi dividida em dois volumes, lanÃƒÂ§ados em 2007 pela editora SaÃƒÂ­da de EmergÃƒÂªncia sob os tÃƒÂ­tulos A Guerra dos Tronos e A Muralha de Gelo. \n\n-------------------------------------------------------------------------------------\n\nPersonagens de ponto de vista\n\nCada capÃƒÂ­tulo se concentra em uma narrativa em terceira pessoa limitada de uma ÃƒÂºnica personagem; o livro apresenta a perspectiva de oito personagens principais. Adicionalmente, uma personagem menor providÃƒÂªncia o prÃƒÂ³logo. Os tÃƒÂ­tulos dos capÃƒÂ­tulos indicam a perspectiva:\n\nPrÃƒÂ³logo: Will, um homem da Patrulha da Noite.\n\nEddard Stark, GuardiÃƒÂ£o do Norte, Lorde de Winterfell e MÃƒÂ£o do Rei.\n\nCatelyn Stark, da Casa Tully, esposa de Eddard Stark.\n\nSansa Stark, filha mais velha de Eddard e Catelyn Stark.\n\nArya Stark, filha mais nova de Eddard e Catelyn Stark.\n\nBran Stark, o segundo de trÃƒÂªs filhos de Eddard e Catelyn Stark.\n\nJon Snow, filho bastardo de Eddard Stark.\n\nTyrion Lannister, irmÃƒÂ£o da Rainha Cersei e de Sor Jaime, filho de Lorde Tywin Lannister.\n\nDaenerys Targaryen, Filha da Tormenta, Princesa de Pedra do DragÃƒÂ£o e herdeira do trono Targaryen depois de seu irmÃƒÂ£o Viserys Targaryen.\n\n-----------------------------------------------------------------------------------\n\n","torrent":{"xt":"urn:btih:88608405d85e0edab222b5ad112fcae96c75542d","amp;dn":"As+cronicas+do+gelo+e+do+fogo+-+A+guerra+dos+tronos+%28Games+of+th","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"88608405d85e0edab222b5ad112fcae96c75542d","infoHashBuffer":{"type":"Buffer","data":[136,96,132,5,216,94,14,218,178,34,181,173,17,47,202,233,108,117,84,45]},"announce":[],"urlList":[]}}