{"title":"[BSCOMP0002] netBloc Vol. 2 DRM killed the music-product machine","uid":7722429,"size":388646854,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:890964ca0602b733ee822d605efdd51299591da2&amp;dn=%5BBSCOMP0002%5D+netBloc+Vol.+2+DRM+killed+the+music-product+machine&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"brmevans","files":-1,"time":1350109885,"description":"blocSonic is proud to bring you another compilation featuring ten exceptional tracks from the world of netlabel music.\nnetBloc Volume 2 features rock, calypso, trip-hop, hip-hop, reggae and electronic.\n\nContained within the PDF booklet, you'll find another essay written by myself. This time about the current state of music industry and music prices. Check Google news, check Digg, check Reddit... everyday is more news about the death of DRM. Somehow I doubt it. The powers that be in the industry want to put a strangle hold on all music-product they sell and will not give that up without a fight. In the meantime, DRM is in fact killing their music-product.\n\nMusic listeners' faith in the industry as a whole is decreasing all the time. At the same time, their awareness of netlabels is increasing. With that increased awareness is an opportunity for a new paradigm in music. If you enjoy what's happening with netlabels, then please support the netlabels/artists who you've come to respect and enjoy. That support will help encourage the new netlabel paradigm and chop down the goliath that is the major music industry. We don't need their DRM or their over-priced, compressed/lossy music downloads. Music lovers don't simply want to download music, we want to download reasonably priced music without compression and with complete album art/liner notes.\n\nThanks again to all who have participated and/or downloaded our releases. Please visit our participants sites:\n\ntokyo trauma, Zengineers at myspace, iD.EOLOGY, Pharmacom Records, Epsilonlab, Giant Sounds, endK, Stromklang, Monotonik, Microtonner.com, Laridae, Giraffe at myspace, 12rec., vernonlenoir.com, Vernon Lenoir at myspace, WM Recordings\n\n\nThis audio is part of the collection: blocSonic\nIt also belongs to collection:\n\nArtist/Composer: Michael Gregoire\nDate: 2007-02-13\nKeywords: hip-hop; jazz; calypso; pop; electro-pop; rock; electronic; trip-hop\n\nCreative Commons license: Attribution-Noncommercial-No Derivative Works 3.0","torrent":{"xt":"urn:btih:890964ca0602b733ee822d605efdd51299591da2","amp;dn":"%5BBSCOMP0002%5D+netBloc+Vol.+2+DRM+killed+the+music-product+machine","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"890964ca0602b733ee822d605efdd51299591da2","infoHashBuffer":{"type":"Buffer","data":[137,9,100,202,6,2,183,51,238,130,45,96,94,253,213,18,153,89,29,162]},"announce":[],"urlList":[]}}