{"title":"Overcome Porn Addiction","uid":4812477,"size":13793660,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:8a9f85088c8387f63206a60bb60fe84009050e12&amp;dn=Overcome+Porn+Addiction&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"prince213","files":2,"time":1238429044,"description":"Product Details\n\n    * Language: English\n    * Type: Audio Book\n    * Format: MP3 @ 64 Kbps\n    * Publisher: Uncommon Knowledge\n\nProduct Description\n\nPornography addiction can make you feel bad about yourself, unbalance your attitude to sex, damage relationships and waste your time and money. Like many compulsive behaviors, porn addiction is usually a secret addiction.\n\nIt is not uncommon for a respectable member of the community to have time, self esteem and potential sapped by hours viewing porn. Friends, family and colleagues may be very disappointed if they knew, but you know and afterwards you can feel empty and worthless.\n\nThe nature of porn addiction\n\nPorn addiction is a dim reflection real passion and intimacy, and while it sometimes replaces these needs it does not fulfil them. Pornography addiction isn't always primarily to do with sex! Feelings of loneliness, boredom, insecurity or just having the opportunity can all result in porn addiction.\n\nPorn is a fraud because it promises something it doesn't deliver. People use it to escape reality but it actually worsens the very reality you are trying to escape from. Pornography addiction blunts the senses and stops you appreciating the subtitles of life.\n\nHowever like any addiction it never ultimately delivers what it seems to promise because the more you view the more you want to view, and the more extreme the pornography that you seek out.\n\nPorn addiction locks your attention\n\nPornography addiction has a kind of negative hypnotic effect, grabbing then locking your attention until you 'wake up' from the porn trance feeling exhausted and miserable. The fact is you may go for days, weeks or months without using porn and then almost without you knowing it you're back into it again.\n\nMaybe you'd kidded yourself that you're not really hooked or you'd just view porn for a few minutes but then you become entranced again and find yourself back in the life-destroying cycle.\n\nDownload Overcome Pornography Addiction and take back control of your life.\n\n\nVisit http://prince213.blogspot.com/ for more...","torrent":{"xt":"urn:btih:8a9f85088c8387f63206a60bb60fe84009050e12","amp;dn":"Overcome+Porn+Addiction","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a9f85088c8387f63206a60bb60fe84009050e12","infoHashBuffer":{"type":"Buffer","data":[138,159,133,8,140,131,135,246,50,6,166,11,182,15,232,64,9,5,14,18]},"announce":[],"urlList":[]}}