{"title":"Hitler: Speeches and Proclamations, 1932-1945 (4 vols)","uid":4700856,"size":8604730,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8ac1c703e292a1a3b5a28de0a62524e8c03f19ce&amp;dn=Hitler%3A+Speeches+and+Proclamations%2C+1932-1945+%284+vols%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bookzilla","files":1,"time":1233714157,"description":"Hitler: Speeches and Proclamations, 1932-1945--The Chronicle of a Dictatorship (4 Volume Set) (PDF zipped, no password)\n\nThis translation compiles speeches and proclamations from Hitler's rise to power in 1932 to his demise in 1945. It provides insight into his political agenda and ideology in an unprecedented span of years. Described as 'essential,' 'extraordinarily useful,' and 'indispensable,' this standard reference work on the Third Reich represents the most comprehensive collection of Hitler's Speeches, with an extensive commentary and the largest set of footnotes. It provides insight into his political agenda and ideology in addition to demonstrating his organizational and rhetorical skills. The four-volume set, Hitler Speeches and Proclamations is completely translated into English for the first time and is a much-needed addition to every public, research, historical, or personal library. In 1932, when Hitler became the most important political figure in Germany, Dr. Domarus began to collect his public statements, speeches, interviews, and letters, being conscious of their eventual documentary value. Friends at home and abroad persuaded him to make comments on this unique collection and publish it in its entirety.\n\n2004,\n3400 pages\n\nVolume 1 \n* Introduction \n* Hitler's personality \n* Political goals \n* Methodology of Hitler's speeches \n\nTHE YEAR 1932 \nHitler's domestic political struggles reach their peak. His attempt to come to power via plebiscite fails, in spite of tremendous oratorical campaigns. He receives only 37% of the vote. In contrast with this, the influence he wields on leading political personalities grows decisively. \n\nTHE YEAR 1933 \nActing under the influence of aides, Hindenburg appoints Hitler to the post of chief of a presidential cabinet and conveys upon him crucial, powerful positions. Within months, Hitler does away with all other parties besides his own and crushes the unions. Germany withdraws form the League of Nations and simultaneously launches an unlimited arms build-up. \n\nTHE YEAR 1934 \nFaced with the imminent demise of the Reichsprasident, Hitler attempts to secure the sympathies of the Reichswehr generals to himself. To this end he has the most prominent of the SA leaders murdered (R?hm affair). \n\nWithout waiting for Hindenburg's actual death, Hitler has the cabinet proclaim him Hindenburg's successor (in breach of the constitution). An oath of unconditional allegiance to Hitler is required of all soldiers. \n\nVolume 2 \nTHE YEAR 1935 \nFollowing the return of the Saar territory to Germany, Hitler initiates general conscription. The swastika flag becomes the official &quot;Reich&quot; flag. Jews are now subject to a special legal code (Laws of N?rnberg). \n\nTHE YEAR 1936 \nOccupation of the Rhineland. German military intervention in Spain. As a consequence of Mussolini's escapades in Abyssinia, Italy falls under German influence. To an extent, Austria is also forced to comply with Hitler's wishes. \n\nTHE YEAR 1937 \nCalm before the storm! No plebiscites, no &quot;surprise&quot; military strikes, except for retaliatory shots fired by German war ships on the Spanish harbor of Algeria. In November, Hitler reveals to the generals his intentions of taking Austria and Czechoslovakia by force. \n\nTHE YEAR 1938 \nHitler removes General Blomberg and General Frisch and subsequently appoints himself minister of war and commander-in-chief of the Wehrmacht. \n\nHe succeeds in annexing Austria to the Reich without bloodshed. His intentions of declaring war on Czechoslovakia are quelled by the Western powers (Munich Conference). The cession of only the Sudeten district is a humiliation to Hitler and he gives orders to prepare for the occupation of the rest of Czechoslovakia. \n\nAPPENDIX \nHitler's ascent to commander-in-chief of the Wehrmacht. \n\nVolume 3 \nTHE YEAR 1939 \nIn a breach of contractual agreements, Hitler occupies all of Czechoslovakia and establishes the protectorate Bohemia and Moravia. \n\nLithuania cedes the Memel district. England and France repeatedly state that they will declare war on Germany in the case of a German attack on Poland or Danzig. \n\nNevertheless, Hitler, feeling confident because of a non-aggression pact with Russia, does start war with Poland. The declaration of war by the Western powers is tantamount to the complete breakdown of foreign relations, which were based on an amiable relationship with England. The quick conquest of Poland does nothing to change the constellation in Western Europe. \n\nTHE YEAR 1940 \nWithout declaring war, Hitler invades Denmark and Norway, then, one month later, Belgium, Holland and Luxembourg. \n\nAs a result of the campaign in the West, France capitulates; England, however, does not, contrary to Hitler's expectations. Hitler is forced to engage in air combat over Britain, a battle he loses within only a few weeks. His terrorist air-raids on London and other English cities provoke retaliation by the RAF, resulting in the destruction of major German cities from 1942 to 1945. \n\nHitler dispatches troops to Rumania. His attempts to involve Spain, France and Russia in the battle against England fail. Italy's entry into the war proves to be a burden to Germany, with respect to Africa as well as Greece. NEW: Previously Unpublished Material \n\nSEPTEMBER 4, 1938 \nThe Reich Defense Law cancels the Military Service Act of May 21, 1935. It is kept secret on Hitler's order issued the same day. Until July 17, 1939, citing of or reference to the Reich Defense Law in public is forbidden. \n\nMAY 3, 1940 \nWith the launch of the offensive in the West imminent, Hitler addresses 6,000 officer cadets at the Berlin Sportpalast emphasizing the adaptation of the Lebensraum to increasing population, the claim that Germany is the most populous nation on Earth besides China, and struggle as the essence of life. \n\nDECEMBER 18, 1940 \nAddressing the annual rally of young officers at the Berlin Sportpalast, Hitler again focuses on the inevitability of struggle and the relationship between population and Lebensraum. \n\nVolume 4 \nTHE YEAR 1941 \nHitler invades Yugoslavia and Greece without prior declaration of war. Like Napoleon, he subsequently attempts to defeat England in Russia and thus invades his former allies without a declaration of war. Despite considerable territorial gains, Hitler is not successful in taking Leningrad, Moscow or Murmansk. The German army takes a painful beating at Moscow. Hitler uses this opportunity to make himself commander-in-chief of the army. \n\nTHE YEAR 1942 \nDespite initial successes, Hitler is unable to take the Suez Canal and the oil fields in the Caucasus. \n\nThe attempt to conquer Stalingard results in the German 6th Army being surrounded. The German Africa corps is forced to retreat at El Alamein. \n\nThe efforts to exterminate the Jews reach a peak. \n\nTHE YEAR 1943 \nCollapse of Germany's battle in Stalingrad and Northern Africa. Italy is forced to plead for a cease-fire after Allied forces reach the mainland. Hitler occupies Northern Central Italy. \n\nTHE YEAR 1944 \nThe invasion of the Allies in France is tantamount to the end of Hitler's rule in Western Europe. Russia smashes the German army division Mitte. An assassination attempt at Hitler's headquarters makes the internal military opposition to Hitler apparent. Romania, Bulgaria and Finland capitulate. Hitler's Christmas offensive in the Ardennes region falls apart after modest initial successes. \n\nTHE YEAR 1945 \nGermany is overrun by the Allied and Russian armies. Hitler is forced to take his own life in the bunker of the Reich chancellory. \n\nAPPENDIX and INDICES \n* Hitler and history \n* Responsibility for World War II \n* Hitler's victories and defeats in World War II \n* Synopsis of Hitler's travels abroad \n* Epilogue \n* Index of subjects \n* Index of persons \n* Index of places \n* Hitler's headquarters in World War II \n* Bibliography \n* July 20, 1944 assassination attempt \n","torrent":{"xt":"urn:btih:8ac1c703e292a1a3b5a28de0a62524e8c03f19ce","amp;dn":"Hitler%3A+Speeches+and+Proclamations%2C+1932-1945+%284+vols%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ac1c703e292a1a3b5a28de0a62524e8c03f19ce","infoHashBuffer":{"type":"Buffer","data":[138,193,199,3,226,146,161,163,181,162,141,224,166,37,36,232,192,63,25,206]},"announce":[],"urlList":[]}}