{"title":"It Aint Half Hot Mum","uid":15773878,"size":24720065055,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8b25e29e0721ea0294ff1f15c050423a013efac3&amp;dn=It+Aint+Half+Hot+Mum&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":4,"uploader":"Psychodad149","files":57,"time":1473217090,"description":"It Ain't Half Hot Mum\r\n56 Episodes\r\n3 January 1974 – 3 September 1981\r\n\r\nRollicking BBC comedy from David Croft, who was also behind &quot;Are You Being Served?&quot; (AYBS), and there is a strong family resemblance between the two shows! Both feature a large ensemble cast, eccentric characters, absurd situations, and double-entendre humor. \r\n\r\n\r\nThe series follows the antics of a Royal Artillery &quot;Concert Party&quot;: a group of performers whose duty is putting on shows to entertain troops on their way to the front lines. They are in the charge of a tough and stereotypical Sergeant Major who dislikes them intensely, regularly calling them a &quot;bunch of poufs&quot; and threatening them with getting them posted to combat duty. A number of episodes turn on the Sergeant trying to pull some gimmick which will get his charges either transferred or in the stockade. At the top are the Colonel and the Captain, again, steretypical posh, upper-class English officers with little idea of which end is up. In the middle is Battery Sergeant Major Tudor Bryn &quot;Taffy&quot; Williams, known to the men as &quot;Old Shut-Up&quot;, for his favorite phrase. He is old-time regular Army, a professional soldier, and prone to mispronunciation and malapropism. \r\n\r\n\r\nOverall, the show is hysterically funny at its best, and still &quot;LOL&quot; funny at its worst. Not that there's anything bad, but the writing tends to be a bit uneven. The whole style seems to cast about a bit from episode to episode, trying to decide whether to be the uproarious absurd comedy in the style of AYBS or more of a standard sitcom. A few times it seems that actors are waiting for a laugh to a punch line which doesn't quite pay off. Sgt. Williams' schemes to get the Concert Party sent &quot;up jungle&quot; on active duty threaten to become formulaic.\r\n\r\nAnyway, enjoy this absolute gem of a series!\r\n\r\n(Full comments included in torrent)","torrent":{"xt":"urn:btih:8b25e29e0721ea0294ff1f15c050423a013efac3","amp;dn":"It+Aint+Half+Hot+Mum","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b25e29e0721ea0294ff1f15c050423a013efac3","infoHashBuffer":{"type":"Buffer","data":[139,37,226,158,7,33,234,2,148,255,31,21,192,80,66,58,1,62,250,195]},"announce":[],"urlList":[]}}