{"title":"Sergius Golowin - Lord Krishna von Goloka (1973) [mp3@320]","uid":6315195,"size":103313489,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:8bd059fe0cd8874250e2a038810a634ecc2e8838&amp;dn=Sergius+Golowin+-+Lord+Krishna+von+Goloka+%281973%29+%5Bmp3%40320%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zibbik","files":10,"time":1302682131,"description":"Artist: Sergius Golowin\nTitle: Lord Krishna von Goloka\nGenre: Krautrock,Electronic\nOrigin: Germany\n\nTracklist:\n\n1. Der Reigen (16:34)\n2. Die Weisse Alm (5:49)\n3. Die Hoch Zeit (19:25)\n\nSergius Golowin - voice\nBernd WitthÃƒÂ¼ser - guitar\nJÃƒÂ¼rgen Dollase - piano, melotron, vibrafon, triangel and guitar\nJÃƒÂ¶rg Mierke - electric guitar, organ, percussion, voice choir, flute, electronics, conga\\'s\nWalter Westrupp - acoustic guitar, flute, mouthharp, windspel, psalter, tablas and percussion\nJerry Berkers - electric guitar, acoustic guitar, bass, bongo\\'s\nKlaus Schulze - drum, organ, mellotron &amp; electronics\n\n\n\\&quot;The term Krautrock gets bandied about pretty loosely, and it has been used on more than one occasion to describe this 1973 effort by the little-known Sergius Golowin. Looking at its vintage and its cast of players, it\\'s easy to see how it earned that label: members of the band had recorded with such legendary Krautrock ensembles as Tangerine Dream, Ash Ra Tempel, the Cosmic Jokers, and Wallenstein. Nevertheless, Lord Krishna von Goloka is probably a little too ambient to qualify as rock of any kind. It is, however, a pretty tripped-out affair, and one that is likely to satisfy fans of early-\\'70s kosmiche rock.\nThe album is divided into three long tracks, but it would be wrong-headed to discuss these as individual \\'songs.\\' Rather, the three pieces exist as atmospheric soundscapes, each sharing similar terrain. Folk, classical, and Eastern elements bump headlong into more psychedelic components, provided largely by Schulze who contributes everything from electric and acoustic guitar to organ, Mellotron, percussion, drums, and electronics.\nThroughout the proceedings, Golowin serves as a sort of German Timothy Leary, gentling imparting his wisdom on all things mystical. He speaks, whispers, and sighs, but never sings. In short, it\\'s all laid on a bit thickly. Fortunately, the genuinely intense musical performances cancel out the more indulgent moments, ensuring that the album never devolves into period camp.\nProbably not the best place to start a collection of German psych-rock, this album nonetheless makes a nice addendum to collections featuring the likes of Ash Ra Tempel, Amon DÃƒÂ¼ÃƒÂ¼l II, Popol Vuh, and other likeminded bands of the era. \n\n\n","torrent":{"xt":"urn:btih:8bd059fe0cd8874250e2a038810a634ecc2e8838","amp;dn":"Sergius+Golowin+-+Lord+Krishna+von+Goloka+%281973%29+%5Bmp3%40320%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8bd059fe0cd8874250e2a038810a634ecc2e8838","infoHashBuffer":{"type":"Buffer","data":[139,208,89,254,12,216,135,66,80,226,160,56,129,10,99,78,204,46,136,56]},"announce":[],"urlList":[]}}