{"title":"Ableton Live 8.3 - Max 4 Live - 32Bit -UraniumWilly","uid":10267579,"size":1546381441,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8c45ea2256d7002af57a9b3d84e2a9e66de70f1d&amp;dn=Ableton+Live+8.3+-+Max+4+Live+-+32Bit+-UraniumWilly&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"uraniumwilly","files":1,"time":1401543303,"description":"This is not my rip and crack. I don't know how to do that stuff. I elieve the ripper's names is JAST and all credit on that end goes to him. But some of the install instructions may not have been very clear and so I am reupping it with the steps that I used for getting this version of Ableton Suite 8.3 up and going in no time. After lots of hassles with Live 9 I went back to Live 8 but wanted something newer than 8.2.1. \n\nI am not even sure what MAX for Live is or if I will be using it that much. Seems like a bunch of user stuff collected together. It is working on my version BUT the MAX5 program icon that is put on my desktops opens up into a trial version. It is counting down now as I type this and i am not sure if that will affect the MAX for Live in Ableton or not. If it does I do not think I will worry about it. \n\nHow I got this up and going after a few failed attempts on my PC (I am including the MAC installer but I have no clue how that stuff works). I am running WIN 7 32 bit and I have had no problems for over a day now, though at first LIVE kept unauthorizing itself. I think we can get around that:\n\n1) Disconnect from the Internet. The updater on Ableton appears to work almost immediately (there are a couple other steps to prevent that I will get to in a moment) so simply disconnect from the net while installing. if you choose not to you will most likely not have enough time to shut of the updater before Ableton detects this is a cracked version and deauthorizes. Maybe you will, but best to be safe.\n\n2) Install Ableton Live from the setup file. \n\n3) You do not have to install to the default directory. That would be c://ProgramData/XXXX. If you want to okay, but I hate to load my c-drive up with stuff. Lots of people cannot even find ProgramData (you must select to view hidden files and folders or type in the location into Explorer). I installed to my d-drive and saved space and strain on my c-drive. \n\n4) Install MAX5 (if you want it ). I put it on my d-drive as well and the folder is called Cycling74 or something in case you look for it later. It will ask you to reboot your computer and best to do so I think.\n\n5) Before you patch anything do these two thing: Go to the directory where you installed Ableton, go to Programs &gt; Resources &gt; Extensions and delete the folder called Update (or Updater or something like that). Just get rid of it. Now open Live and make sure that Under Preferences &gt; Licenses Maintenance the Get Software Updates option is set to OFF. This should prevent the program from becoming unauthorized later. Close Live. \n\n6) Now unRAR the crack/patch and copy paste it into the directory you installed Live to, into the Program folder. Do the patch and it should not have to search as the patch and .exe are in the same folder. It did not search on my computer when I did it this way. The AUZ file will appear and then double click it and Live should open and be authorized. \n\nThis is how I did it and it is still working. Good luck and I do not check these things for comments really, but if I do and you have a question I will try to get back ASAP. \n\nUranium Willy\n","torrent":{"xt":"urn:btih:8c45ea2256d7002af57a9b3d84e2a9e66de70f1d","amp;dn":"Ableton+Live+8.3+-+Max+4+Live+-+32Bit+-UraniumWilly","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c45ea2256d7002af57a9b3d84e2a9e66de70f1d","infoHashBuffer":{"type":"Buffer","data":[140,69,234,34,86,215,0,42,245,122,155,61,132,226,169,230,109,231,15,29]},"announce":[],"urlList":[]}}