{"title":"FS2004 ImagineSimulation Newark Liberty Intl Airport - KEWR","uid":3699900,"size":18430035,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8c6267535f876816adc92f2ebfb8ca674850ad31&amp;dn=FS2004+ImagineSimulation+Newark+Liberty+Intl+Airport+-+KEWR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ch!no303","files":1,"time":1180412227,"description":"FS2004 ImagineSimulation Newark Liberty Intl Airport - KEWR\n\n At last, a bang up-to-the-minute new version of KEWR Newark for Flight Simulator. Newark is among the most important airports in the US, a vital destination for most of the world&amp;#039;s premier airlines and a major base for Continental. You will find right across the airport land area literally thousands of objects created with incredible accuracy and placed with the aid of pin-point satellite photography.\n\nThe airport features custom made runways, terminal buildings rendered to 10cm per pixel scale, smoothly operating jetways that dock with your aircraft?s forward door with an interactive docking system to park you right on your mark, taxiways with highly realistic concrete textures, full airport taxiway and runway signage, 3D approach lighting and full ILS navigation. There are hundreds of airport vehicles and ground personnel, aircraft can be found parked at custom textured parking positions, all hangers, cargo and airport auxiliary buildings are modelled,  there is even a complete and secure perimeter fence with security checkpoints and emergency vehicle access points - all under the steady gaze of intermittently placed security cameras! \n\nIn addition to all of this, KEWR looks stunning after dark with beautifully lit buildings and parking areas. Complete airport taxiway and runway lighting is also included.\n\nPlease note - This airport add-on is situated in the highly built-up area of New York and it&amp;#039;s environs. The airport will work satisfactorily on PC&amp;#039;s of 2.0Ghz and above with certain reduced MSFS display options (for example, low autogen or no shadows). Customers wishing to utilize this add-on with all MSFS display options set to maximum should be aware that a medium/high or high specification PC system is recommended.\n\nTested and Working\n\nPersonal Rating 7/10\n\nh**p://www.imaginesim.com/kewr01.htm\n\nPLEASE, WHEN FINISHED KEEP SEEDING!!! \n\n","torrent":{"xt":"urn:btih:8c6267535f876816adc92f2ebfb8ca674850ad31","amp;dn":"FS2004+ImagineSimulation+Newark+Liberty+Intl+Airport+-+KEWR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c6267535f876816adc92f2ebfb8ca674850ad31","infoHashBuffer":{"type":"Buffer","data":[140,98,103,83,95,135,104,22,173,201,47,46,191,184,202,103,72,80,173,49]},"announce":[],"urlList":[]}}