{"title":"Halo - The Fall of Reach (Chaptered Audiobook)","uid":4034997,"size":642169424,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:8d86e817a66417c125152a6f696356ca1665c6a5&amp;dn=Halo+-+The+Fall+of+Reach+%28Chaptered+Audiobook%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Techloid","files":39,"time":1203379426,"description":"Techloid Presents:\n\nHalo - The Fall of Reach\nBy: Eric Nyland\n\nBook Description\nAs the bloody Human-Covenant War rages on Halo, the fate of humankind may rest with one warrior, the lone SPARTAN survivor of another legendary battle . . . the desperate, take-no-prisoners struggle that led humanity to Halo--the fall of the planet Reach. Now, brought to life for the first time, here is the full story of that glorious, doomed conflict.\n\nWhile the brutal Covenant juggernaut sweeps inexorably through space, intent on wiping out humankind, only one stronghold remains--the planet Reach. Practically on Earth\\\\\\&amp;#039;s doorstep, it is the last military fortress to defy the onslaught. But the personnel here have another, higher priority: to prevent the Covenant from discovering the location of Earth.\n\nOutnumbered and outgunned, the soldiers seem to have little chance against the Covenant, but Reach holds a closely guarded secret. It is the training ground for the very first \\\\\\&quot;super soldiers.\\\\\\&quot; Code-named SPARTANs, these highly advanced warriors, specially bioengineered and technologically augmented, are the best in the universe--quiet, professional, and deadly.\n\nNow, as the ferocious Covenant attack begins, a handful of SPARTANs stand ready to wage ultimate war. They will kill, they will be destroyed, but they will never surrender. And at least one of them--the SPARTAN known as Master Chief--will live to fight another day on a mysterious and ancient, artificial world called Halo. . . .\n\nAudio:\n\nFile Type - mp3\nBitrate - 128kb\\\\\\\\s\nChannels - Joint Stereo\nForm - Chaptered\n\nThis is my first upload, Tell me if there is anything wrong.\n\n_________________________________________________________________\n\nBy the way, I highly recommend this site: &lt;a href=&quot;\nhttp://themes.belchfire.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://themes.belchfire.net/&lt;/a&gt;\nYou can get themes, boot screens, logon screens, cursors, sounds, wallpapers ect.\n_________________________________________________________________\n\n\nPlz Seed!","torrent":{"xt":"urn:btih:8d86e817a66417c125152a6f696356ca1665c6a5","amp;dn":"Halo+-+The+Fall+of+Reach+%28Chaptered+Audiobook%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d86e817a66417c125152a6f696356ca1665c6a5","infoHashBuffer":{"type":"Buffer","data":[141,134,232,23,166,100,23,193,37,21,42,111,105,99,86,202,22,101,198,165]},"announce":[],"urlList":[]}}