{"title":"Bangbus Episode 3 - Isabelle.wmv {2bUnique}","uid":9886908,"size":221312210,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:8f0641c3736554e5076f97a5baaacab5fa1f3f7b&amp;dn=+Bangbus+Episode+3+-+Isabelle.wmv+%7B2bUnique%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2bUnique","files":1,"time":1396594205,"description":"Description\n\n &lt;a href=&quot;\nhttp://www.bangbus.com/t5/pps=sweet69/porn-videos/isabelle_bbisabelle.html#play&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.bangbus.com/t5/pps=sweet69/porn-videos/isabelle_bbisabelle.html#play&lt;/a&gt;\n\n\nAnyone, who knows anything about Ugly and I, knows that we live, breathe, sleep, jack off and die for latinas. They are the crown jewel of women to us. So we took Shane out again to go latina shopping and we found Isabelle walking with a bag of groceries. Ugly almost ran her off the road just to get 3 seconds of her attention. When she finally stopped I asked if she needed any help with her bag, &quot;NO, who the fuck are you guys!&quot; We're art students completely harmless, and who wouldn't trust an artist? It took some playful rebounding but then she was ok to let us give her a ride (it wasn't easy and was actually the most difficult so far). As we settle in the bus naturally the first thing I do is go for the bag and what did we find? big ol bananas and a cucumber, funny aye? so I asked her to show me how she gives head with the bannana. The thing is that no girl will show you stuff like that unless you try them and it worked as usual. God, did I wish that I was that bananna. This latina looked like she could suck some cock and she did, Shane's cock that is, and man there's nothing more intense then a latina on her knees where she belongs sucking fat dick. I have to say that the one thing I love to do is to have a bitch hum the bang bus theme song, 'the wheels on the bus go round and round' with a dick in their mouth. And well, after that I'm just ready to see this chick get stuffed. Did I mention the fact that this chick had the biggest pair of titties I'd ever seen, double d's. They were round, hard and delicious; so you'll notice that even I took a poke at them as this bitch got stuffed. She was riding shane and I wacked her in the ass with one of her banannas. I wanted to stuff it in her ass but I held back. We turned her over and stuffed her from behind which she took until I'd had enough and deemed her worthy to have a load blown on her cute little slut face. When Shane blew, that shit ran down her face like white blood and Isabelle knew, like all the other bitches we've slammed, that she was now property of the bang bus...\n\n\n*** VIDEO INFO ***\nInput Type : YV12(RAW)\nInput Size : 320 x 240\nOutput Type : YV12\nOutput Size : 320 x 240\nFrameRate(Frame/sec) : 27.17 \n\n\n*** AUDIO INFO ***\nSampleRate(Sample/sec) : 48000\nBitRate(Bit/sample) : 16\nChannels : 2\nKBitRate(KBit/sec) : 96","torrent":{"xt":"urn:btih:8f0641c3736554e5076f97a5baaacab5fa1f3f7b","amp;dn":"+Bangbus+Episode+3+-+Isabelle.wmv+%7B2bUnique%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f0641c3736554e5076f97a5baaacab5fa1f3f7b","infoHashBuffer":{"type":"Buffer","data":[143,6,65,195,115,101,84,229,7,111,151,165,186,170,202,181,250,31,63,123]},"announce":[],"urlList":[]}}