{"title":"Zon-Astral Projector/Back Down To Earth [1978,79][2003][320KBPS]","uid":10534334,"size":240570104,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:902aaee56cc69e7154f792eef40dbbfe1e4418f3&amp;dn=Zon-Astral+Projector%2FBack+Down+To+Earth+%5B1978%2C79%5D%5B2003%5D%5B320KBPS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LameDuck69","files":33,"time":1405142287,"description":"Zon - Astral Projector/Back Down To Earth [1978][1979][2003]\n\n\n\n\nAstral Projector [1978]\n\n\n01: Put On The Show\n02: Time For Your Love\n03: 1)Point Of View; 2)Where To Spend My Dollar\n04: Man In The Mirror\n05: Talkin' About\n06: Melody\n07: On The Road\n08: Astral Projector\n09: Hollywood\n\n\n\n\nBack Down To Earth [1979]\n\n\n01: Circus\n02: Please Stay\n03: Lifeline\n04: As Seasons Change\n05: Suicide\n06: Back Down To Earth\n07: Cheater\n08: Take It From Me\n09: When He's Old\n10: God And Kings\n\n\n\n\n320 KBPS \nCover Art\n\n\n\n\n***This Is A Request For &quot;acayouche&quot; And &quot;ableCman&quot;.  If You Want To Make A Request, Please Do It On My Most Recent Upload Page.***\n\n\n\n\n\n\n\nHistory:\n\n\nZon was a Canadian progressive rock band formed in Toronto in 1977. The band consisted of vocalist Denton Young, guitarist Brian Miller, bassist Jim Samson, drummer Kim Hunt, and keyboard player Howard Helm. They released four albums over the course of their career.\n\nDon V. Lorusso produced the band's first album, &quot;Astral Projector&quot;, which was released on blue vinyl. The album became an FM radio staple in the late '70's. The album garnered the band a 'Best New Group' Juno Awards nomination. The band would find themselves opening up gigs for the likes of The Tubes at Toronto's Maple Leaf Gardens, and with Styx and with Foreigner at CNE Stadium getting opening slot encores on all occasions.\n\n1979's &quot;Back Down to Earth&quot; was produced by Don V. Lorusso and the late Vancouver keyboard whiz Dale Jacobs. The band played Toronto as headliners where a hometown crowd swelled to 17,800 people. A reporter for &quot;The Globe and Mail&quot;, who had only stayed to see the opening act, wrote a scathing review thinking he had seen Zon. The negative review was the headline of the entertainment page, nationally in Canada. CBS demanded compensation for the impact on Zon's popularity but neither the band, nor the label, ever recovered.\n\nZon was dropped from CBS after a thorough corporate housecleaning of the A &amp; R Department despite Zon already having their contract picked up for a third album.\n\nThe ensuing legal battle took much of the heart out of the band, but they did manage one more album for Falcon Records called &quot;I'm Worried About The Boys&quot;, produced by then former CBS A &amp; R man Bob Gallo. The record featured a cover version of the Velvet Underground's &quot;Sweet Jane&quot;.\n\nAs part of the 1980 tour to support the album, Zon did an opening slot for Alice Cooper at Toronto's CNE Stadium. When Cooper failed to appear minutes before showtime, Denton Young was given the onerous task of telling the audience. A riot ensued and police had to be called out. The band broke-up shortly after, despite the 1981 single &quot;For You&quot; reaching #2 on CKOC in Hamilton (higher than any of the previous singles on CBS Records).\n\nAfter Zon\n\nSinger Denton Young most recently popped up on Rik Emmett's solo work; Kim Hunt would go on to join Hanover, Urgent and is currently in Moxy; Jim Samson is now with Moxy; Roddi Chappell is in long running AOR band Lightspeed who released two CDs on Pacemaker in the '90s and a third with Majestic Rock Records in Europe; Brian Miller works at Toronto's famed 12th Fret guitar store; Howard Helm joined Michael Fury which mutated into Refugee. In 1988 Helm was offered a job as touring keyboardist for Mick Ronson and Ian Hunter. He took the job and spent four years on the road touring the world. He is currently writing for TBS television in Atlanta and Universal Studios in Orlando. He continues to play keyboards in-studio for the likes of bands like Seven Mary Three and others.\n\nAt the moment, Helm and his former Zon bandmates are contemplating a new studio album to coincide with the re-issues of that band's back catalogue on CD.","torrent":{"xt":"urn:btih:902aaee56cc69e7154f792eef40dbbfe1e4418f3","amp;dn":"Zon-Astral+Projector%2FBack+Down+To+Earth+%5B1978%2C79%5D%5B2003%5D%5B320KBPS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"902aaee56cc69e7154f792eef40dbbfe1e4418f3","infoHashBuffer":{"type":"Buffer","data":[144,42,174,229,108,198,158,113,84,247,146,238,244,13,187,254,30,68,24,243]},"announce":[],"urlList":[]}}