{"title":"Proof of Rome's Political Meddling in America(catholic subver","uid":4648629,"size":3049681,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:904b27aef7e24fce1c587408889d3547496c090d&amp;dn=Proof+of+Rome%5C%27s+Political+Meddling+in+America%28catholic+subver&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"red_gonzo","files":1,"time":1231967846,"description":"This is The Fellowship Forum's amazing book Proof of Rome's Political Meddling in America (1927) which presents evidence that the Roman Catholic Church in the United States was (and still is) actively working to &quot;make America Catholic&quot; and demolish its traditional Protestant faith. It uses papal documents, a conference report from the National Catholic Welfare Council, a map of catholic institutions strategically located around Washington D.C. and documents from other church agencies to make its case of a catholic conspiracy to takeover the United States. Included are photographs, illustrations, and a pull-out organizational chart of the National Catholic Welfare Council. It asserts that the &quot;central agency of this campaign&quot; is located in Washington and is known as the National Catholic Welfare Conference. Some Americans have noticed that there is a significant number of Catholic institutions located right inside Washington DC. Among the most known is certainly Georgetown University where former US president Bill Clinton was schooled. Proof of Rome's Political Meddling in America shows that Roman Catholic Church in the US is indeed deeply involved in politics with a view to making all Americans turn Catholic. Its claims are irrefutable mainly because they are based almost wholly from Roman Catholic sources, that the Roman Catholic church in the United States, in its effort to 'make America Catholic,' is in quest of temporal power, and that it is 'in politics' as a means to that end. 115 pages, some pictures. A must read for everyone.\n","torrent":{"xt":"urn:btih:904b27aef7e24fce1c587408889d3547496c090d","amp;dn":"Proof+of+Rome%5C%27s+Political+Meddling+in+America%28catholic+subver","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"904b27aef7e24fce1c587408889d3547496c090d","infoHashBuffer":{"type":"Buffer","data":[144,75,39,174,247,226,79,206,28,88,116,8,136,157,53,71,73,108,9,13]},"announce":[],"urlList":[]}}