{"title":"The Band - The Band (1969) 2013 MFSL-SACD-DFF","uid":11549883,"size":1863191439,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:90c31c5d40949d53cf414f579e7fa5f13974a8fe&amp;dn=The+Band+-+The+Band+%281969%29+2013+MFSL-SACD-DFF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"hal4000","files":-1,"time":1416769247,"description":"The Band was a Canadian-American roots rock group that originally consisted of Rick Danko (bass guitar, double bass, fiddle, trombone, vocals), Levon Helm (drums, mandolin, guitar, vocals), Garth Hudson (keyboard instruments, saxophones, trumpet), Richard Manuel (piano, drums, baritone saxophone, vocals) and Robbie Robertson (guitar, vocals). The members of the Band first came together as they joined rockabilly singer Ronnie Hawkins' backing group The Hawks one by one between 1958 and 1963.\n\nThe Band's first album, Music from Big Pink, seemed to come out of nowhere, with its ramshackle musical blend and songs of rural tragedy. The Band, the group's second album, was a more deliberate and even more accomplished effort, partially because the players had become a more cohesive unit, and partially because guitarist Robbie Robertson had taken over the songwriting, writing or co-writing all 12 songs. Though a Canadian, Robertson focused on a series of American archetypes from the union worker in &quot;King Harvest (Has Surely Come)&quot; and the retired sailor in &quot;Rockin' Chair&quot; to, most famously, the Confederate Civil War observer Virgil Cane in &quot;The Night They Drove Old Dixie Down.&quot; The album effectively mixed the kind of mournful songs that had dominated Music from Big Pink, here including &quot;Whispering Pines&quot; and &quot;When You Awake&quot; (both co-written by Richard Manuel), with rollicking uptempo numbers like &quot;Rag Mama Rag&quot; and &quot;Up on Cripple Creek&quot; (both sung by Levon Helm and released as singles, with &quot;Up on Cripple Creek&quot; making the Top 40). As had been true of the first album, it was The Band's sound that stood out the most, from Helm's (and occasionally Manuel's) propulsive drumming to Robertson's distinctive guitar fills and the endlessly inventive keyboard textures of Garth Hudson, all topped by the rough, expressive singing of Manuel, Helm, and Rick Danko that mixed leads with harmonies. The arrangements were simultaneously loose and assured, giving the songs a timeless appeal, while the lyrics continued to paint portraits of 19th century rural life (especially Southern life, as references to Tennessee and Virginia made clear), its sometimes less savory aspects treated with warmth and humor.\n\nTracklist:\n1 - &quot;Across the Great Divide&quot;   -2.53\n2 - &quot;Rag Mama Rag&quot;   -3.04\n3 - &quot;The Night They Drove Old Dixie Down&quot;   -3.33\n4 - &quot;When You Awake&quot;   -3.13\n5 - &quot;Up on Cripple Creek&quot;   -4.35\n6 - &quot;Whispering Pines&quot;   -4.00\n7 - &quot;Jemima Surrender&quot;   -3.31\n8 - &quot;Rockin' Chair&quot;   3.43\n9 - &quot;Look Out Cleveland&quot;   3.09\n10 - &quot;Jawbone&quot;   -4.20\n11 - &quot;The Unfaithful Servant&quot;   -4.17\n12 - &quot;King Harvest (Has Surely Come)&quot;   -3.35\n\nDSD-DFF files extracted with Scarletbook\nfrom the 2013 Mobile Fidelity Sound Lab Hybrid SACD.\n\nMFSL-SACD-ISO-DFF-1Bit-2.8Mhz","torrent":{"xt":"urn:btih:90c31c5d40949d53cf414f579e7fa5f13974a8fe","amp;dn":"The+Band+-+The+Band+%281969%29+2013+MFSL-SACD-DFF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90c31c5d40949d53cf414f579e7fa5f13974a8fe","infoHashBuffer":{"type":"Buffer","data":[144,195,28,93,64,148,157,83,207,65,79,87,158,127,165,241,57,116,168,254]},"announce":[],"urlList":[]}}