{"title":"Order &amp; Chaos Online v2.1.0 APK+OBB","uid":8724150,"size":1482064157,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:91d5979267df0f5e3ff37a3105c542a6d29fec13&amp;dn=Order+%26amp%3B+Chaos+Online+v2.1.0+APK%2BOBB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dradiscontact","files":9,"time":1374477693,"description":"The only true real-time, full-3D MMORPG on Android: Join thousands of players.\nOrder and Chaos Online is the only true real-time, full-3D MMORPG on Android: Join thousands of players.\n\nFinally a true real-time, full-3D MMORPG comes to the Android: Explore a vast heroic fantasy world and join thousands of players in this massively multiplayer online experience that pushes the boundaries of epic!\n\nWHO WILL YOU BE? \nUse the advanced character creation system to customize your hero:\n4 races available: Elves and Humans fight for Order, Orcs and Undead for Chaos. \nChoose your gender, appearance, class and talents. With over 1,000 skills and 2,000 pieces of equipment to discover, your adventure will not be over soon.\nCreate up to 4 different characters to play.\nINTERACT WITH THE COMMUNITY\nMake friends or enemies, trade, duel, communicate and more: a wide range of interactions makes each player a living part of this universe.\nJoin a party or guild to become stronger and coordinate with your teammates, or you can choose to adventure solo, interacting with other players peacefully or otherwise...\nTHE WORLD IS YOURS\nTravel through the most majestic settings - from dark forests to deserts, jungles, mountains and more - on foot or by magical means. \nTalk and interact with hundreds of characters to find over 500 quests to perform.\nBe ready for some action with the famous iPhone game finally released for Android players. Fight many enemies and be ready to join &amp; compete with iOS players in an upcoming update.\n\nEnter the legend now!","torrent":{"xt":"urn:btih:91d5979267df0f5e3ff37a3105c542a6d29fec13","amp;dn":"Order+%26amp%3B+Chaos+Online+v2.1.0+APK%2BOBB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91d5979267df0f5e3ff37a3105c542a6d29fec13","infoHashBuffer":{"type":"Buffer","data":[145,213,151,146,103,223,15,94,63,243,122,49,5,197,66,166,210,159,236,19]},"announce":[],"urlList":[]}}