{"title":"Speed Commander v13.20 b6100 Portable","uid":5568949,"size":39433521,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:927f06b810cf0510ab164882cc4af8dff2f4aa25&amp;dn=Speed+Commander+v13.20+b6100+Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"NoExcuses","files":8,"time":1274211803,"description":"Speed Commander v13.20 build 6100 made Portable.\n\nNo need to install it!\nOr, if you want to, Setup and Keygen are included. There are both x32-x64 versions, the U3 Setup and an already generated license.\n\n\nSpeedCommander is a comfortable file manager. It builds on the proven two window technology and offers a multitude of exclusive features. Sort, copy, move or delete your files either using the keyboard or the mouse.\n\n\nProven Two Window Technology\n\nSpeedCommander displays files and folders in the proven two window technology - source and target of operations are therefore always visible. This ensures a higher productivity compared to Windows Explorer and an extremely fast navigation through files, folders and FTP sites.\n\nSpeedCommander offers you many options for copying and moving files. Besides the usual deletion SpeedCommander has a secure deletion compliant to governmental standards. With the integrated Quick View SpeedCommander shows you the content of many file formats. Pictures, videos or music files - SpeedCommander gives you a fast overview for every kind of files. FileSync synchronizes folders, FileSearch finds files and folders on all data mediums.\n\n\nExtensive Archive Support\n\nSpeedCommander makes handling compressed files easy, because they are treated like ordinary folders. Experience direct support for many archive formats as well as compressing and decompressing them without the need for further software. Compression profiles can sum up settings and self-extracting archives make additional software superfluous. Recovery data offers protection against damaged archives.\n\n\nAdd-In Interface\n\nSpeedCommander has a modern Add-In interface, so that additional plugins can be used, enhancing the original functionality. SpeedCommander communicates with the Add-In via the component object model (COM). An Add-In can add functionality in the menu or the toolbars. The Add-Ins also have full access to SpeedCommander's object model. They can open and alter folder windows, as well access their content.\n\nAdd further file systems via the interface for file system Add-Ins into SpeedCommander. Use the WinCeFS Add-In to access PDA devices with ActiveSync. The WfxWrapper Add-In integrates the many file system plugins from Total Commander (wfx).\n\n\nMacros\n\nSimple tasks can be automated with macros. Macros can use the different objects of SpeedCommander too, also all script capable components (e.g. several shell objects) can be included. Edit macros easily with the integrated macro editor and check them for possible errors with a script debugger (like Visual Studio).\n\n\nEnhanced FTP Functions\n\nSpeedCommander supports various FTP types like FTP via SSH (SFTP) and SSL encrypted FTP. The user just needs to choose a protocol, everything else is done by Speedcommander in a transparent way. The support for proxies was expanded noticeably. SpeedCommander supports Socks 4/4a/5 and HTTP connections. The user can choose to compress directory listing and file transfers with MODE Z. Band width limiting keeps your line responsive, if required.\n\n\nNative 64-bit Version for Windows x64 Edition\n\nSpeedCommander is also available as native 64-bit version for Windows x64. Only a real 64-bit file manager can access all files on Windows x64. 32-bit applications are rerouted to &quot;WindowsSysWow64&quot; and can't access the folder &quot;WindowsSystem32&quot;.\n\n\n\nMore infos at\n &lt;a href=&quot;\nhttp://www.speedproject.de/enu/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.speedproject.de/enu/index.html&lt;/a&gt;\n\n\n\nThe Portable SFX EXE file is built up using WinRAR. You can use it to extract the files and check them one by one if you want to be sure of what is running on your machine.\n\n\nThis has also been built on an XP x86 machine, I don't know if this program can run on a x64 or Vista machine. It's up to you to check it if you are using them.\n\n\n\nSUGGESTIONS ON USING P2P DOWNLOADS\n==================================\n\n1) It's always better to run all downloaded programs using Sandboxie or a similar virtual machine until you are sure they are clean.\n\n\n2) When in doubt, scan them with an Internet Scan service as the ones provided by Jotti and VirusTotal\n &lt;a href=&quot;\nhttp://virusscan.jotti.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://virusscan.jotti.org/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.virustotal.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.virustotal.com/&lt;/a&gt;\n\nThis will ***NOT*** give you any warranty that a file passing their analysis is clean, nor that if they see them as a troian it's so or not just another false positive, but helps you to decide and at least ask for help or infos.\n\n\n3) Remember, trust nobody, and when in doubt, go to point 1) \n\n\n4) If you find any upload containing trojans or whatsoever malicious or unclean, instead of start cursing in the comments of the upload, take the time to go to the Suprbay Forum at:\n &lt;a href=&quot;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&lt;/a&gt;\n\nand report links and comments there, and someone will take care of all the nasties.\n\n\nThat's the only way to keep TPB and its uploads fresh and clean.\n\n\nThat's for what is regarding security. If after testing it you see that you like it and it's useful for you, show your support by buying it!\n\n\n\nEnjoy and remember to seed... :o)\n\n\n","torrent":{"xt":"urn:btih:927f06b810cf0510ab164882cc4af8dff2f4aa25","amp;dn":"Speed+Commander+v13.20+b6100+Portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"927f06b810cf0510ab164882cc4af8dff2f4aa25","infoHashBuffer":{"type":"Buffer","data":[146,127,6,184,16,207,5,16,171,22,72,130,204,74,248,223,242,244,170,37]},"announce":[],"urlList":[]}}