{"title":"Seascapes - Maritime Histories, Littoral Cultures, and Transocea","uid":9945269,"size":3435517,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9381e590916719f2fbfc3906a9eebc8be92721bc&amp;dn=Seascapes+-+Maritime+Histories%2C+Littoral+Cultures%2C+and+Transocea&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STBGD","files":-1,"time":1397301478,"description":"Jerry H. Bentley, &quot;Seascapes: Maritime Histories, Littoral Cultures, and Transoceanic Exchanges&quot;.\nPublisher: University of Hawaii Press | ISBN: 082483027X | 2007 edition | PDF | 273 Pages | 3.2 MB\n\nThe world's seas and oceans have played roles of great significance in world history, serving variously as highways of trade, routes of migration, lifelines of empires, spawning grounds of creole cultures, and venues of opportunity for pirates and smugglers. Yet historians have only recently begun to chart the experiences of maritime regions in rich detail and penetrate the historical processes at work there. Seascapes makes a major contribution to these efforts by bringing together original scholarship on historical issues arising from maritime regions around the world.The essays presented here take a variety of approaches. One group examines the material, cultural, and intellectual constructs that inform and explain historical experiences of maritime regions. Another set discusses efforts--some more successful than others--to impose political and military control over maritime regions. A third group focuses on issues of social history such as labor organization, information flows, and the development of political consciousness among subaltern populations. The final essays deal with pirates and efforts to control them in Mediterranean, Japanese, and Atlantic waters.Seascapes makes several notable contributions to historical scholarship. It constitutes a rich sampler of recent scholarship on the history of sea and ocean basins and makes clear that activities pursued by human groups over maritime spaces demand the historian's attention as much as those carried out on land. The essays articulate new regional and global geographies that complement the land-based geography that informs most historical scholarship. They chart several of the very different ways human groups have exploited the possibilities offered by different maritime environments. In doing so, they reinforce the point that historical scholarship must pay close attention to the particularities of individual regions. Finally, the volume enriches understanding of the global past by articulating maritime perspectives on the past and insisting that historians consider relationships between lands and seas in their efforts to understand the world and its development through time.","torrent":{"xt":"urn:btih:9381e590916719f2fbfc3906a9eebc8be92721bc","amp;dn":"Seascapes+-+Maritime+Histories%2C+Littoral+Cultures%2C+and+Transocea","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9381e590916719f2fbfc3906a9eebc8be92721bc","infoHashBuffer":{"type":"Buffer","data":[147,129,229,144,145,103,25,242,251,252,57,6,169,238,188,139,233,39,33,188]},"announce":[],"urlList":[]}}