{"title":"Dragon Ball Z: El Ataque Del Dragon","uid":4184504,"size":367491072,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:94d5b7b7b30c92c653f0261c6f9df26e5be9f8bd&amp;dn=Dragon+Ball+Z%3A+El+Ataque+Del+Dragon&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cazomdb","files":1,"time":1210553676,"description":"En un planeta lejano, Konatzu, al sur de la galaxia, hubo por un tiempo una mÃƒÂ¡quina peligrosa: Hildegan. Era capaz de destrozar terrenos bastante amplios. Hildegan se enfrentÃƒÂ³ a Minosha, con lo que despertÃƒÂ³ a TapiÃƒÂ³n, hermano mayor del primero de sus enemigos. TapiÃƒÂ³n consiguiÃƒÂ³ acabar con el malvado monstruo dividiÃƒÂ©ndolo en dos parte y encerrÃƒÂ¡ndolas en lugares diferentes. AsÃƒÂ­, lo dejÃƒÂ³ prÃƒÂ¡cticamente sin poder. Sin embargo, para ello Tapion tuvo que quedar encerrado en la parte superior de Hildegan, y su hermano Minosha en la parte inferior... DespuÃƒÂ©s de varios siglos de historia desde estos acontecimientos, en la Tierra, Son Gohan y Videl son los defensores de Satan City. Ambos salvan a Hoi, un anciano, ÃƒÂºnico superviviente del planeta Konatzu. Ãƒ?ste les convence para abrir su curiosa caja de mÃƒÂºsica. Al parecer, allÃƒÂ­ quedÃƒÂ³ encerrado el hÃƒÂ©roe de su civilizaciÃƒÂ³n. Al final, todo por una pequeÃƒÂ±a &quot;caja de Pandora&quot;, tendrÃƒÂ¡n que recurrir a Shenron para abrirla. Y efectivamente descubren que se trataba de una trampa, pues no sÃƒÂ³lo se libera TapiÃƒÂ³n (el supuesto hÃƒÂ©roe), sino Hildegan. TapiÃƒÂ³n relata la historia de su planeta y pide algo de ayuda para terminar con el monstruo y no liberar su segunda mitad... Se reÃƒÂºne con Trunks y toca una curiosa canciÃƒÂ³n y recuerda a Minosha. Hoi resultÃƒÂ³ ser el creador de Minosha. A pesar del intento de Gokuu y Gohan, se libera la segunda parte y Hildegan llega a su estado completo. De esta forma va derrotando sin problemas a Goku, Gohan, Vegeta e incluso a Gotenks, fusiÃƒÂ³n de Trunks y Goten. Aunque Goku llega a su tercer nivel, no consigue derrotarlo. Finalmente lo harÃƒÂ¡ con su ataque del dragÃƒÂ³n, con el cual Hildegan queda destruido para siempre...\n  La pelÃƒÂ­cula se hizo con motivo de la Toei Animation Fair de verano de 1995. Es un festival semestral que celebran algunas productoras de animaciÃƒÂ³n para representar sus mejores novedades, normalmente las que mÃƒÂ¡s ÃƒÂ©xito tendrÃƒÂ¡n. Evidentemente, allÃƒÂ­ estaba El Ataque del DragÃƒÂ³n y vemos que es una de las pelÃƒÂ­culas de Dragon Ball Z que mejor resultado han dado... Lo comprobamos con los nuevos efectos especiales, la calidad de imagen y la apariciÃƒÂ³n de un nuevo personaje que ha despertado mucha curiosidad: TapiÃƒÂ³n, al cual, sin embargo, no hemos visto en mÃƒÂ¡s pelÃƒÂ­culas de Dragon Ball.\nAdemÃƒÂ¡s hay una nueva tÃƒÂ©cnica, el Ataque del DragÃƒÂ³n, que Goku sÃƒÂ³lo utilizÃƒÂ³ en Dragon Ball GT contra Super C-17, nunca lo vimos en Dragon Ball Z ni en el manga. ","torrent":{"xt":"urn:btih:94d5b7b7b30c92c653f0261c6f9df26e5be9f8bd","amp;dn":"Dragon+Ball+Z%3A+El+Ataque+Del+Dragon","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94d5b7b7b30c92c653f0261c6f9df26e5be9f8bd","infoHashBuffer":{"type":"Buffer","data":[148,213,183,183,179,12,146,198,83,240,38,28,111,157,242,110,91,233,248,189]},"announce":[],"urlList":[]}}