{"title":"Coast to Coast Radio Program! Commercial Free! Jan 24th thru Jan","uid":4008381,"size":443048971,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:95606cbb1a32dd819bb1cb0b236152d2ad357d22&amp;dn=Coast+to+Coast+Radio+Program%21+Commercial+Free%21+Jan+24th+thru+Jan&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Stokeman","files":40,"time":1201912311,"description":"I hope eight days was plenty of time for you all to get through the last eighteen broadcasts because you now have more to listen to! Anyway, Download, SEED, and definitely Enjoy! Thanks in advance to all the seeders and those that pass this on to other torrent sites. We are spreading the knowledge exponentially! Later All! Stokeman Out...\n\n\nThursday January 24th, 2008\nThe Doors &amp; Jim Morrison\nStarting in the first hour, author R. Gary Patterson was joined by guitarist Robby Krieger and keyboardist Ray Manzarek, both from the legendary Doors. The two musicians discussed being part of the group, working with Jim Morrison, and questions surrounding... \nHost: George Noory\nGuest(s): R. Gary Patterson, Robby Krieger, Ray Manzarek\n\nFriday January 25th, 2008\nThe Elite&amp;#039;s Master Plan\nBroadcasting live from the studios of KLBJ in Austin, Texas, George was joined by filmmaker and activist Alex Jones, who discussed his film Endgame and the Elite&amp;#039;s master plan to dominate and oppress humanity. Jones warned listeners about a &amp;#039;control-grid&amp;#039;... \nHost: George Noory\nGuest(s): Alex Jones\n\nSaturday January 26th, 2008\nThe Space Race\nHistorian Michael D&amp;#039;Antonio discussed his new book A Ball, a Dog and a Monkey, which chronicles the rollicking start of the space race between the United States and Soviet Union. The first artificial satellite to be put into space was Sputnik 1... \nHost: Ian Punnett\nGuest(s): Michael D&amp;#039;Antonio, Catherine Austin Fitts\n\nSunday January 27th, 2008\nET &amp; UFO Secrets\nRetired Air Force Capt. Robert Collins spoke with George Knapp (email) about his investigations into UFOs, ETs, MJ-12 and government knowledge. Collins detailed his involvement with a secretive group with ties to intelligence and the military, known...\nHost: George Knapp\nGuest(s): Robert Collins, Alejandro Rojas, Ken Cherry, Dick Criswell\n\nMonday January 28th, 2008\nProphecy, 2008 &amp; Beyond\nProphecy scholar John Hogue discussed what the future has in store, including the economy, elections, climate change and terrorism. We&amp;#039;re entering the first half of a 36 year cycle-- a chaotic, revolutionary period, he stated. Right now, we&amp;#039;re heading... \nHost: George Noory\nGuest(s): John Hogue, Raymond Moody\n\nTuesday January 29th, 2008\nEMF Dangers\nAppearing during the middle two hours, environmental consultant Cindy Sage discussed the dangerous health effects of electro-magnetic fields (EMF) radiating from a variety of sources. Of particular concern are the exponentially popular cell phones... \nHost: George Noory\nGuest(s): Cindy Sage, David B. Sereda\n\nWednesday January 30th, 2008\nBermuda Triangle Incident/Skinwalker Ranch Replay\nGeorge was live in the first hour with Dr. Roger Leir, and David Anderson, a former Navy pilot who spoke about his anomalous experiences in the Bermuda Triangle some 50 years ago. While flying a military plane from Puerto Rico to Florida, he found himself... \nHost: George Noory\nGuest(s): David Anderson, Dr. Roger Leir, Colm A. Kelleher, George Knapp\n\nThursday January 31st, 2008\nForecast for 2008\nIntuitive Sean David Morton shared his forecast for 2008 and beyond. We have entered the astrological period of Pluto in Capricorn and in relation to this, we could see a &quot;huge revolution&quot; against the Federal Reserve and U.S. tax system, a breakdown... \nHost: George Noory\nGuest(s): Sean David Morton, Jerome Corsi","torrent":{"xt":"urn:btih:95606cbb1a32dd819bb1cb0b236152d2ad357d22","amp;dn":"Coast+to+Coast+Radio+Program%21+Commercial+Free%21+Jan+24th+thru+Jan","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"95606cbb1a32dd819bb1cb0b236152d2ad357d22","infoHashBuffer":{"type":"Buffer","data":[149,96,108,187,26,50,221,129,155,177,203,11,35,97,82,210,173,53,125,34]},"announce":[],"urlList":[]}}