{"title":"Anno 1404 - Venice - Patch 3.1","uid":8095413,"size":239992744,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:95d53f476a960d6d02f3099801fe4b153f8c3757&amp;dn=Anno+1404+-+Venice+-+Patch+3.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"dawndawnd","files":1,"time":1359825034,"description":"ANNO 1404 - Venice - Patch Notes 3.1\n\n\nThe most important changes in overview:\n- A bug in the save routine could prevent games from being saved correctly on some systems or system configurations. Related Designs would like to thank the community at this pointfor their outstanding support, without which we could never have repaired this error. In particular, we would like to thank &quot;Matt McCorman&quot; for his active support, as well as all the users from the community who voluntarily contributed both their PC's and their time. We were finally able to localize and correct the error. As a result, no more faulty saves should be generated.\n\n- A warning is generated when the physical memory (RAM) has reached a critical fill or defragmentation status. The instructions in the text message should be followed. If the message appears frequently, lowering the texture and object quality in the game options can often lead to a significant improvement.\n\n\n\nFurther changes:\n- Until now, players were able to avoid having to pay for the extension of the Corsair Pact by proposing fraternization. This option was removed, so now the player must now either pay, or deal with the consequences.\n- Fixed a bug that prevented the launch of user-scenario savegames on other computers.\n-     Selecting a portrait exclusive to the ANNO 1404 - Venice AddOn could lead to errors when playing ANNO 1404. This bug has been corrected.\n- Effective immediately, Lord Richard Northburgh now offers more suitable items once all human players have achieved the highest level of prestige in the orient.\n\n\n\nAchievements:\n-     The probability of receiving the items &quot;Excellent Hanseatic League Master Builder&quot; or &quot;Imperial Cathedral Master Builder&quot; has been increased.\n-     The &quot;Shouldn't we be going to war soon&quot; achievement is now correctly unlocked once players have played 10 hours of a multi-player game.\n-     The &quot;Actions speak louder than words&quot; achievement is now correctly unlocked once players have played 3 hours of a multi-player game without chatting. This makes it possible to attain the &quot;A shut mouth catches no flies&quot; achievement.\n-     The &quot;I work best under pressure&quot; achievement is now correctly unlocked as soon as the &quot;Incognito&quot; scenario is completed with a travel time of 30 minutes (or more).\n-     The &quot;I could turn myself in&quot; achievement is now correctly unlocked as soon as the player has achieved a bounty of 80,000 gold coins (or more) in the &quot;Scourge of the Seas&quot; scenario. This makes it possible to attain the &quot;Like a proper Corsair&quot; and &quot;I'm the best&quot; achievements.\n-     The &quot;Master detective&quot; achievement is now correctly unlocked as soon as the player has completed the &quot;In the trap&quot; and &quot;Unknown cargo&quot; quests. This makes it possible to also attain the &quot;I'm the best&quot; achievement.\n-     The &quot;Urgent business II&quot; quest is no longer withdrawn as soon as it's posted. This allows the quest chain to be completed properly, making it possible to attain the &quot;Masquerade&quot;, &quot;New challenges&quot; and &quot;Well done&quot; achievements.\n-     The &quot;The disloyal Assistant III&quot; quest didn't spawn any blockade ships. This prevented completion of the quest chain, preventing players from attaining the &quot;Everything has it's price&quot; achievement. This bug has been corrected.\n-     Hekata was not offering the &quot;The fourth sister (I-III)&quot; quest chain. This prevented completion of the quest chain, preventing players from attaining the &quot;The might of the three&quot; achievement. This bug has been corrected.\n-     Marie d'Artois was not offering the &quot;Journey into the past (I-IV)&quot; quest chain. This prevented completion of the quest chain, preventing players from attaining the &quot;You all owe me a favor&quot; achievement. This bug has been corrected.","torrent":{"xt":"urn:btih:95d53f476a960d6d02f3099801fe4b153f8c3757","amp;dn":"Anno+1404+-+Venice+-+Patch+3.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"95d53f476a960d6d02f3099801fe4b153f8c3757","infoHashBuffer":{"type":"Buffer","data":[149,213,63,71,106,150,13,109,2,243,9,152,1,254,75,21,63,140,55,87]},"announce":[],"urlList":[]}}