{"title":"Grifter v2 - The All New Adventures of Grifter","uid":4353721,"size":173623222,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:95ddc9438697a51889210a927f41d7216966b4b6&amp;dn=Grifter+v2+-+The+All+New+Adventures+of+Grifter&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"robotech52","files":15,"time":1219304701,"description":"Title: The All New Adventures of Grifter\nRelease Date: 1996\nFile Type: .cbz (comic books)\nFile Size 14 x ~10MB (~165MB Total)\nVideo Size: n/a\nIssues: 14\nAudio: n/a\nText: English\nhttp://en.wikipedia.org/wiki/Grifter_(comics)\nhttp://en.wikipedia.org/wiki/WildC.A.T.S.\n\n\nGrifter is a fictional comic book character from Wildstorm Universe. He is best known as a member of Jim Lee's WildC.A.T.S.\n\nThe Wild C.A.T.s\n\n... Cole and Zealot broke up; for Zealot it was just another relationship, but Cole had become devoted to her, being eternally grateful to her for restoring his sanity. However they remained on good terms, and both were recruited to become part of Lord Emp's Daemonite hunting team, the WildC.A.T.s. Grifter later quit the team when they had to ally with Hightower, a Daemonite who had killed Grifter's friend Lonely. He rejoined when the team came back from Khera, even being the team's leader for some time. During this time Max Cash, his younger brother, was killed, came back as a zombie and was killed again by Grifter himself. He left the team again after Zealot's apparent death. At this point most of his teammates left as well and the WildC.A.T.s were disbanded. (WildC.A.T.s volume 1 and Grifter)\n\nThe Wildcats\n\nMonths later he joined the Wildcats, a small group that included Lord Emp, Spartan and the French weapons dealer known as Noir. During a fight with Kenyan, he found out that the villain knew something about Zealot's death. After the madman's plan was twarted, Grifter decided to do some work of his own in order to find his enemy. He used Noir's technological expertise and Spartan's access to the Halo's mainframe in order to track Kenyan and the missing Emp down. There, Kenyan killed himself.\n\nAfter Emp's ascension, Grifter sank into a depression, he began drinking and having one-night stands with women who reminded him of Zealot. Finally Zealot herself returned, but at the time Grifter was too drunk to recognise her. After a night of sex, Zealot left him before Grifter realised who she was. He caught up with her again while she was fighting the Coda. Zealot told him that the Coda had betrayed her teachings and she had sworn to wipe them all out. She added that she would spare Grifter, despite being Coda-trained, because of their history. After this meeting, Grifter straightened out his life and joined Jack Marlowe's (Spartan) Halo Corporation. (Wildcats volume 2)\n\n\tIf you like this and you can afford it, BUY IT!\n","torrent":{"xt":"urn:btih:95ddc9438697a51889210a927f41d7216966b4b6","amp;dn":"Grifter+v2+-+The+All+New+Adventures+of+Grifter","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"95ddc9438697a51889210a927f41d7216966b4b6","infoHashBuffer":{"type":"Buffer","data":[149,221,201,67,134,151,165,24,137,33,10,146,127,65,215,33,105,102,180,182]},"announce":[],"urlList":[]}}