{"title":"Cooke-Mystery Confusion(Jesuit Vaticanomy around world)(1999)","uid":4540092,"size":273023,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:96ee5b984a1dc23f19669821d1b501d93077ff5f&amp;dn=Cooke-Mystery+Confusion%28Jesuit+Vaticanomy+around+world%29%281999%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"red_gonzo","files":1,"time":1227905138,"description":"This is Ronald Cooke&amp;#039;s revealing book Mystery Confusion (1999) which is a documented study embracing the United States, El Salvador and the European Economic Community, showing how differently the Roman Catholic system works to try to produce a Jesuit Vaticanomy. It was Macaulay who first said that Rome is a like lamb when she is in the minority, that she is like a fox when she gains equality, and she is like a tiger when in the majority. In this brief study Cooke looks at how the system of Rome has worked in the United States where she has always been in the minority and at El Salvador where she was decidedly in the majority. The author describes the system of Roman Catholicism as it operates out of the Vatican State. There are obviously many different types of Roman Catholic clergy. In this study the readers will see Roman Catholic priests who fought alongside the Marxist Revolutionaries, some others who opposed them, some who participated in the armed struggles to help defenseless women and children, others who remained aloof. You will see Roman Catholics being killed and you will see Roman Catholics doing the killing. The system of Rome is out to control the world. Find out how it works in different countries to achieve this goal. 75 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:96ee5b984a1dc23f19669821d1b501d93077ff5f","amp;dn":"Cooke-Mystery+Confusion%28Jesuit+Vaticanomy+around+world%29%281999%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96ee5b984a1dc23f19669821d1b501d93077ff5f","infoHashBuffer":{"type":"Buffer","data":[150,238,91,152,74,29,194,63,25,102,152,33,209,181,1,217,48,119,255,95]},"announce":[],"urlList":[]}}