{"title":"Fight On!, Volume 1-2 - Dr. Samuel C. Gipp","uid":11773624,"size":717518,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:96fc3bab840e33dcc6926863b1f0dd1c7ea813eb&amp;dn=Fight+On%21%2C+Volume+1-2+-+Dr.+Samuel+C.+Gipp&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"starxteel","files":2,"time":1427178777,"description":"\nFight On!\nLife is tough! We are tougher! But there are times when you need a little boost, a little help to get over the big hurdles of life. The stories found in FIGHT ON! are about people who met life's challenges head on. Sometimes it was voluntary. Sometimes it was due to circumstances beyond their control. But one-and-all they refused to give in or give up. Some persevered and live out fruitful lives. Some left us nothing but their extraordinary valor to encourage us. But all of them won!\n\nThis book is an anthology of stories of struggles for survival in the most austere circumstances. Whether it is in combat, earthquakes, airplane wrecks. Fires, train wrecks, mining disasters, the people whose stories follow have givenus all an example of what can be accomplished when we refuse to surrender to our circumstances!\n\nAll the stories in this book are true and have been recorded without embellishment. Truth, by itself, is astounding enough. Whatever your personal battle is, it is hoped that something you read within the covers of this book will help you get through, help you survive and even prosper. Who knows, maybe you will even end up in a future edition of FIGHT ON!\n\nMore Fight On!\nThe first volume of Fight On! has been a great success. Now Sam Gipp delivers 300 more pages of incredible stories of people who were tougher than their problems. Read about men and women who chose not to lose through fire, shipwreck, wild animal attacks, volcanos, mining disasters, wars and other of life's may trials. Some were professional soldiers. Some were just everyday Dads and Moms who refused to give in or give up. Instead they chose to FIGHT ON!\n\n\nThis collection of true stories are great for motivational speakers, sermon illustrations, camp fire stories, or for the lone individual facing life's daunting tasks who needs a boost to Fight On!\n\n\nAbout the author:\nDr. Gipp is a former pastor, an evangelist, teacher, author and Bible conference speaker. He has the unique ability to digest large amounts of information and then present it in an analytical, understandable, format. His humerous, informative and forceful preaching style make him popular with all ages and keeps him in demand as a Revivalist and Bible conference speaker","torrent":{"xt":"urn:btih:96fc3bab840e33dcc6926863b1f0dd1c7ea813eb","amp;dn":"Fight+On%21%2C+Volume+1-2+-+Dr.+Samuel+C.+Gipp","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96fc3bab840e33dcc6926863b1f0dd1c7ea813eb","infoHashBuffer":{"type":"Buffer","data":[150,252,59,171,132,14,51,220,198,146,104,99,177,240,221,28,126,168,19,235]},"announce":[],"urlList":[]}}