{"title":"Bitdefender &amp; MBAM Free Software &amp; Add-ons for Firefox 3","uid":9492157,"size":539669650,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:9725360c24dd376832e74cadfb0936ad70ffb542&amp;dn=Bitdefender+%26amp%3B+MBAM+Free+Software+%26amp%3B+Add-ons+for+Firefox+3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xMaikel","files":10,"time":1390014766,"description":"[b]You are NOT obligated to download from here. I will provide external links to everything. This is here for your convenience.[/b]\n\n[url=&quot;http://www.bitdefender.com/solutions/free.html&quot;]Original Source[/url]\n\n[img]http://download.bitdefender.com/resources/themes/red/images/sld02_03.png[/img]\n\n[img]http://download.bitdefender.com/resources/themes/red/images/avtest-2013_03.png[/img]\n\n[b]UNBREACHABLE SECURITY[/b]\n\nAward-winning, free protection. Bitdefender Antivirus Free Edition uses the best technologies created in Bitdefender's labs, internationally recognized for their ability to block even the threats that other products miss.\n\n[b]NO NAGGING COMMERCIALS[/b]\n\nWe know you don't like it when intrusive commercials disrupt your user experience. That's why Bitdefender Antivirus Free Edition only displays discreet, rare messages, with stuff you really need to know.\n\n\n[b]ZERO QUESTIONS CONFIGURATIONS[/b]\n\nSay goodbye to checkboxes to tick and options to OK . Bitdefender Antivirus Free Edition takes care of all the threats without bothering you with useless details.\n\n[b]LIGHT. LIGHTER. LIGHTEST![/b]\n\nWhen we say our product is feather-light, we mean there is practically NO IMPACT on your PC's performance. Not even a trace of sluggishness, regardless of the age of your system.\n\n[img]http://download.bitdefender.com/resources/themes/red/images/sld03_03.png[/img]\n\n[img]http://download.bitdefender.com/resources/themes/red/images/blueicons_03.png[/img]\nUsing the latest Windows? Bitdefender Antivirus Free Edition is the first free antivirus solution compatible with Windows 8.\n\n[img]http://download.bitdefender.com/resources/themes/red/images/blueicons_05.png[/img]\nBitdefender Antivirus Free Edition is the perfect AV solution for gaming. It pauses major system scans until you hit Quit.\n\n\n\nBitdefender Antivirus Free Edition has been engineered to enable you to enjoy your computer to the max, without having to worry about viruses and other e-threats.\n\nWe call it &quot;artificial intelligence&quot; because it will always find the best way for your system to stay clear of dangers without requiring special configuring. And, more importantly, without slowing down your system.\n\nBitdefender Antivirus Free Edition shares some of the revolutionary technologies that allowed our main product line to outpass major competitors such as AVG, Avast or Avira.\n\n\n\n[b]What makes us the best?[/b][size=175][/size]\nExclusive, top of the heap defense\nBitdefender uses proprietary technology, as well as other technologies integrated to provide maximum strength against e-threats.\n\n [b]Real-time Shield[/b] - The real time shield is designed to protect your entire system from infected files coming from the outside, before they have a chance to spread inside your PC.\n [b]Active Virus Control[/b] - Proactive technology that quickly and accurately detects potential threats, even in cases of new viruses for which there is no default protection released yet.\n [b]Intrusion Detection System[/b] - Ensures that applications trying to access the Internet or the network are not masked malware. Intrusion Detection is automatically alerted when such apps behave in a suspect manner, and blocks them when they go over the limit.\n [b]B-Have[/b] - Proactively detects unknown threats that other products miss, by analyzing how apps behave in a safe environment. If no malicious actions are detected, B-Have starts the program normally. Otherwise, it will automatically quarantine or delete it.\n [b]HTTP Scanning[/b] - Protects you from scams such as credit card phishing attempts, Bitdefender Antivirus Free Edition scans all the links you access from your browser and blocks them when they prove to be unsafe.\n\n [b]Anti-rootkit[/b] - Rootkits are a type of stealth software, often malicious, that can help hackers get control of your computer. Bitdefender Antivirus Free Edition uses special technology that detects and blocks such malicious software.\n\n[b]Light. Automatic.[/b]\nBitdefender Antivirus Free Edition uses an intelligent mechanism that can automatically take the optimum decisions to provide ironclad security without slowing down your computer.\n\n [b]Early Boot Scanning[/b] - This technology scans the system at boot time, as soon as all critical services are loaded. Early boot scanning ensures virus detection at system startup, while also improving boot time.\n [b]Auto Scan[/b] - A huge time and resource saver, Auto Scan is a Bitdefender proprietary technology that focuses virus detection efforts on risky areas.\n\n\n\n[size=200][b]System Requirements[/b][/size]\n[b]Minimum system requirements[/b]\n[b]Operating system[/b]: Windows XP SP3 32-bit, Windows Vista (SP2), Microsoft Windows 7 (SP1), Microsoft Windows 8\n[b]RAM[/b]: 512MB\n[b]Hard disk space[/b]: 700 MB\n\n[size=100][b]Recommended system requirements[/b][/size]\n[b]Operating system[/b]: Windows XP SP3 32-bit, Windows Vista (SP2), Microsoft Windows 7 (SP1), Microsoft Windows 8\n[b]RAM[/b]: 1 GB\n[b]Hard disk space[/b]: 1 GB\n\n[img]http://download.bitdefender.com/resources/themes/red/images/av-free-bottom_03.png[/img]\n[b]BitDefender Antivirus Free Edition[/b]\nThe free antivirus that uses highest rated protection technology and is light on resources.\n[i]&quot;Smart and Silent [..] Bitdefender Antivirus Free Edition (2014) is definitely a good choice.&quot;[/i]\n[small][b]PC MAG | July 2013[/b][/small]","torrent":{"xt":"urn:btih:9725360c24dd376832e74cadfb0936ad70ffb542","amp;dn":"Bitdefender+%26amp%3B+MBAM+Free+Software+%26amp%3B+Add-ons+for+Firefox+3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9725360c24dd376832e74cadfb0936ad70ffb542","infoHashBuffer":{"type":"Buffer","data":[151,37,54,12,36,221,55,104,50,231,76,173,251,9,54,173,112,255,181,66]},"announce":[],"urlList":[]}}