{"title":"The Mechanics of Engineering Structures - David W A Rees","uid":11982772,"size":36315544,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:975007d8421dc2dc19df44eb496f37ed9fee0562&amp;dn=The+Mechanics+of+Engineering+Structures+-+David+W+A+Rees&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1433265407,"description":"Engineering structures considered include bars, columns, struts, tubes, vessels, beams, springs and frames. The loadings imposed upon them are, typically, tension, compression and shear, bending, torsion and pressure, separately and in combination. The mechanics of such structures examine the manner in which they each bear their respective loading in a safe predictable way. This aids design considerations upon choice of material and its physical shape when seeking, say, a safe design with low weight.\n\nThe presentation of chapters is intended to guide the reader from a basic to more advanced understanding of common engineering structures. Thus, the consideration of stress and strain under elastic and plastic conditions is required for a full understanding of a structure that may bend, twist and buckle as it is deflected by its loading. The approach adopted is to intersperse theory with examples and exercises that emphasise practical application. Standard analytical techniques including stress transformation, energy methods and yield criteria precede a final chapter on finite element analysis.\n\nWorked examples and exercises have been devised and compiled by the author to support the topics within each chapter. Some have been derived, with a conversion to SI units, from past examination papers set by institutions with which the author has been associated, namely: Brunel, Kingston and Surrey Universities and the Council of Engineering Institutions.\n\nThe contents should serve most courses in mechanical, civil, aeronautical and materials engineering.\n\nReadership: Undergraduate and postgraduate engineering students from intermediary to advanced levels","torrent":{"xt":"urn:btih:975007d8421dc2dc19df44eb496f37ed9fee0562","amp;dn":"The+Mechanics+of+Engineering+Structures+-+David+W+A+Rees","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"975007d8421dc2dc19df44eb496f37ed9fee0562","infoHashBuffer":{"type":"Buffer","data":[151,80,7,216,66,29,194,220,25,223,68,235,73,111,55,237,159,238,5,98]},"announce":[],"urlList":[]}}