{"title":"Children of Dust - A Portrait of Pakistan - Ali Eteraz.epub","uid":8869566,"size":536156,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:97e83c7c77fb9e838e58396705aa0020ab36dd73&amp;dn=Children+of+Dust+-+A+Portrait+of+Pakistan+-+Ali+Eteraz.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1378024643,"description":"Ali Eteraz's Children of Dust is a spellbinding portrayal of a life that few Americans can imagine. From his schooling in a madrassa in Pakistan to his teenage years as a Muslim American in the Bible Belt, and back to Pakistan to find a pious Muslim wife, this lyrical, penetrating saga from a brilliant new literary voice captures the heart of our universal quest for identity.\n\nChildren of Dust begins in rural Islam at the lowest levels of Pakistani society in the turbulent eighties. This intimate portrayal of rustic village life is revealed through a young boy's eyes as he discovers magic, women, and friendship.\n\nAfter immigrating with his family to the United States, Eteraz struggles to be a normal American teenager under the rules of a strict Muslim household.\n\nIn 1999, he returns to Pakistan to find the villages of his youth dominated by the ideology of the Taliban, filled with young men spouting militant rhetoric, and his extended family under threat. Eteraz becomes the target of a mysterious abduction plot when he is purported to be a CIA agent, and eventually has to escape under military escort.\n\nBack in the United States, with his fundamentalist illusions now shattered, Eteraz tries to find a middle way within American Islam. At each stage of Eteraz's life, he takes on a different identity to signal his evolution. From being pledged to Islam in Mecca as an infant, through Salafi fundamentalism, to liberal reformer, Eteraz desperately struggles to come to terms with being a Pakistani and a Muslim.\n\nAstonishingly honest, darkly comic, and beautifully told, Children of Dust is an extraordinary adventure that reveals the diversity of Islamic beliefs, the vastness of the Pakistani diaspora, and the very human search for home.","torrent":{"xt":"urn:btih:97e83c7c77fb9e838e58396705aa0020ab36dd73","amp;dn":"Children+of+Dust+-+A+Portrait+of+Pakistan+-+Ali+Eteraz.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97e83c7c77fb9e838e58396705aa0020ab36dd73","infoHashBuffer":{"type":"Buffer","data":[151,232,60,124,119,251,158,131,142,88,57,103,5,170,0,32,171,54,221,115]},"announce":[],"urlList":[]}}