{"title":"Kemper.2008.DVDRIP.XViD-TDX","uid":4556214,"size":734031872,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:987845b84f75d5beaf4fb9fb090579940421e8b1&amp;dn=Kemper.2008.DVDRIP.XViD-TDX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"circlensess","files":1,"time":1228495313,"description":"Kemper (2008) Movie Review\n6 out of 10 Skulls\nWritten by: jackalqueen\n\nKemper is based on the true story of the serial killer, Ed Kemper (Robert Sisko, looking and sounding spookily like Dustin Hoffman), and his eventual arrest. For those who don&amp;#039;t know the story, Kemper was a petty criminal who also worked as an unofficial profiler for the police, in the days before such a job really existed. He became friends with Detective Harris and helped him solve other serial killings while pointing him in the wrong direction regarding his own crimes. He snapped one day and killed his domineering mother and then the nature of his true crimes came to light and the manhunt began. There is obviously a bit of artistic license at work here because the real crimes took place in the late 60&amp;#039;s/early 70&amp;#039;s but in the film, people use mobile phones and laptops. The year is never mentioned in the film though so it doesn&amp;#039;t seem too out of place.\n\nIt&amp;#039;s a weird one to try and review... it&amp;#039;s listed on IMDb as a horror and it is, but only in so much as it&amp;#039;s about real people being tortured and murdered, which is obviously horrific. The film itself isn&amp;#039;t really a horror though - there is very little gore and the killings are barely shown as they are secondary to the relationship between Kemper and Harris. It reminded me of &amp;#039;Zodiac&amp;#039; from last year, in that this is more about the mentality of the killer and the toll it takes on the lives of detectives working these cases.\n\nIf you are interested in the subject of serial killers, true crime or the relationships that form between killers and detectives, this film will interest you - I don&amp;#039;t think &amp;#039;entertain&amp;#039; is the right word in this case. If you are looking for a serial killer &amp;#039;horror&amp;#039; then this will seem tame in comparison to many of the gore-fests available... which is a sad indictment of society that a real murder would be considered boring or mundane, but that&amp;#039;s the chance they take by marketing something as a horror when it&amp;#039;s not.","torrent":{"xt":"urn:btih:987845b84f75d5beaf4fb9fb090579940421e8b1","amp;dn":"Kemper.2008.DVDRIP.XViD-TDX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"987845b84f75d5beaf4fb9fb090579940421e8b1","infoHashBuffer":{"type":"Buffer","data":[152,120,69,184,79,117,213,190,175,79,185,251,9,5,121,148,4,33,232,177]},"announce":[],"urlList":[]}}