{"title":"Coast to Coast AM July 07, 2013 - Subtle Energy Archons &amp; So","uid":8672953,"size":56722653,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:9935cb8b35397cfeacd9101194fbe71bf0cdf15f&amp;dn=Coast+to+Coast+AM+July+07%2C+2013+-+Subtle+Energy+Archons+%26amp%3B+So&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pyramid91","files":5,"time":1373532180,"description":"MP3 version wins!\nCourtesy of Coast to Coast Am's wonderful  &quot;Coast Insider&quot; service!\nShow description:\n\nDate:\n07-07-13\nHost:\nGeorge Noory\nGuests:\nCyndi  Dale,                   John  Lash\nIn the first half, author, intuitive, and healer Cyndi Dale talked about the subtle energy system, and how it affects our health, relationships, career, and finances. Subtle energy, in contrast to physical energy, moves faster than the speed of light, and bends all the laws of the universe, she said. &quot;If we can learn to harness this energy, we can literally make things happen you could even say before they need to happen. I believe at least 98% of reality is actually born from subtle energy-- the stuff that we typically can't see, touch or smell, and yet it permeates everything-- it's the energy that makes things happen,&quot; she stated. \nRelationships are all about subtle energies interacting with subconscious programs that communicate with other people, she continued. &quot;It's the subtle energy that runs the messages we're sending into the world and determines how people are going to see or feel us in their subconscious, and therefore how they're going to treat us as well,&quot; Dale explained. In discussing the interplay of subtle energy with health, she noted that problems such as arthritis or an injury that doesn't heal can be associated with blocked feelings. When these feelings are dealt with or processed, the problem sometimes clears up, she reported. \n------------------------------------------------\nScholar and mythologist John Lash introduced the term &quot;Archons&quot; to the public 12 years ago. In the latter half of the show, he discussed the specific beings the word refers to, and the ancient cosmological events which may provide direction toward a solution to the woes of the human race. Culling his interpretations from the ancient Gnostic texts called the Nag Hammadi, he characterized the Archons as predatory inorganic ETs that come in two types-- a &quot;neonate&quot; with a large head and spindly arms (what we think of as the Greys), and a &quot;draconic&quot; or Reptilian type. The Gnostics warn that the Archons have introduced into the human mind a delusional belief system under the cover of the Judeo-Christian religion, so they can enslave humanity, Lash revealed. \nThe lie that the Archons want us to believe is that they are our creators-- it was actually the mother Earth Sophia who created us, Lash suggested. According to material from the ancient mystery schools, in the core of the galaxy, Sophia and another Aeon (god being) were like scientists or artists who designed the human genome. &quot;And then they allowed that genomic plasma to be propagated out into the galactic arms to arise in different worlds and planetary systems,&quot; he said. But in her travels, Sophia impacted the matter of the galactic limbs, and accidentally created the Archons, he added. \nNews segment guest: Jeff Nelken\nWebsite(s):\n metahistory.org\n gaiaspora.org\n facebook...Sophias-Correction\n cyndidale.com\nBook(s):\n Not in His Image: Gnostic Vision, Sacred Ecology, and the Future of Belief\n The Seeker's Handbook\n The Complete Book of Chakra Healing\n The Subtle Body: An Encyclopedia of Your Energetic Anatomy\n Energetic Boundaries\n","torrent":{"xt":"urn:btih:9935cb8b35397cfeacd9101194fbe71bf0cdf15f","amp;dn":"Coast+to+Coast+AM+July+07%2C+2013+-+Subtle+Energy+Archons+%26amp%3B+So","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9935cb8b35397cfeacd9101194fbe71bf0cdf15f","infoHashBuffer":{"type":"Buffer","data":[153,53,203,139,53,57,124,254,172,217,16,17,148,251,231,27,240,205,241,95]},"announce":[],"urlList":[]}}