{"title":"The Marriage of Harriett Gold and Elias Boudinot in Letters (182","uid":11602107,"size":3447600,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9ab746b8e6bce029a50479fffbf2decb3ca0806f&amp;dn=The+Marriage+of+Harriett+Gold+and+Elias+Boudinot+in+Letters+%28182&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Inua1","files":1,"time":1417366242,"description":"\nTitle: To Marry an Indian: The Marriage of Harriett Gold and Elias Boudinot in Letters, 1823-1839 \nEditor: Theresa Strouth Gaul\nPaperback: 240 pages\nPublisher: The University of North Carolina Press; 1 edition (April 4, 2005)\nLanguage: English\nISBN-10: 0807856029\nISBN-13: 978-0807856024\n\nWhen nineteen-year-old Harriett Gold, from a prominent white family in Cornwall, Connecticut, announced in 1825 her intention to marry a Cherokee man, her shocked family initiated a spirited correspondence debating her decision to marry an Indian. Eventually, Gold's family members reconciled themselves to her wishes, and she married Elias Boudinot in 1826. After the marriage, she returned with Boudinot to the Cherokee Nation, where he went on to become a controversial political figure and editor of the first Native American newspaper.\n\nProviding rare firsthand documentation of race relations in the early nineteenth-century United States, this volume collects the Gold family correspondence during the engagement period as well as letters the young couple sent to the family describing their experiences in New Echota (capital of the Cherokee Nation) during the years prior to the Cherokee Removal. In an introduction providing historical and social contexts, Theresa Strouth Gaul offers a literary reading of the correspondence, highlighting the value of the epistolary form and the gender and racial dynamics of the exchange. As Gaul demonstrates, the correspondence provides a factual accompaniment to the many fictionalized accounts of contacts between Native Americans and Euroamericans and supports an increasing recognition that letters form an important category of literature","torrent":{"xt":"urn:btih:9ab746b8e6bce029a50479fffbf2decb3ca0806f","amp;dn":"The+Marriage+of+Harriett+Gold+and+Elias+Boudinot+in+Letters+%28182","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ab746b8e6bce029a50479fffbf2decb3ca0806f","infoHashBuffer":{"type":"Buffer","data":[154,183,70,184,230,188,224,41,165,4,121,255,251,242,222,203,60,160,128,111]},"announce":[],"urlList":[]}}