{"title":"Scatman John - Scatman's World TQMP","uid":4714428,"size":347402845,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9af69ab09ec1454ae5ae755cf9f7676a56241264&amp;dn=Scatman+John+-+Scatman%5C%27s+World+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"zootallure","files":24,"time":1234208485,"description":"John Paul Larkin, better known as Scatman John Larkin (sometimes credited as Scatman internationally), was a famous American stuttering jazz musician and poet who created a unique fusion of scat singing and house music, best known for his 1994 hit &quot;Scatman (Ski Ba Bop Ba Dop Bop)&quot;. As he liked to say, this was a process of &quot;turning my biggest problem into my biggest asset&quot;. He has sold millions of recordings worldwide and was named &quot;Best New Artist&quot; in the Echo Awards in both Japan and Germany. He was a recipient of the American Speech-Language-Hearing Association's Annie Glenn Award for outstanding service to the stuttering community and was inducted into the United States National Stuttering Association Hall of Fame.\n\nBorn in El Monte, California, he suffered from a severe stutter &quot;since [he] started talking&quot;, which led to an emotionally traumatic childhood. Even at the peak of his success in 1995, journalists reported that during interviews he &quot;hardly finishes a sentence without repeating the phrase at least six or seven times&quot;. At age 12 he began to learn piano, and was introduced to the art of scat singing at 14 through records by Ella Fitzgerald and Louis Armstrong, amongst others. The piano provided him with a means of artistic expression to compensate for his speech difficulties. He remarked in a 1996 interview that &quot;playing piano gave me a way to speak... I hid behind the piano because I was scared of talking.&quot;\n\nHe became a professional jazz pianist in the 1970s and '80s, playing many gigs in jazz clubs around Los Angeles. In 1986, he released the self-titled album John Larkin on the Transition label, copies of which are now extremely rare. He claimed to have &quot;hundreds of them lying around in [his] closet at home&quot;. Around this time, alcoholism and drug addiction were also beginning to take a hold of his life. When fellow musician and friend Joe Farrell, who also had a drug problem, died of bone cancer in 1986, Larkin decided to beat his habits. He eventually did so, largely with the help of his new wife Judy, also a recovering alcoholic. &quot;You have talent&quot;, she told him. &quot;I'm going to make something out of you&quot;.\nA few years later he was an in ternational star selling millions of records worldwide. He released 3 albums in 5 five years (Scatman's world, Evreybody Jam and Take your time). When he was working on the third one, he was already diagnosed with lung cancer. He died in 1999 in L.A, only 57 years old.\n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project we, fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at: &lt;a href=&quot;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&lt;/a&gt;\n\nPlease feel free to join the TQMP project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n\n\nSay Ã‚Â»thank youÃ‚Â« by seeding... just seed, it is not harmful to your health:D ","torrent":{"xt":"urn:btih:9af69ab09ec1454ae5ae755cf9f7676a56241264","amp;dn":"Scatman+John+-+Scatman%5C%27s+World+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9af69ab09ec1454ae5ae755cf9f7676a56241264","infoHashBuffer":{"type":"Buffer","data":[154,246,154,176,158,193,69,74,229,174,117,92,249,247,103,106,86,36,18,100]},"announce":[],"urlList":[]}}