{"title":"The King James Version Defended - Dr. Edward F. Hills","uid":11773629,"size":10235836,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9b1f9b938417da76cf397b9e5fc58a80b077077e&amp;dn=The+King+James+Version+Defended+-+Dr.+Edward+F.+Hills&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"starxteel","files":2,"time":1427178909,"description":"The Bible in English has fallen on hard times. Not only do some feminists see it as a format from which to transform Ancient Near Eastern, patriarchal religions into modern, 20th century paradigms of egalitarianism, but the American Bible publishing industry has reduced it to a commodity, hoping to maximize gains by imposing a marketing-manufactured consensus on conservative evangelicals, calling it the beginning of a &quot;new tradition.&quot;\n\nEdward F. Hills in his work The King James Version Defended represents a sober and compelling argument for the &quot;old tradition.&quot; As a well-trained classicist and an internationally recognized New Testament text critic, he analyzes the problems of both modern language translations and current New Testament text criticism methodology. With the sometimes widespread and uncritical acceptance of such translations as the New International Version by pastors as well as laymen, this defense of the historic, English Protestant Bible should be read by all.\n\n\nAbout the author:\nEdward Freer Hills (1912-1981) was born and raised in Oak Park, Illinois. After graduating from high school he attended Yale University where he excelled in the Latin classics and was a Phi Beta Kappa graduating summa cum laude in 1938. From Yale he entered Westminster Seminary in Philadelphia where he studied under the famous J. Grescham Machen and other well known scholars.\n\nUnder the tutelage of Dr. N. B. Stonehouse, he was introduced to the new Greek New Testament of Westcott and Hort, Greek rival of the old Textus Receptus. Hills became exceedingly troubled concerning the significant differences between the two Greek texts. Had not God inspired His Word? Had not God promised to preserve it?&quot; How could this newly edited 19th century text displace the one used for centuries by the Church?\n\nIn this same class, however, he also learned that among scholars in England there had been one loud, dissenting voice to this newly praised text, John William Burgon, an Oxford scholar who had opposed Westcott and Hort in the revision committee. Unfamiliar with this name, Hills wondered, &quot;Who was this Burgon and what was his vociferous objection? He determined to study this issue himself.\n\nAfter he obtained the Th.B. Degree from Westminster, he studied at Columbia Seminary in Atlanta, Georgia where he earned the Th.M. From there he studied at the University of Chicago for two years and transferred to Harvard University where he earned his Th.D. in New Testament text criticism. His years of intense research have resulted in two significant books: The King James Version Defended and Believing Bible Study. Edward F. Hills has been called the Father of the 20th century renewal of the Textus Receptus.\n\nAs to the relationship of the King James Bible to the Received Text, Hills wrote &quot;the King James Version ought to be regarded not merely as a translation of the Textus Receptus but also as an independent variety of the Textus Receptus.&quot; Indeed, the perfect one","torrent":{"xt":"urn:btih:9b1f9b938417da76cf397b9e5fc58a80b077077e","amp;dn":"The+King+James+Version+Defended+-+Dr.+Edward+F.+Hills","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b1f9b938417da76cf397b9e5fc58a80b077077e","infoHashBuffer":{"type":"Buffer","data":[155,31,155,147,132,23,218,118,207,57,123,158,95,197,138,128,176,119,7,126]},"announce":[],"urlList":[]}}