{"title":"Richard Herring - Christ on a Bike DVDRip XviD-iTeM","uid":7413432,"size":600847500,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9b43ebccc673e259134627387c150c03287b529c&amp;dn=Richard+Herring+-+Christ+on+a+Bike+DVDRip+XviD-iTeM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Pongydog","files":1,"time":1341439781,"description":"Jesus Christ - Son of God! Saviour of mankind! Superstar! Richard Herring - Son of Keith! Impressive high score on Yahtzee. Star of a poker based chat show on a satellite channel which subsequently closed down! At first sight they have little in common. Or do they? Following up on his critically acclaimed show Hitler Moustache Herring now turns his attention to religion. 'Last year the show was about Hitler. This year it's about Jesus. I guess I am following the career path of Pope Benedict.' As a committed atheist why is Herring so obsessed with Christ? Is he scared he might be wrong to be so dismissive? Does he feel that Christ's true intentions and message have been subverted by his followers? Or does he secretly hope, in his heart that he might be Jesus, back at last, just like he promised, only about 2000 years later than planned? 'I'm not saying I'm Jesus... that is for other people to say.' Along the way he asks all the great theological questions: 'Why did Jesus always call Simon, Peter? Was it the same as the way Trigger always called Rodney Dave? What happened to Lazarus the second time he died? How many weeks would you have to attend Roman Catholic Holy Communion before you had consumed an entire Jesus?' Combining child-like guile with rigorous academic research, Herring attempts to discover the true historical Jesus, find out why he is all things to all men, discovers a mistake on the very first page of the New Testament and tries to ascertain if Jesus ever really did walk like a lady and wear a bra. It's a show that was picketed by aggrieved Christians in Glasgow and Lowestoft, even though they hadn't seen it - You'll remember Jesus famously said, 'Judge stuff you haven't seen' - but which is as critical of Richard's wishy-washy atheism as it is of those who have misinterpreted Christ's message. 'Jesus is cool... it's just the people who follow him who tend to be such idiots... He's like the Fonz in that respect.' It's funny and thought-provoking, blasphemous and reverential and it's a much better Christmas present than some Myrrh. ","torrent":{"xt":"urn:btih:9b43ebccc673e259134627387c150c03287b529c","amp;dn":"Richard+Herring+-+Christ+on+a+Bike+DVDRip+XviD-iTeM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b43ebccc673e259134627387c150c03287b529c","infoHashBuffer":{"type":"Buffer","data":[155,67,235,204,198,115,226,89,19,70,39,56,124,21,12,3,40,123,82,156]},"announce":[],"urlList":[]}}