{"title":"Der.grosse.Bellheim","uid":6639291,"size":3321097088,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9b92dbb086261240d369751a4495aabbb7aae8e6&amp;dn=Der.grosse.Bellheim&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bernd.stromberg","files":-1,"time":1314693576,"description":"Der groÃƒÅ¸e Bellheim Teil 1-4\n1992\n\n\nStaff :\n=======\n\nRegie - Dieter Wedel \nDrehbuch - Dieter Wedel \nProduktion - ZDF \nKamera - Edward Klosinski, JÃƒÂ¼rgen Hensel \nMusik - David Knopfler, Michael Landau \nFSK - \nLÃƒÂ¤nge - 105 + 110 + 120 + 120 Minuten \nAuszeichnung - 1994 Grimme-Preis/Gold \nErstauffÃƒÂ¼hrung - 1. Jan. 1993 \nGenre - 4teiliger TV-Film\n\n\nBesetzung :\n===========\n\nMario Adorf - Peter Bellheim \nHeinz Schubert - Dr. Erich Fink \nWill Quadflieg - Herbert Sachs \nHans Korte - Max Reuther (Tortenreuther) \nHeinz Hoenig - Karl-Heinz Rottmann \nKrystyna Janda - Maria Bellheim \nLeslie Malton - Gudrun Lange \nAlexander Radszun - Berger \nRenan Demirkan - Andrea Wegener \nManfred Zapatka - Richard Maiers \nAnnemarie DÃƒÂ¼ringer - Maiers\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\' Mutter \nIngrid Steeger - Mona Stengel \nDominique Horwitz - Charly \nErika Skrotzki - Carla \nWolfgang Wahl - Dr. Urban \nHans-JÃƒÂ¶rg Assmann - Dr. MÃƒÂ¼ller-Mendt \nEva Maria Bauer - Frau Fink \nFerdinand Dux - Bellheims Vater \nMichael Wittenborn - Ziegler \nHans HÃƒÂ¤ckermann - TeppichverkÃƒÂ¤ufer \nRenate Grosser - Mathilde, Abteilungsleiterin \nThomas Huber - Christian, VerkÃƒÂ¤ufer \nGiuseppe Pambieri - Streibel, Personalrat \nArnfried Lerche - Dr. DÃƒÂ¼rr \nUrsula Hinrichs - Emma, Bellheims HaushÃƒÂ¤lterin \nJÃƒÂ¼rgen Schornagel - Personalchef \nStefan Reck - Reporter \nBrigitte Karner - Bellheims Tochter \nDorothea Kaiser - Bellheims SekretÃƒÂ¤rin \nAnaid Iplicjian - Bellheims geschiedene Frau \nErich Hallhuber - GeschÃƒÂ¤ftsfÃƒÂ¼hrer von Rottmann in Hongkong \nHans-Peter Hallwachs \t\nMarcello Tusco - Konsul TÃƒÂ¶tter \nHans ZÃƒÂ¼rn - Vermieter \nFritz Lichtenhahn - Vorstand der Schweizer FÃƒÂ¼rli Bank \nHeinz W. KrÃƒÂ¼ckeberg - VerkÃƒÂ¤ufer bei Bellheim \nThomas Meinhardt - Assistent von Rottmann\n\n\nInhalt :\n========\n\nTeil 1:\nWÃƒÂ¤hrend eines glanzvollen Festes zu seinem 60. Geburtstag erfÃƒÂ¤hrt Peter Bellheim, dass sich die Lage seines Konzerns bedenklich verschlechtert hat. Bellheim, der sich drei Jahre zuvor aus dem aktiven GeschÃƒÂ¤ft in den Ruhestand nach Spanien zurÃƒÂ¼ckgezogen hatte, gewinnt der deprimierenden Nachricht jedoch eine positive Seite ab: Er wird wieder gebraucht. Er kehrt zu seiner Kaufhauskette mit 14 Filialen und 4.000 Angestellten zurÃƒÂ¼ck. Dort stellt er fest, dass die Lage desolat ist. Kunden werden schlecht bedient, die VerkÃƒÂ¤ufer klauen, das Management ist ÃƒÂ¼berfordert. Zur Rettung seines Unternehmens trommelt Bellheim ein Oldie-Trio zusammen: Aus Marbella holt er seinen lÃƒÂ¤ngst pensionierten Wirtschaftsberater, aus dem Ruhesitz in Nizza seinen ehemals schÃƒÂ¤rfsten Konkurrenten und als neuen Personalchef einen pensionierten Gewerkschafter. Diese betagte Viererbande kÃƒÂ¤mpft gemeinsam gegen den eigenen Vorstand, gegen Banken und gegen eine Supermarktkette, die von Bellheims skrupellosem Gegenspieler Rottmann geleitet wird. Was die vier nicht wissen ist, dass hinter ihrem RÃƒÂ¼cken rÃƒÂ¼cksichtslose Spekulanten eine Intrige anzetteln.\n    \nTeil 2:\nPeter Bellheim und seine Freunde mÃƒÂ¼ssen ihrer Hausbank ihr Sanierungskonzept fÃƒÂ¼r das Kaufhausunternehmen schmackhaft machen. Indem sie geschickt das GerÃƒÂ¼cht verbreiten, eine finanzstarke sÃƒÂ¼dkoreanische Gruppe wolle sich beteiligen, steigern sie den Bellheim-Aktienkurs. Bellheims Gegenspieler Rottmann aber, der skrupellose Chef einer Supermarktkette, schieÃƒÅ¸t quer: Er steckt befreundeten Journalisten Hintergrundinformationen zu, um Bellheim schlecht zu machen, und wirft gleichzeitig Tausende von Bellheim-Aktien auf den Markt. Der Kurs sackt in den Keller. Im Kaufhauskonzern herrscht Panik. Bellheim versucht verzweifelt herauszufinden, wer ihn ruinieren will. Im Kaufhaus geht es dank der Ideen und Verbindungen der vier Alten langsam aufwÃƒÂ¤rts, aber in Bellheims Villa, in der sie als eine Art Verteidigungs- und Wohngemeinschaft zusammenleben, prallen die Temperamente immer ÃƒÂ¶fter hart aufeinander.\n  \nTeil 3: \nIm Kaufhaus wird von bevorstehenden Entlassungen gemunkelt. Charly, ein VerkÃƒÂ¤ufer, der schon lange davon trÃƒÂ¤umt, sich selbststÃƒÂ¤ndig zu machen, riskiert den Sprung ins kalte Wasser. Zusammen mit der verschusselten, hilflosen Kollegin Mona mietet er einen kleinen Laden. Aber damit fangen die Schwierigkeiten erst richtig an. Bellheim und seine Freunde erringen nach einer offenen Konfrontation mit ihrem Gegner Rottmann vorerst einen wichtigen Teilerfolg. Der Aufsichtsrat ihres Unternehmens entscheidet sich fÃƒÂ¼r Bellheims Sanierungskonzept: Erweiterung statt Gesundschrumpfen. Doch Rottmann lÃƒÂ¤sst nicht locker. Er kauft heimlich ein groÃƒÅ¸es Bellheim-Aktienpaket, um die Macht in die Hand zu bekommen. Auch die Hausbank macht Bellheim Schwierigkeiten. Er geht aufs Ganze und verpfÃƒÂ¤ndet alles, was er besitzt. Privat hat sich Bellheim mit Andrea, einer jungen Dekorateurin, eingelassen. Nun trifft aus Spanien ÃƒÂ¼berraschend seine Frau Maria ein.\n  \nTeil 4:\nMaria Bellheim spÃƒÂ¼rt die VerÃƒÂ¤nderung im Verhalten ihres Mannes, fÃƒÂ¼hrt sie aber zunÃƒÂ¤chst auf die Belastung durch das Kaufhaus zurÃƒÂ¼ck. Bellheim selbst weiÃƒÅ¸ kaum noch, wo ihm der Kopf steht: Weil es bei der ErÃƒÂ¶ffnung der neuen Filiale in Braunschweig Probleme ÃƒÂ¼ber Probleme gibt, hat er kaum noch Zeit fÃƒÂ¼r die Dekorateurin Andrea. Alles scheint sich gegen ihn verschworen zu haben: Auf der Hauptversammlung beschuldigt ihn der neue GroÃƒÅ¸aktionÃƒÂ¤r Rottmann, mit seiner \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot;Altherrenriege\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot; die Firma zu ruinieren. Er kÃƒÂ¼ndigt den Verkauf aller seiner Aktien an. Der Kurs stÃƒÂ¼rzt ins Bodenlose. Die Bank kÃƒÂ¼ndigt alle Kredite. Als seine Frau Maria von Bellheims VerhÃƒÂ¤ltnis mit Andrea erfÃƒÂ¤hrt, reist sie nach Spanien zurÃƒÂ¼ck. Bellheim scheint am Ende. Ausgerechnet Rottmann bietet sich als Retter in der Not an. FÃƒÂ¼r wenig Geld will er Bellheim alles abkaufen. Bellheims listige Freunde finden allerdings mit Hilfe eines Einbruchs die Beweise dafÃƒÂ¼r, dass Rottmann bei seiner Intrige illegal vorgegangen ist. Zwischen Rottmann und Bellheim kommt es zur groÃƒÅ¸en Abrechnung.","torrent":{"xt":"urn:btih:9b92dbb086261240d369751a4495aabbb7aae8e6","amp;dn":"Der.grosse.Bellheim","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b92dbb086261240d369751a4495aabbb7aae8e6","infoHashBuffer":{"type":"Buffer","data":[155,146,219,176,134,38,18,64,211,105,117,26,68,149,170,187,183,170,232,230]},"announce":[],"urlList":[]}}