{"title":"The Sarah Jane Adventures - Season 05 (2011) - 06 Episodes - 1 S","uid":10818236,"size":1387408224,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9d0274c8e1d42d1d998cdf0d7ab1190783360742&amp;dn=The+Sarah+Jane+Adventures+-+Season+05+%282011%29+-+06+Episodes+-+1+S&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"bnaron","files":-1,"time":1408491038,"description":"The Sarah Jane Adventures - Season 04 (2010) - 12 Episodes\n\n\nSeries Description Courtesy Of:\n\nWikipedia, the free encyclopedia &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/The_Sarah_Jane_Adventures&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/The_Sarah_Jane_Adventures&lt;/a&gt;\n\n\nNOTE: Possible Episode Spoilers Below.  Do not read the synopses if it might ruin your viewing experience. You HAVE been warned!\n\n\nThe Sarah Jane Adventures is a British science fiction television program, produced by BBC Cymru Wales for CBBC, created by Russell T Davies and starred Elisabeth Sladen. The program is a spin-off of the long-running BBC science fiction program Doctor Who and focuses on the adventures of Sarah Jane Smith, a middle-aged investigative journalist who, in her youth, had numerous adventures across time and space. The series debuted on BBC One with a 60-minute special, &quot;Invasion of the Bane&quot;, on 1 January 2007, and broadcast through to 2011. It was nominated for a British Academy Children's Award in 2008 in the Drama category, and for a BAFTA Cymru in 2009 in the Children's Drama category. The program won a Royal Television Society 2010 award for Best Children's Drama\n\nFilming for the first three stories of series 5, two by Phil Ford and one by Gareth Roberts, was completed prior to Elisabeth Sladen's death. Production for the second half of the series, comprising three more two-part stories, was planned for spring 2011 but never commenced due to Sladen's illness. The filmed episodes of series 5 were broadcast in October 2011, with a short montage of key moments from all five seasons plus scenes from Sladen's time on Doctor Who added to the end of The Man Who Never Was to mark the end of the program. The three stories that never entered production were titled 'Meet Mr Smith' (by Gareth Roberts &amp; Clayton Hickman), 'The Thirteenth Floor' (by Phil Ford) and 'The Battle of Bannerman Road' (by Russell T Davies). 'The Thirteenth Floor' was rewritten as an episode of 'Wizards vs Aliens.'\n\n\nEpisode Synopses Courtesy Of:\n\nThe On-line TV Database\nAn Open Database for Television Fans\nwww.thetvdb.com\n\n\n2011-10-03 - Sky (1) (Video:H.264, 624x352, 988kbps, 25fps - Audio:AAC, 44.1kHz, 107kbps)\n\nSarah Jane discovers an abandoned baby girl on her doorstep and attempts to find out who left her there. At a local nuclear power station, a beautiful woman appears out of nowhere and uses alien powers to take control of the place.\n\n\n2011-10-04 - Sky (2) (Video:H.264, 624x352, 988kbps, 25fps - Audio:AAC, 44.1kHz, 106kbps)\n\nSky has undergone a transformation and in the process has triggered a countdown that nobody is able to stop. Sarah Jane and Sky end up being trapped between the alien war fought by Metal-kind and Flesh-kind. Clyde and Rani attempt to prevent the biggest bang the world has ever seen.\n\n\n2011-10-10 - The Curse of Clyde Langer (1) (Video:H.264, 624x352, 989kbps, 25fps - Audio:AAC, 44.1kHz, 104kbps)\n\nAfter some very unusual weather hits Bannerman Road, Sarah Jane investigates why. Fish are falling from the skies, and Sarah Jane's investigation ends up leading the team to the Museum of Culture. After Clyde acts the fool a little to much, his friends end up turning against him, and he is banished from their lives.\n\n\n2011-10-11 - The Curse of Clyde Langer (2) (Video:H.264, 624x352, 990kbps, 25fps - Audio:AAC, 44.1kHz, 106kbps)\n\nClyde finds himself abandoned on the streets of London, living rough with no food to eat. Somebody ends up reaching out to him, but as they become friends, he's warned about the legendary Night Dragon.\n\n\n2011-10-17 - The Man Who Never Was (1) (Video:H.264, 624x352, 983kbps, 25fps - Audio:AAC, 44.1kHz, 102kbps)\n\nEveryone wants the brand-new SerfBoard - and why not? What could be so dangerous about a computer?\n\n\n2011-10-18 - The Man Who Never Was (2) (Video:H.264, 624x352, 986kbps, 25fps - Audio:AAC, 44.1kHz, 105kbps)\n\nLuke and Sky must help the Skullions, but Sarah Jane is in danger too, so who will they save?\n\n\n2011 Specials\n\n\n2011-04-20 - Special - My Sarah Jane - A Tribute to Elisabeth Sladen (Video:H.264, 624x352, 988kbps, 25fps - Audio:AAC, 44.1kHz, 111kbps)\n\nA celebration of Doctor Who's greatest companion, played by actress Elisabeth Sladen.\n\n\n","torrent":{"xt":"urn:btih:9d0274c8e1d42d1d998cdf0d7ab1190783360742","amp;dn":"The+Sarah+Jane+Adventures+-+Season+05+%282011%29+-+06+Episodes+-+1+S","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d0274c8e1d42d1d998cdf0d7ab1190783360742","infoHashBuffer":{"type":"Buffer","data":[157,2,116,200,225,212,45,29,153,140,223,13,122,177,25,7,131,54,7,66]},"announce":[],"urlList":[]}}