{"title":"Stargate.Universe.S02E01.Swesub.HDTV.XviD -Lindoff-P0W4.avi","uid":5864633,"size":366995456,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:9df16cca7479284b8526dcb65094ebb2387b1aa6&amp;dn=Stargate.Universe.S02E01.Swesub.HDTV.XviD+-Lindoff-P0W4.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Lindoff41","files":1,"time":1286066095,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt1645556/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt1645556/&lt;/a&gt;\n\n\nSTARGATE UNIVERSE Season 2E1\n\nThe second live-action series to spin-off of the hit science fiction series Stargate SG-1 was green-lighted a day after the announcement that Stargate Atlantis will be canceled after its fifth season run. Stargate Universe premiered with a two-hour movie and then went immediately to its new timeslot.\n \nWith the help of teenager mathematics prodigy Eli Wallace (David Blue), Dr. Nicholas Rush (Robert Carlyle) discovers what he believes is the secret to intergalactic travel using the Stargate's heretofore unlocked ninth chevron. However, when the base where the Stargate is kept comes under attack, Rush insists on using the Stargate to evacuate, disregarding the orders of commanding officer Colonel Everett Young (Louis Ferreira). Lt. Matthew Scott (Brian J. Smith) is the first officer through the wormhole, leading the military and civilian survivors through before the base is destroyed.\n \nWhat awaits them on the other side is an unmanned automated starship named the Destiny, launched by the Ancients thousands of years ago at the height of their civilization as a portal to other galaxies.\n \nAmong the survivors is: Master Sergeant Tamara Johansen (Alaina Huffman), a field medic woefully underequipped to deal with the injuries they've suffered and the problems they encounter; Chloe Armstrong (Elyse Levesque), daughter and assistant to her dead father, Senator Armstrong; and Camille Wray, the IOA representative and human resources manager.\n\n\n\n\n21 :02x01 - Intervention \n\n\nScott and Greer are seemingly killed while on the hull of Destiny; Rush tries to undermine the ship's shields to force the Lucians to surrender; Chloe makes an amazing recovery; T.J. finds herself on an alien planet with her baby; and the Lucian forces disagree on how to maintain their hold on the ship.\n \n\nGuest Stars: Julie McNiven as Ginn, Mike Dopud as Varro, Caroline Cave as Dana, Peter Kelamis as Adam Brody, Tygh Runyan as Dr. Caine, Julia Anderson as 2nd Lt. Vanessa James (as Julia Benson), Patrick Gilmore as Dale Volker, Jennifer Spence as Lisa Park, Alisen Down as Dr. Brightman, Tobias Slezak as Peter, Haig Sutherland as Sgt. Hunter Riley, Robert Knepper as Simeon, Lou Diamond Phillips as Colonel David Telford, | Co-Guest Stars: Ian Butcher as Dannic, Rob Hayter (1) as Alliance Solider, Primo Allon as Koz, Ash Lee as Alliance Tech \nDirector: Andy Mikita\nWriter: Joseph Mallozzi, Paul Mullie \nSongs: Mumford and Sons -- After The Storm \n\n \nThe Destiny lacks the power necessary to create a super-wormhole back to Earth. Although they can program the ship to stop at Stargates that the Ancients sent ahead, the automated systems cause the ship to depart twelve hours upon arrival. If someone is left behind, there is no way to go back for them, adding to the drama of encountering new races, enemies, and adventures, and finding a way to bolster their dwindling supplies. Their only contact with Earth is through a series of Ancient communication stones, but only Dr. Rush knows how to use them... and he intends to use the opportunity to the fullest to explore alien planets and discover Ancient technology, no matter what the cost.\n \n","torrent":{"xt":"urn:btih:9df16cca7479284b8526dcb65094ebb2387b1aa6","amp;dn":"Stargate.Universe.S02E01.Swesub.HDTV.XviD+-Lindoff-P0W4.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9df16cca7479284b8526dcb65094ebb2387b1aa6","infoHashBuffer":{"type":"Buffer","data":[157,241,108,202,116,121,40,75,133,38,220,182,80,148,235,178,56,123,26,166]},"announce":[],"urlList":[]}}