{"title":"Janis Joplin - Pearl Legacy Edition(2005)Mp3[CR-Bt]","uid":4634554,"size":214568991,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9df4a3068069fae481d1882d0272607064e5fcb8&amp;dn=Janis+Joplin+-+Pearl+Legacy+Edition%282005%29Mp3%5BCR-Bt%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tathiana","files":29,"time":1231509868,"description":"Il disco ÃƒÂ¨ prodotto da Paul Rotchild, lo stesso produttore dei Doors. Si parte con &quot;Move Over&quot;, pezzo scritto dalla stessa Joplin: ÃƒÂ¨ un pezzo tiratissimo, acido, carico, subito cattura l'attenzione dell'ascoltatore!! Abbiamo iniziato alla grande! Tocca a &quot;Cry Baby&quot;, uno dei pezzi piÃƒÂ¹ famosi, dove le urla disperate della singer si contrappongono a una strofa molto soft, il finale mentre lei urla &quot;C'mon, c'mon&quot; ÃƒÂ¨ da brividi, un altro pezzo da 5 stelline!! Con &quot;A Woman Left Lonely&quot; (pezzo profeticamente autobiografico) siamo sullo stesso territorio del precendente brano: urla disperate che fanno venire la pelle d'oca e un'altra interpretazione alla grande da parte della singer... &quot;Half Moon&quot; ÃƒÂ¨ un ritorno a climi piÃƒÂ¹ calmi, ma non per questo ÃƒÂ¨ un pezzo da scartare, anzi!! &quot;Buried Alive With The Blues&quot; (letteralmente &quot;bruciata viva nel blues&quot;) ÃƒÂ¨ un pezzo strumentale molto interessante, la classica ciliegina sulla torta di questo bel disco; leggenda vuole che Janis dovesse registrare la parte vocale di questo pezzo ma non ci riuscÃƒÂ¬, proprio a causa della prematura scomparsa. Anche in My Baby ÃƒÂ¨ la voce a farla da padrona, anche se i musicisti nel disco sono davvero bravissimi. &quot;Me And BobbyMcGee&quot;, una ballata country scritta da Kris Kristofferson (un eclettico personaggio attore-cantante-songwriter che ebbe una breve relazione con lei), ÃƒÂ¨ anche qui un brano che fa guadagnare punti al disco e che ci porta al capolavoro del disco &quot;Mercedes Benz&quot;, brano per sola voce e mani, una preghiera, una perla di rara bellezza che fa della semplicitÃƒÂ  il suo punto forte. Anche qui ÃƒÂ¨ difficile non provare qualcosa quando si ascolta un brano del genere: un pezzo non da 5 ma da 6 stelline!! &quot;Trust Me&quot;, a differenza dei brani precendenti non ÃƒÂ¨ rabbiosa; qui la Joplin ÃƒÂ¨ dolce, tenera, amabile... brano da lacrime amare. Chiude il tutto &quot;Get It While You Can&quot;, epica, con la voce che trova in sÃƒÂ© il suo rilancio, la sua forza.\n\nUn bel disco blues dunque, se ÃƒÂ¨ vero che il blues ÃƒÂ¨ tristezza, sofferenza, malinconia allora Janis rappresenta al meglio tutto ciÃƒÂ². Poche donne meglio di lei hanno rappresentato la tristezza del blues. \n","torrent":{"xt":"urn:btih:9df4a3068069fae481d1882d0272607064e5fcb8","amp;dn":"Janis+Joplin+-+Pearl+Legacy+Edition%282005%29Mp3%5BCR-Bt%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9df4a3068069fae481d1882d0272607064e5fcb8","infoHashBuffer":{"type":"Buffer","data":[157,244,163,6,128,105,250,228,129,209,136,45,2,114,96,112,100,229,252,184]},"announce":[],"urlList":[]}}