{"title":"The Hills Have Eyes 2 Scary As Hell Edition","uid":3747516,"size":737729042,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9e7866d0c89400d29bfb5a8ea903ca8200c5a47d&amp;dn=The+Hills+Have+Eyes+2+Scary+As+Hell+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"3Raz0r","files":4,"time":1184930181,"description":"THE HILLS HAVE EYES - SCARY AS HELL EDITION\n\nThis is a fanedit. But you probably won&amp;#039;t realize it. :)\n\nA group of Rookie soldiers is sent to the well known desert hills area to help and guard some scientists, who are conducting secret experiments in an underground bunker facility there.\nBut when they get there, no one seems to be left. Then they get a distress call and go for a rescue mission. For most of them it is the last mission ever.\nThese hills are dangerous. These hills have eyes.\n\n\n\n\n\n\nThis is my first fanedit.\nIt is my take on the weak sequel to THE HILLS HAVE EYES.\n\nBy removing a few of the most annoying elements, this now comes far more in the spirit of a true horror movie.\n\nWhat was done?\n- The teaser was added to the beginning. It features that great song by Devendra Banhart &quot;Insect EYes&quot;. This was also the reason that made me think of fanediting this movie in the first place. The compelte version of Insect Eyes, along with some info and a little slide show can be enjoyed in the ending.\n\n- Shitman was removed. Shitman is a poor scientiest that was put into the latrine by the mutants, his body tortured with plenty of cuts, so he would die slowly from infection. Unfortunately this killing and the presentation of the entire scene made no sense in this movie. never were the mutants so smart or was it their style to torture someone like this. The scene itself is somewhat entertaining, has a few scares and a lot of disgust, because shitman is... well... full of slimy, stinking shit. To delete him I had to use various cutting techniques, including zooming and replacing scenes. Also every reference to his existence is gone. I am very proud of the result for this. He is not missed at all.\n\n- Colonel Redding is dead. Colonel Redding makes a great appearance when the rookies climb down the hill: With his skull smashed open and his one eye missing and bleeding liek hell, h e awaits the rookies and talks to them about the mutants and this guy for sure has a great knowldge about them. In fact, he knows everything. It is a miracle how he managed to stay alive, after he was hacked in his head and fell down 50+ feet from a rock, but however, he is there to fill the gaps of knowledge for our protagonists and then have a great exiting scene: he is asked how they will get down from the hill. He replies: &quot;That&amp;#039;s easy&quot;, moves to the edge, points a gun to his head and shoots himself. Just great. And for sure one of the most annoying scenes ever. Letting the Rookies find him dead and letting him stay dead was rather complicated and took again some heavy editing to accomplish. And it worked kind of well. I am quite happy with the result for this scene. Again I also removed any reference to his appearance in later on dialogues. This is real good for the movie.\n\nWhat was not done?\nI did not remove any of the mutant scenes, although some were a bit over the top, like the disgusting long tongue scene or that stupid glass-wearing-sniffling-his-way mutant. The mutants are cool as they are and the movie does not suffer too much from them. It&amp;#039;s a monster movie and these are your monsters.\n\nSo finally you get a true horor movie, which was very improved in my opinion, by aking out a few really annoying scenes and adding somne great atmosphere with &quot;Insect Eyes&quot;.\n\nEnjoy.\n\nMore about fanedits:\nwww.fanedit.org\n\nYou must own the original movie to legally watch this.\n\nWho am I?\nI am 3Raz0r, I like horror movies and I dig fanedits.\t\t","torrent":{"xt":"urn:btih:9e7866d0c89400d29bfb5a8ea903ca8200c5a47d","amp;dn":"The+Hills+Have+Eyes+2+Scary+As+Hell+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e7866d0c89400d29bfb5a8ea903ca8200c5a47d","infoHashBuffer":{"type":"Buffer","data":[158,120,102,208,200,148,0,210,155,251,90,142,169,3,202,130,0,197,164,125]},"announce":[],"urlList":[]}}