{"title":"Etta James - Blue Gardenia (2001) [Blues][mp3 320][h33t][schon55","uid":4933819,"size":162926954,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9e8587f5907cc6fcd7d18e972836804401593541&amp;dn=Etta+James+-+Blue+Gardenia+%282001%29+%5BBlues%5D%5Bmp3+320%5D%5Bh33t%5D%5Bschon55&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"schon55","files":20,"time":1244154929,"description":"Etta James - Blue Gardenia \nOriginal Release Date: August 21, 2001 \nAudio CD: August 21, 2001 \nLabel: RCA Victor \nBitrate: 320 kbps\n\nThe legendary blues singer indeed lives up to the silly clichÃƒÂ© about being able to sing the phone book and make it sound rich, meaningful, and soulful. Still, it's always exciting to hear her tackle materials she's missed before. Here she shifts gears impressively into the intimate jazz club mode, performing beautifully arranged takes on a wide variety of standards (from &quot;Come Rain or Come Shine&quot; to &quot;Cry Me a River&quot;) under the direction of producer John Snyder and arranger/pianist Cedar Walton. Those two gathered a handful of great jazz players and recorded the initial tracks without James, who had a touch of the flu. A few months later she had recovered and did the amazing vocal sessions which truly sound live and in synch with the music. Beginning with the redemptive theme of &quot;This Bitter Earth,&quot; each song allows her to explore both tenderness and guttural emotions, even a little irony on clever twists like &quot;He's Funny That Way.&quot; There are also perfectly placed spotlights for the featured musicians. &quot;This Bitter Earth&quot; and &quot;He's Funny That Way&quot; feature a thoughtful improvisation by Walton, while Duke Ellington's &quot;In My Solitude&quot; has a passionate interlude by tenor saxophonist Red Holloway. Most of the vocals are textured over a bed of simmering brass, adding to the old school big band flavor that creates the atmosphere for the project. It's certainly common for great artists to thank their parents for various influences, but James goes one step further on the title track, allowing her mom to sing the tune; mom is no match for her daughter, but it's still a unique touch that adds emotional dimension to an already emotionally rich affair. ~ Jonathan Widran - AMG\n\nIn the style of &quot;Time after Time&quot;, Etta James sings these Jazz standards with such feeling it is hard not to be moved or inspired by them. She refrains from going over the top and does not let any song become too bluesy, resulting in an accomplished Jazz CD.  Highlights are &quot;Don't let the sun catch you crying&quot; and &quot;My man&quot;, where raw emotion mixes with technical ability and a great voice to be breathtaking. It may not be traditional Etta, but it is a joy. ~ AllCDCover\n\nThis disc gives us a mature, world-weary Etta, who sings her heart out in this fabulous jazz album, mostly about the slings and arrows of love, obsession, and in &quot;He's Funny That Way&quot;, a recognition of one's own character failures. One of the main strengths of the CD is the choice of material, which consists of some of the best melodies and strongest lyrics ever written, and Etta wrings every ounce of soul out of them.  Outstanding are &quot;Love Letters&quot;, &quot;Cry Me a River&quot;, and the one that sticks with me long after the CD is over is &quot;My Man&quot;. \n\nThis is music that will be appreciated by those who have been through the mill and come out a little bruised; those unscathed by life and love might not appreciate this recording, which may be one of Etta's finest, in the same way. \nThe musicians are superb, and echo the vocals in feeling. Cedar Walton on piano, Ronnie Buttacavoli on trumpet, Josh Sklair on guitar, and Red Holloway on tenor sax are stellar, as well as Tony Dumas, bass / Ralph Pendland, drums / George Bohannon, trumpet, and on &quot;Love Letters&quot;, Rick Baptist, flugelhorn and Ron Powell on percussion.  The final track is sung by Etta's mother, Dorothy Leatherwood, and she'll bring a tear to your eye with her rendition of &quot;Blue Gardenia&quot;. \n\nRecorded between November of 2000 and March of 2001, the sound is terrific, and has a very intimate sound, as if one were front row and center in a small club.  The fold-out insert has a song list, recording info and liner notes: no lyrics, but one of the beauties of Etta's singing is her diction, and she makes every word understandable; there are no &quot;misheard lyrics&quot; on this CD. ~ Alejandra Vernon\n\nEtta James - Blue Gardenia Tracks:\n01  This Bitter Earth\n02  He's Funny That Way\n03  In My Solitude\n04  There Is No Greater Love\n05  Don't Let The Sun Catch You Cryin'\n06  Love Letters\n07  These Foolish Things\n08  Come Rain Or Come Shine\n09  Don't Worry 'bout Me\n10  Cry Me A River\n11  Don't Blame Me\n12  My Man\n13  Blue Gardenia\n","torrent":{"xt":"urn:btih:9e8587f5907cc6fcd7d18e972836804401593541","amp;dn":"Etta+James+-+Blue+Gardenia+%282001%29+%5BBlues%5D%5Bmp3+320%5D%5Bh33t%5D%5Bschon55","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e8587f5907cc6fcd7d18e972836804401593541","infoHashBuffer":{"type":"Buffer","data":[158,133,135,245,144,124,198,252,215,209,142,151,40,54,128,68,1,89,53,65]},"announce":[],"urlList":[]}}