{"title":"The Sims 2 - Ultimate Collection 2014 Multi 19 repack Mr DJ","uid":12081339,"size":7132363201,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:9f489c16866bcfe254330082a105578684f8cc2c&amp;dn=The+Sims+2+-+Ultimate+Collection+2014+Multi+19+repack+Mr+DJ&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rock840","files":10,"time":1435777486,"description":"LOSSLESS Repack by Mr DJ (Me)\nThe Sims 2 Ultimate Collection Multi 19\n\nRepack features:\n\nDo not cut/recoded ;\nGame Version: 1.17.0.66 ;\nPrecracked - install and play (no origin required) ;\nFinal size: 13.7gb ;\nInstall time : 10 minutes ;\nWorking Operating system: Win XP,Win Vista,Win 7,Win 8,Win 8.1 (both 32bit and 64bit);\n\nLanguages present : \nEnglish, French, Italian, Spanish, Polish, Czech, Hungarian, Dutch, Danish, Portuguese, Portuguese (Brazil), Finnish, Norwegian, Swedish, Korean, Japanese, Chinese (Traditional), Chinese (Simplified), Thai \nRead 'Language change.txt' textfile provided to change the language ...\n\nContent included:\nMansion and Garden Stuff, Apartment Life, Kitchen and Bath Interior Design Stuff, Free Time, Teen Style Stuff, Bon Voyage, H&amp;M Stuff, Celebration Stuff, Seasons, Happy Holiday Stuff, Pets, Glamour Life Stuff, Family Fun Stuff, Open for Business, Holiday Party Pack Stuff, Nightlife, University.\n\n**INSTALL INSTRUCTIONS:\n\nBefore running setup of this repack, make sure u have uninstalled your every Sims 2 game including their registry entries , if any on your system, make sure there is no 'EA Games' folder in your 'Documents'('My Documents' for xp users) folder after uninstalling your previous Sims 2 game as 'EA Games' contains 'The Sims 2' folder consisting of cache and mods of your previous game which could lead to crashing of the game....This folder will be regenerated for this repack after 1st time u run the game.......\n\nDISABLE YOUR ANTIVIRUS BEFORE RUNNING 'Setup.exe' (IMPORTANT) , same for uninstall.....(For avast users: Disable DeepScreen in antivirus settings)...\n\nAfter running setup,, click on 'Configure',, specify the install directory,, click on next and next,, select the necessary software (Direct X [provided in Redist folder]),, again next,, finally on 'Install'...PLAY THE GAME FROM DESKTOP SHORTCUT using run as administrator.... \n\nFor the first time when you open the game, the game will take some time in starting(black screen) and in skipping the intro video, please be patient, next time it'll launch normally and quick....\n\nThe game will always show 'Mansion and Garden Stuff' loading screen as it is the latest expansion, everything is included in it......\n\nFirst time you load each world, loading takes time, please be patient, It's like running 10 games at once(don't assume it has frozen) just wait &amp; let it load.....\nAlways open the game using 'Run as administrator' to avoid crash/savegame issue. If it still crashes, lower the graphics settings from options ingame and make sure you meet the system requirements.\n\nNOTE: Change 'Shadows' from high to either low or medium through the ingame Graphics/Performance options , otherwise a black square will appear underneath your Sims instead of indoor shadows...\n\nIf in case you can't change the resolution of the game from 800x600 or some another, read 'Resolution change.txt' textfile provided to fix it...\n\nIf you are still unable to get it working, feel free to drop a private message on mypage.\n\nIF YOU LIKE THE REPACK,, GIVE FEEDBACK AND SEED.......\n\nLIKE THE GAME,, BUY IT AND SUPPORT THE DEVELOPERS.......\n\nCheck out my Officialpage for any help :\nMr DJ repacks\nLike it guys to support and get updates on upcoming repacks, gaming tips and requests","torrent":{"xt":"urn:btih:9f489c16866bcfe254330082a105578684f8cc2c","amp;dn":"The+Sims+2+-+Ultimate+Collection+2014+Multi+19+repack+Mr+DJ","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f489c16866bcfe254330082a105578684f8cc2c","infoHashBuffer":{"type":"Buffer","data":[159,72,156,22,134,107,207,226,84,51,0,130,161,5,87,134,132,248,204,44]},"announce":[],"urlList":[]}}