{"title":"The Nazi Persecution of the Gypsies","uid":11708091,"size":2240051,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9ff2c5685a8d1be2f79005c08d89ac54040a3cee&amp;dn=The+Nazi+Persecution+of+the+Gypsies&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1424219987,"description":"Roaming the countryside in caravans, earning their living as musicians, peddlers, and fortune-tellers, the Gypsies and their elusive way of life represented an affront to Nazi ideas of social order, hard work, and racial purity. They were branded as &quot;asocials,&quot; harassed, and eventually herded into concentration camps where many thousands were killed. But until now the story of their persecution has either been overlooked or distorted.\nIn The Nazi Persecution of the Gypsies, Guenter Lewy draws upon thousands of documents--many never before used--from German and Austrian archives to provide the most comprehensive and accurate study available of the fate of the Gypsies under the Nazi regime. Lewy traces the escalating vilification of the Gypsies as the Nazis instigated a widespread crackdown on the &quot;work-shy&quot; and &quot;itinerants.&quot; But he shows that Nazi policy towards Gypsies was confused and changeable. At first, local officials persecuted gypsies, and those who behaved in gypsy-like fashion, for allegedly anti-social tendencies. Later, with the rise of race obsession, Gypsies were seen as a threat to German racial purity, though Himmler himself wavered, trying to save those he considered &quot;pure Gypsies&quot; descended from Aryan roots in India. Indeed, Lewy contradicts much existing scholarship in showing that, however much the Gypsies were persecuted, there was no general program of extermination analogous to the &quot;final solution&quot; for the Jews.\nExploring in heart-rending detail the fates of individual Gypsies and their families, The Nazi Persecution of the Gypsies makes an important addition to our understanding both of the history of this mysterious people and of all facets of the Nazi terror","torrent":{"xt":"urn:btih:9ff2c5685a8d1be2f79005c08d89ac54040a3cee","amp;dn":"The+Nazi+Persecution+of+the+Gypsies","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ff2c5685a8d1be2f79005c08d89ac54040a3cee","infoHashBuffer":{"type":"Buffer","data":[159,242,197,104,90,141,27,226,247,144,5,192,141,137,172,84,4,10,60,238]},"announce":[],"urlList":[]}}