{"title":"Starship Titanic (GOG)","uid":12492218,"size":905190385,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a01581b925b8e726cd0af29333f8d2c6ce966d59&amp;dn=Starship+Titanic+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mercs215","files":3,"time":1443195562,"description":"Install instructions:\r\n1. Run &quot;setup_starship_titanic_2.0.0.4&quot;\r\n2. Play\r\nPLEASE REMEMBER TO SEED, MANY OTHERS WANT THIS GAME! :)\r\nIf you like this game, support the developers and BUY IT!\r\n\r\nTitle: STARSHIP TITANIC\r\nGenre: Adventure - Point-and-click - Sci-fi\r\nWorks on: Windows (XP, Vista, 7, 8, 10)\r\nLanguages: Audio and text: Deutsch, English\r\nModes: Single-player\r\nReleased: April 2, 1998\r\nSize: 0.8 GB\r\nCompany: The Digital Village / Completely Unexpected Productions\r\nRating:\tESRB Rating: Teen (with Comic Mischief, Use of Alcohol and Tobacco)\r\nStore page: https://www.gog.com/game/starship_titanic\r\n\r\nAbout:\r\nA classic adventure game from Douglas Adams, creator of the Hitchhiker's Guide to the Galaxy.\r\nAt the heart of our Galaxy, an advanced civilization of which we know nothing has built the biggest, most beautiful starship ever, the Starship Titanic.\r\nMajestic and luxurious, its interior resembles a mixture of the Ritz, the Chrysler building, Tutankhamen's tomb and Venice. Starship Titanic is a technological marvel. And it cannot possibly go wrong.\r\nIn theory.\r\nSeconds into its maiden voyage it crashes into hyperspace, vanishes...\r\n… and collides with your house.\r\nBewildered, you find your way aboard, and just as you are gazing at its awe-inspiring interior, the ship takes off again and heads deep into space. You are stranded. But you are not alone...\r\nThe ship is inhabited by a crew of malfunctioning robots and a semi-deranged parrot. You discover that you can communicate with them, a feat that is made possible by SpookiTalk, the game's proprietary interactive language engine. You can chat with any of the robot characters, like Fentible the distinguished Doorbot, Nobby the hypochondriac Liftbot, or Fortillian Bantoburn O' Perfluous the outrageously convivial Barbot. Talk to them. Interrogate them. Give them orders. They will listen to you, answer you and, if they happen to feel like it, obey you. Sometimes.\r\nTo begin with, you are a third class passenger, and you quickly find yourself in the grip of one of the most powerful forces known to modern man, the desire for a free upgrade. As you move up to second and at last to first class, more and more of the ship becomes accessible to you, and more and more of its mystery unravels. What has happened here? What terrible events occurred the night before the launch? Who is the mysterious Titania whose brooding statues dominate the ship? Can you solve a series of increasingly bizarre and surreal puzzles, unlock the central mystery and return to Earth before the parrot drives you finally and irrevocably mad?\r\nAll original interactive characters and game design by Douglas Adams\r\nStunning cinematic interiors from the Oscar®-winning design team of Oscar Chichoni and Isabel Molina.\r\nSpookiTalk – at the time, a cutting-edge, natural language text parser, enabling complex and entertaining conversations between the player and the game's characters.\r\n\r\nMinimum system requirements - Windows: Windows XP / Vista / 7 / 8 / 10\r\n1.8 GHz Processor\r\n512MB RAM (1 GB recommended)\r\n3D graphics card compatible with DirectX 7 (compatible with DirectX 9 recommended)\r\n2GB HDD\r\nMouse, Keyboard","torrent":{"xt":"urn:btih:a01581b925b8e726cd0af29333f8d2c6ce966d59","amp;dn":"Starship+Titanic+%28GOG%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a01581b925b8e726cd0af29333f8d2c6ce966d59","infoHashBuffer":{"type":"Buffer","data":[160,21,129,185,37,184,231,38,205,10,242,147,51,248,210,198,206,150,109,89]},"announce":[],"urlList":[]}}