{"title":"Ransom 1996 1080p H264 mp4 2Gb","uid":9603259,"size":2182761527,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:a05e1ea6cd48c58c6f5b2df396b60b15ceda9b72&amp;dn=Ransom+1996+1080p+H264+mp4+2Gb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"audiomaximus","files":1,"time":1392162213,"description":"Ron Howard directed this thriller which stars Mel Gibson as Tom Mullen, a former fighter pilot who built a ramshackle one-plane airline into a major multinational service fleet. Mullen has a multi-million dollar fortune, a beautiful wife, Kate (Rene Russo) and a nine-year-old son, Sean (Brawley Nolte) that he dotes on. However, Mullen's life comes crashing down around him when Sean is kidnapped. The FBI are called in, but Mullen is wary -- he was the recent target of an FBI investigation in which he was found to have bribed union officials while negotiating a contract. FBI Agent Hawkins (Delroy Lindo) advises Mullen to make the $2 million dollar drop to pay the kidnappers, which will make it easier to track the criminals, but when the tradeoff goes wrong, Mullen takes a new tactic -- he goes on television and offers a $2 million bounty for the heads of the people who kidnapped his child. Meanwhile, it becomes clear the kidnappers include Maris Connor (Lili Taylor), who once worked for the Mullens, and Jimmy Shaker (Gary Sinise), one of the cops who investigated Mullen for bribery. \n\nI downloaded an 11 gig version and reduced it to 2 gig for easier sharing.  Enjoy and help seed !\n\nVideo\n\n1920 x 1036   2300kbps  24fps  H.264  mp4  runtime  2:01:27\n\n\nAudio\n\nMP3 Lame  128kbps  48khz   stereo mixdown dolby pro logic II (5.1)","torrent":{"xt":"urn:btih:a05e1ea6cd48c58c6f5b2df396b60b15ceda9b72","amp;dn":"Ransom+1996+1080p+H264+mp4+2Gb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a05e1ea6cd48c58c6f5b2df396b60b15ceda9b72","infoHashBuffer":{"type":"Buffer","data":[160,94,30,166,205,72,197,140,111,91,45,243,150,182,11,21,206,218,155,114]},"announce":[],"urlList":[]}}