{"title":"Together Through Life - Bob Dylan","uid":4877750,"size":58569681,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a06d8f587c1db4d518bd2fc41ed2b7e9d4cdd26f&amp;dn=Together+Through+Life+-+Bob+Dylan&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TheLabMan","files":14,"time":1241215434,"description":"Together Though Life, produced by Jack Frost, was prompted by the composition of a new song, &quot;Life Is Hard,&quot; which was written for a forthcoming film by French director Oliver Dahan (La Vie En Rose). Bob Dylan's latest studio album was recorded late last year and features 10 new songs including &quot;Beyond Here Lies Nothin'&quot; and &quot;It's All Good.&quot; This will be the 46th release from Dylan, following his Platinum album Modern Times which debuted at #1 on the Billboard Top 200 chart in 2006.\n\n========================================================================\n\nSixty-eight years and 33 albums in and Bob Dylan seems bigger than ever.\nDylan's 33rd studio album comes packaged with a CD of tracks from his delightful radio show, &quot;Theme Time Radio Hour&quot; -- an appropriate union given that his latest has a similar old-time feel and would fit in perfectly the next time he turns DJ.\nThe CD has reignited interest in Dylan as a relevant artist of our times, as opposed to a legendary antiquity.\n&quot;Together Through Life&quot; is characterised by a loose swing and prominent accordion. He has assemble here his warmest, most unforced, set of songs in recent memory.\nThe album is a beautifully played collection of antique, urban blues pop.The ghosts of the great Chicago bluesmen haunt these song structures.\nThe results have been compared to the vintage Chicago blues sound of Chess Records.\nA warm, wheezy accordion (played by David Hidalgo of Los Lobos) lends a borderline Tex Mex flavour.\nAt least half of the songs are wry, even slightly comic tales of ordinary American lives of desire, heartbreak and remorse.\nFor sure,the lyrics, co-written with poet Robert Hunter, a &quot;non-performing&quot; member of The Grateful Dead, won't intrigue the academics but the head-nodding grooves of &quot;It's All Good&quot; and &quot;If You Ever Go to Houston&quot; will appeal to more basic instincts.\nThe single song, &quot;Life is Hard&quot;, written and recorded for Olivier Dahan's forthcoming film, &quot;My Own Love Song&quot; (it's about a road trip to Memphis undertaken by a wheelchair-bound singer and her best buddy) &quot;proves an incongruent trigger for such a bluesy album, its lap steel and mandolin carrying one of Dylan's most uncomfortably pitched croons&quot;. -Independent\n&quot;There is nothing as epic or as playful as &quot;Highlands&quot; or as plaintive as &quot;Nettie Moore&quot;, nothing with the weight or depth of those late Dylan songs that possess the resonance of the great blues and folk ballads he loves. By the end, you may feel that you are listening more to that strange whispery croak of a voice than to the words themselves&quot;. - Sean O'Hagan\nDylan sounds gruffer and less nasal than on his last one, Modern Times, approaching Tom Waits territory on &quot;My Wife's Home Town&quot;.\nYet the album shocases Bob Dylan in fairly relaxed, spontaneous mood, content to grab such grooves and sentiments as flit momentarily across his radar. So while it may not contain too many landmark tracks, it's one of the most naturally enjoyable albums we may hear all year.\nAlbum's highlights: &quot;Beyond Here Lies Nothin'&quot;, &quot;It's All Good&quot;, &quot;I Feel a Change Comin' On&quot;, &quot;Forgetful Heart&quot;, &quot;My Wife's Home Town&quot;","torrent":{"xt":"urn:btih:a06d8f587c1db4d518bd2fc41ed2b7e9d4cdd26f","amp;dn":"Together+Through+Life+-+Bob+Dylan","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a06d8f587c1db4d518bd2fc41ed2b7e9d4cdd26f","infoHashBuffer":{"type":"Buffer","data":[160,109,143,88,124,29,180,213,24,189,47,196,30,210,183,233,212,205,210,111]},"announce":[],"urlList":[]}}