{"title":"Paul McCartney - Chaos and Creation in the Backyard (FLAC)","uid":4829115,"size":315157479,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a0bd6a62b875148aa75360adcb5e56cdf0e23e66&amp;dn=Paul+McCartney+-+Chaos+and+Creation+in+the+Backyard+%28FLAC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"VinYl_RiPPa","files":13,"time":1239061447,"description":"The premise of Paul McCartney working with Nigel Godrich was clear from the start. McCartney wanted a producer who appreciated his storied past but at the same time believed that, at sixty-three, he has a vital future. For his part, Godrich -- who is best-known for his work with Radiohead and Beck -- had expressed interest in collaborating with an established artist whose reputation extended further back than the Nineties. A win-win, right? \nRight. Chaos and Creation in the Backyard is the freshest-sounding McCartney album in years. It is as spare, in its way, as Driving Rain (2001), his most recent studio effort, but it's more daring, more assured and more surprising. For starters, Driving Rain was a band album, while this is a genuine solo album in that McCartney plays nearly all the instruments on it -- four of the album's thirteen tracks credit no other musicians. It's an approach that recalls McCartney, the homemade 1970 release that launched the singer's post-Beatles career. And as on that record, the tingling sense of a new beginning is palpable. \n\nThough it's clearly the product of a true partnership between the artist and his producer, Chaos is instantly recognizable as a McCartney album. For one thing, that voice is front and center, as wistful and full of yearning as ever, effortlessly lending these songs a rich sense of emotional conviction. And that grounding frees Godrich to roughen up McCartney's innate melodic smoothness. &quot;Jenny Wren&quot; is an acoustic ballad in the manner of &quot;Mother Nature's Son.&quot; But a solo on duduk -- a haunting, hollow-sounding Armenian woodwind -- transports the song into an unsettled, dreamlike realm and darkens its mood. Similarly, the string arrangements that permeate the album rigorously avoid the romantic lushness typical of McCartney in the past. Instead, they slither in and out of the mix, providing eerie atmospherics to songs like &quot;Riding to Vanity Fair.&quot; Instruments such as melodica, harmonium, harpsichord and spinet introduce distinctly non-rock elements into McCartney's sound and contribute to an overall feel of delicate, stately surrealism. \n\nAll of the above means, alas, that, with a couple of exceptions, Chaos doesn't rock -- its most significant drawback. (When McCartney tears off a guitar solo on &quot;Promise to You Girl,&quot; the effect is jolting.) But without feeling showy, Chaos seduces the listener into a playful world of musical ideas that shimmer and disappear. The sound bears a complex relationship to the album's theme, an autumnal assessment of the things that fade and the things that last. What fades are the enervating distractions of daily life, every ego-charged detail that seems critical at the moment but that causes us to lose &quot;sight of life day by day.&quot;\n\nAnd, for McCartney, of course, what lasts is love -- the engine of the creation mentioned in the title, the ultimate weapon against chaos. This is not the silly love of &quot;Silly Love Songs.&quot; It's the challenge of one of his most famous lyrics: &quot;And in the end, the love you take/Is equal to the love you make.&quot; It's a call to a better self, in other words, and a promise that, as he sings in &quot;Anyway,&quot; this album's closing track, &quot;If a love is strong enough, it may never end.&quot;","torrent":{"xt":"urn:btih:a0bd6a62b875148aa75360adcb5e56cdf0e23e66","amp;dn":"Paul+McCartney+-+Chaos+and+Creation+in+the+Backyard+%28FLAC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a0bd6a62b875148aa75360adcb5e56cdf0e23e66","infoHashBuffer":{"type":"Buffer","data":[160,189,106,98,184,117,20,138,167,83,96,173,203,94,86,205,240,226,62,102]},"announce":[],"urlList":[]}}