{"title":"Totality - Eclipses of the Sun (Malestrom)","uid":4771253,"size":13183253,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a295bbcbf7918ded2498e4b34e5f3875a4592589&amp;dn=Totality+-+Eclipses+of+the+Sun+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"malestrom_HH","files":1,"time":1237049544,"description":" &lt;a href=&quot;http://www.image-upload.net/images/lnrwrr3lgkbfk6p7gvx9.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.image-upload.net/images/lnrwrr3lgkbfk6p7gvx9.jpeg&lt;/a&gt;\n\nMark Littmann, Fred Espenak, Ken Willcox, &quot;Totality: Eclipses of the Sun&quot;\nOxford University Press, USA | 2008-09-22 | ISBN: 0199532095 | 374 pages | PDF \n\nA total eclipse of the Sun is the most awesome sight in the heavens. Totality takes you to eclipses of the past, present, and future, and lets you see--and feel--why people travel to the ends of the Earth to observe them.\nAn absolutely indispensable resource for anyone who plans to observe an eclipse, and a must read for all astronomy buffs, this superb new edition brims with the anecdotes, experiences, and advice of many veteran eclipse observers. Indeed, it is the best guide and reference book on solar eclipses ever written, packed with information on how to observe them; how to photograph and videotape them; why they occur; their history and mythology; how eclipses revealed the workings of the Sun and made Einstein famous; and when and where to see future eclipses. Totality once again features the spectacular photography of Fred Espenak, who runs the NASA Eclipse Home Page and is the best-known and respected of all eclipse calculators and information sources. His many stunning color photographs illuminate this unparalleled exploration of eclipses. The volume has been updated to include current information on upcoming eclipses, with new chapters on the total eclipses due in 2008, 2009, 2010, and 2017, plus all new chapters on how to photograph, video record, and process your eclipse images, with emphasis on the new generation of digital cameras.\nStrikingly illustrated with stunning photographs and more than a hundred maps and diagrams, here is everything you need to know about eclipses of the sun, in an accurate, clearly written, and entertaining volume that can be read by lay people and astronomers with ease and enjoyment. ","torrent":{"xt":"urn:btih:a295bbcbf7918ded2498e4b34e5f3875a4592589","amp;dn":"Totality+-+Eclipses+of+the+Sun+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a295bbcbf7918ded2498e4b34e5f3875a4592589","infoHashBuffer":{"type":"Buffer","data":[162,149,187,203,247,145,141,237,36,152,228,179,78,95,56,117,164,89,37,137]},"announce":[],"urlList":[]}}