{"title":"Blind Ravage - Blind Ravage (1971/2007) [FLAC]","uid":9066679,"size":291086197,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a2e5cf667f13cac090ac45d91ce59298aff12ed9&amp;dn=Blind+Ravage+-+Blind+Ravage+%281971%2F2007%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":7,"time":1382121379,"description":"Blind Ravage - Blind Ravage (1971/2007)\n\nGenre: Canada, Classic Rock, Psychedelic Garage Rock\n\nTracks\n\n1. Susie-Q (Hawkins-Lewis-Broadwater) - 2:45\n2. Tousaw (B. Dufour-J. Charbonneau) - 3:43\n3. Friday Fish (B. Dufour-J. Charbonneau) - 4:13\n4. Prodigal (B. Dufour-J. Charbonneau) - 3:42\n5. My Life (Andre Deguire) - 3:52\n6. Strange Power (S. Fleury) - 6:13\n7. Cement Jungle (B. Dufour-J. Charbonneau) - 3:44\n8. Ruins (B. Dufour-J. Charbonneau) - 4:02\n9. Disaster (B. Dufour-J. Charbonneau) - 2:28\n10.Loser (Robert Dufour) - 2:39,\n\nPersonel:\n*Jean Charbonneau - Guitar, Piano\n*Andre Deguire - Drums\n*Serge Fleury - Organ\n*Robert Dufour - Bass\n\nBlind Ravage was formed in September 1969 in Laval, a suburb of Montreal, Quebec. Jean (John) Charbonneau (guitar, vocals) and Bob Dufour (bass, lead vocals) had been working together along with drummer Danny Gorman doing gigs in various night clubs in and around Montreal They met with Andre Deguire (drummer, vocals) at one of those night clubs where he was backing up shows and singers.\n\nOn account of Danny's departure, John and Bob asked Andre to join them. Andre had been gigging once in a while with Serge Fleury (organ, piano, vocals) who was doing R&amp;B at the time and who knew Bob well, having played with him in the early sixties with a group called the Furys. That band had stormed Montreal's dance halls with Beatles and Stones material for many years. Serge was asked to join the group and this is how Blind Ravage all started.\n\nThe guys did night clubs mostly in Montreal doing covers of Rod Stewart, Deep Purple, Spencer Davis, Led Zeppelin and other rock bands that highly influenced them when they decided to write their own material. So, they went on and produced an album on the Crescent Street label along with producer Ken Ayoub. Ayoub had produced earlier records with Bob and Serge at the time of the Furys. The album was released in 1971 and the single Loser b/w My Life was taken from that album.\n\nThe band played various concerts in Quebec, Ontario and in the northeastern states such as New York, Maine, Vermont and New Hampshire before dismantling in 1973. Bob, Andre and Serge came up with a progressive rock project Genesis type called Clockwork that became very popular especially in Quebec. They also came up with a single called Cybernaut b/w Mean Lady that was very YES oriented. They went on until late 1975. Later, Bob and John formed a country rock band called Mirage that lasted a couple of years.\n","torrent":{"xt":"urn:btih:a2e5cf667f13cac090ac45d91ce59298aff12ed9","amp;dn":"Blind+Ravage+-+Blind+Ravage+%281971%2F2007%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a2e5cf667f13cac090ac45d91ce59298aff12ed9","infoHashBuffer":{"type":"Buffer","data":[162,229,207,102,127,19,202,192,144,172,69,217,28,229,146,152,175,241,46,217]},"announce":[],"urlList":[]}}