{"title":"Willem de Kooning (Abrams Art Ebook).pdf","uid":13233847,"size":29822819,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a4be14224df6703bab382b3e91d3adb08ef75b83&amp;dn=Willem+de+Kooning+%28Abrams+Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STBGD","files":1,"time":1452982239,"description":"Willem de Kooning\r\nHarry N. Abrams | 1988 | ISBN: 0810911345 | English | 168 pages | PDF | 28.5 MB\r\n\r\nThe art of Willem de Kooning, one of the most important artists of the post-World War II era, comprises an extraordinary body of paintings, drawings, and sculpture that spans more than sixty years of continuing innovation and investigation. In this full-scale new volume on the artist, de Kooning's life and career are traced from his humble origins in Rotterdam, where he was born in 1904, to his triumphant rise as one of the major figures in American art.Diane Waldman, deputy Director of the Solomon R. Guggenheim Museum, New York, offers a thoughtful essay on the artist's career and a well-considered selection of his most important work, through which the reader can trace the artist's stylistic evolution from his first figurative paintings of the 1920s to his famous black-and-white paintings of the late 1940s and his notorious Woman series of the 1950s. The Women of the 1950s are discussed in depth, as are his later abstract landscapes, his move to the Springs, East Hampton, in 1963, the development of an important body of sculpture in the 1970s, and his triumphant late paintings of the 1970s and 1980s. Waldman curated the important &quot;De Kooning in East Hampton&quot; exhibition at the Guggenheim Museum in 1978. &quot;Willem de Kooning&quot; joins a distinguished list of books in Abrams' acclaimed Library of American Art, which is published in cooperation with the National Museum of American Art of the Smithsonian Institution","torrent":{"xt":"urn:btih:a4be14224df6703bab382b3e91d3adb08ef75b83","amp;dn":"Willem+de+Kooning+%28Abrams+Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4be14224df6703bab382b3e91d3adb08ef75b83","infoHashBuffer":{"type":"Buffer","data":[164,190,20,34,77,246,112,59,171,56,43,62,145,211,173,176,142,247,91,131]},"announce":[],"urlList":[]}}