{"title":"Paranoia Agent.Serie completa[13Caps][sahae][DVDrip]","uid":4755894,"size":2375596032,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:a558b760cdd0871dc6970ea93d3cd2df76de16d6&amp;dn=Paranoia+Agent.Serie+completa%5B13Caps%5D%5Bsahae%5D%5BDVDrip%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sahae","files":13,"time":1236452974,"description":"Nombre: Paranoia Agent\nNÃ‚Âº de tankoubon: No tiene Manga, por el momento\nGenero: Drama, Horror, Misterio, Psicologico, Supernatural,\nEstudio-Autor: Geneon - Satoshi Kon\nDatos: Han ocurrido una serie de atentados a distintas personas en Tokyo. Cada descripcion del agresor ha sido la misma: un joven con un aurico bate de beisbol y un par de patines de oro. Los dos detectives asignados para este caso no han podido encontrar una coneccion entre las victimas. Mientras mas a fondo investigan, mas extrano y peligroso se pone el caso. Atraparan a &quot;El Chico del Bate'' (Lil' Slugger) antes que mate a alguien mas? Quien sera la siguiente victima?\n\nReview: La historia creada por Satoshi Kon ( Director de Perfect Blue) y Seishi Minakami es la mas rara que ha salido en Japon por un largo tiempo.\nReparto: El reparto Japones es fantastico. Todos los de Toshihiko Seki: como el Detective Mitsuhiro hasta Mamiko Noto y Tsukiko que hacen un exelente rol.\nContenido: Se ven algo de desnudos, calzones, y escenas de sexo. Confien en mi cuando les digo que no es para nada erotica\nConclusion: Una vez mas Kon nos trae una Obra Maestra en Anime con ''Paranoia Agent''. Este es un anime hecho por adultos para adultos, no hay robots, ni aliens, ni comandos ninjas del infierno. Los unicos demonios que encontraras son los que viven dentro de todos.''Paranoia Agent'' no esta centrado en un solo personaje, por lo menos en los 3 primeros episodios. Cada episodio muestra un personaje distinto afectado por el misterioso agresor. Cuando el ''Chico del Bate'' ( Lil' Slugger) ataca a su primera victima, la descripcion de la victima encaja con la del personaje del segundo episodio. Sus ataques atraen la atencion de su tutora, quien esta teniendo problemas con ella misma como ves en el tercer episodio.\nEste es un anime que casualmente no puedes predecir lo que va a pasar. Como cualquier otra pelicula de misterio, hay pistas y mensajes indirectos a lo que pueda ocurrir. Pestaneas una vez y te puedes perder una pista vital. En esta serie tendras que usar mucho el cerebro. Si no te sientes un poco paranoico por el final de cada episodio, no le estas poniendo la suficiente atencion a ''Paranoia Agent''.\nEl reparto es genial, una coleccion de exelentes actores de voz, es lo que le da a la serie una atmosfera intensa. Kotono Mitsuishi ( Excel de ''Excel Saga'') es la mas impresionante. Ella no hace solo de un personaje, sino de dos, Harumi y Maria. Harumi es muy callada, timida, y dulce. Pero cuando es Maria, se vuelve grosera, vulgar, con voz aspera, ninfomana, y con un temperamento malvado. El hecho de que las dos voces esten tan alejadas a lo que era Excel, es un verdadero testamento de sus habilidades.\nLa animacion por Madhose como en su trabajo en ''Tokyo Godfathers'' es magnifica.\nEl tema de Opening, ''Yume no Shima Shinen Kouen'' de Hirasawa es increible, sus vocales celestiales con orquesta electrica le pone el tono extrano al comenzar la serie.\nSatoshi Kon, para mi, uno de los mas grandes directoes de Anime de todos los tiempos. Cada una de sus historias sobresalen 10 escalones mas arriba que los otras. Aunque no sea una historia realistica como ''Perfect Blue'' o sorprendente y edificante como ''Tokyo Godfathers'', sus peliculas hacen mas que entretenernos, nos hacen pensar.\nPara terminar ''Paranoia Agent'' es simplemente una refrescante y brillante adicion al mundo del Anime, se las recomiendo. ","torrent":{"xt":"urn:btih:a558b760cdd0871dc6970ea93d3cd2df76de16d6","amp;dn":"Paranoia+Agent.Serie+completa%5B13Caps%5D%5Bsahae%5D%5BDVDrip%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a558b760cdd0871dc6970ea93d3cd2df76de16d6","infoHashBuffer":{"type":"Buffer","data":[165,88,183,96,205,208,135,29,198,151,14,169,61,60,210,223,118,222,22,214]},"announce":[],"urlList":[]}}