{"title":"Rick Redbeard - No Selfish Heart [2012][EAC,log,cue. FLAC]","uid":8394682,"size":218984356,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a5910377868d36157ae9ef0202588ff82b9a117b&amp;dn=Rick+Redbeard+-+No+Selfish+Heart+%5B2012%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":12,"time":1366535598,"description":"Artist: Rick Redbeard\nRelease: No Selfish Heart\nDiscogs: 4315278\nReleased: 2012\nLabel: Chemikal Underground\nCatalog#: PCHEM190CD\nFormat: FLAC / Lossless / Log (100%) / Cue / CD\nCountry: UK\nStyle: Rock, Folk, World, &amp; Country, Acoustic\n\nTracklisting:\n\n01. Clocks\n02. Old Blue\n03. Any Way I Can\n04. A Greater Brave\n05. We All Float\n06. Kelvin Grove\n07. Now We're Dancing\n08. Cold As Clay (The Grave)\n09. Wildlove\n10. No Selfish Heart\n\nCredits: Show\n\nEight years in the making, 'No Selfish Heart' is a warming, darkly poignant collection that navigates universal themes of love, place and the passage of time. Ditching recording studios in favour of his parents' house in rural Aberdeenshire and the flat he calls home in the west end of Glasgow, the intimate, homely feel to 'No Selfish Heart' has been arrived at by design rather than happy accident. \n\nWith occasional backing vocals provided by Rick's sister Jo, the album's fireside intimacy is enhanced further still by the retention of creaking piano stools and the preference of character over technical perfection when laying down vocal and guitar tracks. \n\nIn contrast with the warmth of the storytelling is the album's monochrome artwork: a scene of stark, autumnal woodland provides a nod to the album's other, more bucolic, themes of nature, solitude and the changing of the seasons. Shaped as much by the elements raging outside his window as the albums rotating on his turntable, Rick Redbeard's debut is the stuff of log fires and graveyards; your breath on the winter air and the frost underneath your feet; love and lust, heartbreak and loss. \n\nEncompassing the mournful (We All Float) and the mortal (Cold As Clay (The Grave)), the temporal (Clocks) and the traditional (Kelvin Grove), 'No Selfish Heart' tackles them all with humour, beauty and pathos. If the macabre and the melancholy have often been the cornerstones of the best folk albums, 'No Selfish Heart' upholds that tradition beautifully. As the aching shruti-box lament of 'Clocks' fades in at the album's opening, the companionship of a roaring fire, a whisky and the love of your life could not come more highly recommended.","torrent":{"xt":"urn:btih:a5910377868d36157ae9ef0202588ff82b9a117b","amp;dn":"Rick+Redbeard+-+No+Selfish+Heart+%5B2012%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a5910377868d36157ae9ef0202588ff82b9a117b","infoHashBuffer":{"type":"Buffer","data":[165,145,3,119,134,141,54,21,122,233,239,2,2,88,143,248,43,154,17,123]},"announce":[],"urlList":[]}}