{"title":"/Learning_the_vi_Editor.pdf { UPPOG2 } torrents","uid":8849336,"size":651756,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a624639f83a4ad6c7aa66e48914732a04de54df6&amp;dn=%2FLearning_the_vi_Editor.pdf+%7B+UPPOG2+%7D+torrents+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bookgeeks","files":4,"time":1377480423,"description":"vi is a powerful editor that is ubiquitous amongst Unix and Unix-like operating\nsystems, but is available on many other operating systems, even on MS-DOS,\nWindows and the Macintosh. If not the original vi, there is usually at least a good\nclone available that runs on your system. Even if you use another editor you must\nhave a passing knowledge of vi as an administrator. Sometimes vi is the only editor\navailable when your computer crashes leaving a minimal system for you to repair.\nvi, pronounced like 'vee eye', was originally written by Bill Joy for BSD Unix in\nBerkeley in 1976 and became quickly part of many vendor-specific versions of the (at\nthat time) original AT&amp;T Unix. It was later directly added to AT&amp;T's System V Unix,\ntoo. Bill Joy later went on to co-found Sun Microsystems (http://www.sun.com) , and\nbecame the company's Chief Scientist at that time. vi stands for visual and was an\nenormous improvement of the classic Unix editor called ed. ed is a line-editor. If you are still familiar with MS-DOS, then you may know the MS-DOS edlin editor. ed is similar, although more powerful than edlin, which doesn't mean much.\n\nvi also has a line-mode, called ex. In fact, one can argue that the program is indeed two editors in one, one editor called vi, another called ex. It is possible to switch between line and visual mode during editing. It is also possible to choose the mode during startup. However, pure usage of ex is rare. The visual mode is the prevailing mode.\n\nAlthough vi stands for visual, classic vi is mainly operated via the character keys, and not via the mouse or the cursor keys. Once you are used to this, it becomes extremely convenient, because there is less movement of the hands to the cursor keys or mouse involved. vi also served as a kind of incubator for Unix's terminal control capabilities. Because of vi's need to control the terminal and the many different types of terminals at that time, the termcap (terminal- capabilities) database was introduced (later replaced with the more flexible terminfo database). vi's internal high-level screen control library was later separated, and became curses - the Unix standard library for CRT screen handling.\n\nFollow us on facebook...\n\n","torrent":{"xt":"urn:btih:a624639f83a4ad6c7aa66e48914732a04de54df6","amp;dn":"%2FLearning_the_vi_Editor.pdf+%7B+UPPOG2+%7D+torrents+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a624639f83a4ad6c7aa66e48914732a04de54df6","infoHashBuffer":{"type":"Buffer","data":[166,36,99,159,131,164,173,108,122,166,110,72,145,71,50,160,77,229,77,246]},"announce":[],"urlList":[]}}