{"title":"The Girls Series - Rachel Hollis","uid":13315262,"size":2622858,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a62fd40b5e46317ee909c9aa334b19c24964e9c7&amp;dn=The+Girls+Series+-+Rachel+Hollis&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":12,"time":1453823174,"description":"01. Party Girl [The Girls, #1] - Rachel Hollis\r\n\r\n\r\n\r\nLandon Brinkley’s dreams are all coming true. She’s landed an internship with the fabulous Selah Smith, event planner for the Hollywood elite, taking her from small-town Texas to the bright lights of LA. Landon soon finds herself in a world in which spending a million dollars on an event—even a child’s birthday party—is de rigueur and the whims of celebrity clients are life-and-death matters. At first, the thrill of working on A-list parties and celebrity weddings is enough to get Landon through the seventy-five-hour workweeks and endless abuse at the hands of her mercurial boss. But when the reality of the business reveals itself, she’s forced to make a choice: do whatever it takes to get ahead, or stay true to herself.\r\n\r\nDrawing on the author’s real-life experiences as an event planner to the stars, Party Girl takes readers on an adventure among Hollywood’s most beautiful—and most outrageous—people, revealing the ugly side of Hollywood’s prettiest parties.\r\n\r\n\r\n\r\n02. Party Girl's First Date [The Girls, #1.5] - Rachel Hollis\r\n\r\n\r\n\r\nThe Girl's Series Novella - Landon Brinkley is twenty-four years old and she’s never been on a real date. That’s mostly because she’s been working so hard on her dreams she hasn’t had time to bother with men. But then Brody Ashton walked into her life and since he looks like an underwear model (but you know, with clothes on) it was kind of impossible not to take notice.\r\n\r\nSo Landon and Brody are dating now, or really, beginning to. It’s all very new and exciting and there’s only one problem… they still haven’t gone on a real date. So that’s what tonight is supposed to be; magical, romantic, expensive… and it's about to go horribly wrong.\r\n\r\n\r\n\r\n03. Sweet Girl [The Girls, #2] - Rachel Hollis\r\n\r\n\r\nMax Jennings is in a bad mood. It’s not anything you did; it’s just that secrets from her past make it her natural state of being. But she’s not going to talk about it or share her feelings, so don’t bother asking.\r\n\r\nMax’s bad mood means that very few people actually truly understand her or know that her secret dream is to be a pastry chef. When a rare opportunity to work for world-famous Avis Phillips presents itself, Max jumps at the chance. Avis and her staff aren’t stingy with the tough love, so Max spends every spare minute practicing her craft. As she bakes brownies and custards, cookies and galettes, she builds an unlikely friendship with a man she once loathed and finds herself falling into something she’s spent the last six years avoiding. Will she let her painful past stand in the way, or will she muster the strength to forgive herself and realize her full potential?\r\n\r\n\r\n\r\n04. Smart Girl [The Girls, #3] - Rachel Hollis\r\n\r\n\r\n\r\nBrilliant designer Miko Jin is a hopeless romantic. She’s spent most of her life falling in love over and over again…with the men she finds in the pages of her favorite novels.\r\n\r\nWhen Miko meets Liam Ashton, it’s love at first sight. At least, for her. Sure, the two of them are polar opposites, and yes, he seems to be dating someone new each week. But Miko knows what true love is and that you can’t rush it—after all, what she lacks in real-world experience, she makes up for in book smarts. With novels as her guide, and her best friends by her side, she knows she can get Liam to love her back. But just like any good romance novel, fate has a few plot twists in store. Will Miko get her own happy ending? Will she find the strength to stand up for what she deserves even if it means breaking her own heart?","torrent":{"xt":"urn:btih:a62fd40b5e46317ee909c9aa334b19c24964e9c7","amp;dn":"The+Girls+Series+-+Rachel+Hollis","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a62fd40b5e46317ee909c9aa334b19c24964e9c7","infoHashBuffer":{"type":"Buffer","data":[166,47,212,11,94,70,49,126,233,9,201,170,51,75,25,194,73,100,233,199]},"announce":[],"urlList":[]}}