{"title":"Breaker Morant (1280 X 720 DivX HD) 1GB Michael Rizzo","uid":5908411,"size":1024448760,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:a6536c9abb08a28a61d6b8d07fb5585af65a477b&amp;dn=Breaker+Morant+%281280+X+720+DivX+HD%29+1GB+Michael+Rizzo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"moviesbyrizzo","files":1,"time":1287969130,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0080310/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0080310/&lt;/a&gt;\n\nThis movie speaks to the the very real spirit of the Australian genre in their\nrejection of impersonal application of rules and sense of decorum in the face of the needs of more real ideals of justice at the end of the day, have been for this\nreason often considered expendable by  the Brits (Gallipoli is another very great\nmovie on a similar theme) some Australian soldiers during the time of the Boer war \nare out on trial for actions they deem to have been defensible, as they were \nin fact from their perspective here, &quot;only following orders&quot; to take no prisoners.\nThe penalty however is death if their orders are subsequently denied as validly\nissued at all. A court martial is where the judgment is to be made, in this case\nof a sad tale indeed. \n\nThe Boer war was a sad chapter in our history. The greatest of our peoples in what\nis the leadership of the peoples of Europe - the British and the Dutch of course\n(although one cannot lose sight of the French or the Germans as Europe would be\nimpoverished to the point of being very considerable much less in beauty than it\nis) were involved in a war against each other when they should instead have been\nfriends and partners all along in what was the spirit of Christianly colonization\nin other parts of the planet where either would be justified in expansion.\n\nIndeed if you look at where the best of people of the traditions I speak of are\nnow extant on this earth, they are in fact not too far from one another - I refer\nof course to the very greatest peoples of Australia, and the equally nice peoples\nof South Africa who have long since but the borer war behind them to become a\nlovely product of a very compatible breed destined for greatness in mutual\ncompany.\n\nTruly outstanding picture quality, 1280 X 720 resolution, impressive 160k audio\ntrack. Converted from downloaded bluray 1080p source content using\nDivx plus converter from the DivX website. Its amazing what you can produce\nwith just a 1GB filesize, however the movie is well under 2 hours in lenght.\n\nMichael Rizzo Chessman\n\nNote: (especially for the folks in Australia) If you missed out on our initial\nseeding of the DivX vrsion of the compltete Upstairs downstairs collection\nor neglected to take our add-on folder of three episodes we inadvertantly missed\nwe'd like to make you aware thatthe full set of folders is available for download\nat our movie reviews website free of charge, and they are in fact exactly as\nyou require to join the torrent seed if that is your desire, including the torrent\nfiles used in the initial launch here. This is a great series and its a great\nmission we are involved in to reach as many pelle with it as possible. We can\nexceed the speed of dedicated dwnload server if we can get enough seeders on\nour torrents to do the job for those that will forever want to depend on this more\nsecure method of delivery into many areas that cant afford to do otherwise.\n\n\n\n\n\n","torrent":{"xt":"urn:btih:a6536c9abb08a28a61d6b8d07fb5585af65a477b","amp;dn":"Breaker+Morant+%281280+X+720+DivX+HD%29+1GB+Michael+Rizzo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a6536c9abb08a28a61d6b8d07fb5585af65a477b","infoHashBuffer":{"type":"Buffer","data":[166,83,108,154,187,8,162,138,97,214,184,208,127,181,88,90,246,90,71,123]},"announce":[],"urlList":[]}}