{"title":"[SoM]Flash Gordon[DvdRip-DivX3-Ita-Mp3]","uid":4471741,"size":726751232,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a72f0d2375eb180834dc77348fb9470c684ab415&amp;dn=%5BSoM%5DFlash+Gordon%5BDvdRip-DivX3-Ita-Mp3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mitimex","files":1,"time":1225158091,"description":"Il Dottor Zarro, scienziato della NASA, notando che la Luna ÃƒÂ¨ ben 12 gradi fuori dal proprio corso, ÃƒÂ¨ ormai sicuro di quanto giÃƒÂ  annunziato e non creduto: un potente imperatore del Cosmo ha dirottato la Luna onde distruggere la Terra. Con astuzia, Zarro riesce a trascinare con sÃƒÂ© il campione di baseball Flash Gordon e la sua fidanzata.\nProprio come previsto, lo Spietato ÃƒÂ¨ Ming, imperatore di Mongo, il quale, perÃƒÂ², finge di accogliere come ospiti i tre terrestri. Ming vuole appropriarsi del cervello di Zarro e sposare la bella Dale. Sua figlia Aura, giÃƒÂ  sposa del principe Barin e capricciosa, si invaghisce di Gordon.\n  Zarro e Gordon notano le divisioni, gli antagonismi e le rapacitÃƒÂ  dei diversi principi di cui vorrebbero servirsi per attaccare il potentissimo Ming. Grazie ad Aura, sfuggono all&amp;#039;annientamento; ma il tradimento della figlia di Ming viene scoperto e la stessa viene punita ferocemente da Kala comandante del sistema di difesa.\nGordon, tuttavia, riesce a convertire Barin, capo degli uomini albero, e a farselo amico fedele. La stessa impresa convince Vultano, re degli uomini falco, a tentare l&amp;#039;impresa disperata di un attacco al regno di Ming, su Mongo. La coalizione riesce proprio nel corso delle nozze tra Ming e la disperata Dale. Annientati i cattivi, Barin ottiene Aura finalmente ravveduta e tutta la folla spaziale festeggia Flash con Dale al suo fianco ","torrent":{"xt":"urn:btih:a72f0d2375eb180834dc77348fb9470c684ab415","amp;dn":"%5BSoM%5DFlash+Gordon%5BDvdRip-DivX3-Ita-Mp3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a72f0d2375eb180834dc77348fb9470c684ab415","infoHashBuffer":{"type":"Buffer","data":[167,47,13,35,117,235,24,8,52,220,119,52,143,185,71,12,104,74,180,21]},"announce":[],"urlList":[]}}