{"title":"Assorted bible movie torrents 4 - Christian","uid":3494333,"size":987617,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:a7944d714880659136a33cb4aa60996686ff868d&amp;dn=Assorted+bible+movie+torrents+4+-+Christian&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bucky katt","files":35,"time":1149947529,"description":"These are the torrent files for the following Bible movies\n\n\nAbraham DVD\nGospel of John DVD 1 and 2\nJeremiah DVD\nJesus of Nazareth DVD 1 and 2\nSolomon DVD\nThe Apocalypse (2002) DVD\nDavid DVD\nJoshua DVD\nJacob DVD\nJoseph DVD\nMoses DVD\nSamson and Delilah DVD\nEnd Times (2002) DVD\nApocalypse (1998) DVD\nCreation Seminar - Kent Hovind DivX\nUnlocking the Mystery of Life DVD\nSecrets of the Bible Code Revealed DVD\nSecrets of the Bible Code Revealed DivX\nBible Codes (Yacov Rambsel)\n\n--- NEW ---\nGospel of John DivX\nJeremiah DivX\nJesus of Nazareth DivX\nApocalypse (2002) DivX\nThe Greatest Story Ever Told DivX\nMiracle Maker - The Story of Jesus DivX\nTwilight Zone (1962-1-5) Nothing In the Dark DivX\nDavid DivX\nEnd Times (2002) DivX\nJacob DivX\nJoseph DivX\n\n--- Assorted bible stuff ---\n\nChuck Missler Genesis - MP3 Commentary and slideshow\nChuck Missler Cosmic Codes\nChuck Missler - Learn the Bible 24hrs\nChuck Missler - Daniel - MP3 Commentary and slideshow\n\n- Abraham DVD\n &lt;a href=&quot;\nhttp://imdb.com/title/tt0075520&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imdb.com/title/tt0075520&lt;/a&gt;\n\n3 hrs. 6 min.\n\nAudio: English\nSubs : English, Spanish, French.\n\nThe Old Testament story of Abraham and the trials he endures. Commanded by God to lead his family to the promised land of Canaan with the promise that if he does so, his descendants will become a great and numerous tribe. His obedience, as well as that of his children and grandchildren, is severely tested as they prove their faith to God.\n\n\n\t\t\n- Apocalypse - Caught in the Eye of the Storm (1998) DVD\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0149695/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0149695/&lt;/a&gt;\n\nApocalypse (1998)\n\nRuntime: 94 min.\n\nAudio: English\nSubs : none\n\nBronson (Richard Nester) and Helen (Leigh Lewis) are journalists reporting on the beginning of a war in the Middle East. But right in front of their eyes, something unexpected happens: Millions of people disappear without a trace. When a new and enigmatic leader appears at the head of the European Union, performing miracles and claiming to be God, the couple find themselves wrapped in a mystery of biblical proportions.\n\n\n- Apocalypse Series DivX\n\nApocalypse 1-Caught in the Eye of the Storm (1998)\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0149695/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0149695/&lt;/a&gt;\n\nRuntime: 94 min.\n\nAudio: English, Spanish\nSubs : none\n\nBronson (Richard Nester) and Helen (Leigh Lewis) are journalists reporting on the beginning of a war in the Middle East. But right in front of their eyes, something unexpected happens: Millions of people disappear without a trace. When a new and enigmatic leader appears at the head of the European Union, performing miracles and claiming to be God, the couple find themselves wrapped in a mystery of biblical proportions.\n\n=======================================================================\n\nApocalypse 2-Revelation (1999)\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0161942/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0161942/&lt;/a&gt;\n\nRuntime: 98 min.\n\nAudio: English, Spanish\nSubs : none\n\n\nThis sequel to Apocalypse (1998) follows counter-terrorism expert Thorold Stone (Jeff Fahey) as he deals with the consequences of the events that took place in the first movie. His wife and daughter have vanished; is a conspiracy rooted in the highest levels of the new global order to blame? Nick Mancuso, Leigh Lewis and Carol Alt co-star in this faith-based thriller.\n\n\n=======================================================================\n\nApocalypse 3-Tribulation (2000)\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0202236/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0202236/&lt;/a&gt;\n\nRuntime: 95 min.\n\nAudio: English, Spanish\nSubs : none\n\nThis sequel to &quot;Revelation (1999)&quot; stars Gary Busey in a role that parallels his own personal life and death experience. After a tragic accident, Tom Canboro (Gary Busey) awakens from a coma to find the mark of the beast everywhere. Or is it just a dream?\n\n\n=======================================================================\n\nApocalypse 4-Judgment (2001)\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0257408/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0257408/&lt;/a&gt;\n\nRuntime: 105 min.\n\nAudio: English, Spanish\nSubs : none\n\nAttorney Mitch Kendrick (Corbin Bernsen) is handed a challenging assignment when he&amp;#039;s picked to defend the mysterious Helen Hannah (Jessica Steen) in court. Hannah is a Christian who&amp;#039;s garnered quite a following, and angry non-believers want her out of the picture at all costs. A skeptic when hired, Kendrick soon starts to see the truths in Hannah&amp;#039;s teachings and is transformed into a saved man. But his epiphany could cost him his life.\n\n=======================================================================\n\n\n\n\n\n- Apocalypse (2002) DivX\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0303668/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0303668/&lt;/a&gt;\n\nRuntime: 100 min.\n\nAudio: English\nSubs : none\n\nmoviesunlimited.com:\n&quot;Richard Harris, in one of his last performances, stars as the Apostle John in this gripping biblical drama. As the only living witness to Christ&amp;#039;s crucifixion, John is visited in his Roman prison by a young Christian woman to whom he gives the written records of his visions that would become the Book of Revelation. With Vittoria Belvedere, Benjamin Sadler, Christian Kohlund. 97 min. Widescreen; Soundtrack: English (no subs)&quot;\n\n\nwww.netflix.com:\n&quot;Veteran actor Richard Harris portrays the apostle John, who has spent the last few years being held captive by the emperor of Rome. From the depths of captivity, John attempts to spread the word of the Lord to anyone and everyone who expresses interest. When a young Christian woman manages to reach John, she&amp;#039;s given his many journals filled with past experiences, which later become the Book of Revelations.&quot;\n\n\n\n- Apocalypse (2002) DVD\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0303668/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0303668/&lt;/a&gt;\n\nRuntime: 100 min.\n\nAudio: English\nSubs : none\n\n\nmoviesunlimited.com:\n&quot;Richard Harris, in one of his last performances, stars as the Apostle John in this gripping biblical drama. As the only living witness to Christ&amp;#039;s crucifixion, John is visited in his Roman prison by a young Christian woman to whom he gives the written records of his visions that would become the Book of Revelation. With Vittoria Belvedere, Benjamin Sadler, Christian Kohlund. 97 min. Widescreen; Soundtrack: English (no subs)&quot;\n\n\nwww.netflix.com:\n&quot;Veteran actor Richard Harris portrays the apostle John, who has spent the last few years being held captive by the emperor of Rome. From the depths of captivity, John attempts to spread the word of the Lord to anyone and everyone who expresses interest. When a young Christian woman manages to reach John, she&amp;#039;s given his many journals filled with past experiences, which later become the Book of Revelations.&quot;\n\n\n\n\n- Bible Codes (Yacov Rambsel)\n\nRuntime: 30 min.\n\nAudio: English\nSubs : none\n\nThis is the interview with Yacov Rambsel done on the show &quot;It&amp;#039;s Supernatural&quot;, The guy doing the interview (Sid Roth) is kinda nutty but Yacov Rambsel is an amazing person, he does all the ELS code searches by hand, no computer.\n\n\n\n- Chuck Missler- Cosmic Codes\n\nAre we in possession of messages of extraterrestrial origin?\nIf so, what do they mean?\nWhat do these messages from the edge of eternity portend for the future?\nWhat has the science of cryptology revealed about these ancient texts? Is our universe itself a &quot;digital message&quot;?\nDo these messages explain the interval between the miracle of our origin and the mystery of our destiny?\n\nRead the implications of our finite universe and the shocking discoveries of quantum physics at the very boundaries of reality and learn their significance to our origin and personal destinies!\n\nYou will grow in excitement as Chuck Missler details astonishing hidden messages within the text of the Torah that could only have been placed there by the Great Author Himself. He explores the impact of information sciences on our understanding of ancient texts...including microcodes, macrocodes, and metacodes...as well as the highly controversial &quot;equidistant letter sequences&quot; discovered in the Bible. You will be able to use this exciting information to discover the hidden messages yourself because many of them do not require a computer to decipher.\n\nThis collection contains all four Cosmic Codes studies as the Automated Multimedia files which contain the all-new slideshows, and the complete set of notes in PDF format.\n\n* Volume One - Introduction Chuck Missler reviews the history of cryptography - the study of secret codes - and the background of proposed interstellar languages.\n* Volume Two - Microcodes: An exploration of Microcodes, the unique qualities of Hebrew that make it codeable.\n* Volume Three - Macrocodes: A study of macrocodes, prophetic messages that God has given through symbolism and types.\n* Volume Four - Metacodes: A study of metacodes, the codes that God has placed in nature - signals from the tenth dimension and the code of life.\n\nRunning Time: Approx 8 hours.\n\n\n\n- Chuck Missler - Daniel - MP3 Commentary and slideshow\n\nThe Book of Daniel contains the most amazing prophecies of the Bible, and is one of the most authenticating books of the Old Testament. The numerous detailed prophecies of the period of Gentile dominion make this one of the most important foundational studies for anyone who takes the Bible seriously.\n\n\n* Over 20 hours of Verse-by-Verse audio teaching through the book of Daniel as MP3 files.\n* 16 All-New Multimedia Slideshow Presentations!\n* Extensive searchable study notes as PDF files.\n\n* Daniel 1; Dare to be a Daniel - Introduction to the Book. Background, authentication, etc.\n* Daniel 2; Nebuchadnezzar&amp;#039;s Dream - The poly-metallic image; an overview of all the Gentile dominion on the Planet Earth. Daniel and his three friends avoid death penalty and get promoted.\n* Daniel 3; Bow or Burn - Nebuchadnezzar&amp;#039;s ego trip; the worship of his image.\n* Daniel 4; Nebuchadnezzar&amp;#039;s Testimony - The only chapter in the Bible written by a Gentile king.\n* Daniel 5; The Fall of Babylon - The &quot;handwriting on the wall&quot; and the fall of Babylon to the Persians.\n* The Mystery of Babylon - Babylon in Bible prophecy; it&amp;#039;s ultimate destruction; an update on current events; the &quot;Mystery Babylon&quot; of Revelation.\n* Daniel 6; Daniel in the Lion&amp;#039;s Den - How Daniel avoided the &quot;mark of the beast.&quot;\n* The Magi - A supplemental study on the background on the &quot;Magi&quot; and their role in the birth of Jesus Christ.\n* Daniel 7; The Times of the Gentiles - The four empires which climax Gentile dominion on the Earth.\n* European Update - An update of the emergent European Suprastate.\n* Daniel 8; The Ram and the Goat - The succession of the Persian and Greek Empires and the rise of Alexander the Great.\n* Foreshadowings of the final World Ruler. The Seventy Weeks of Daniel - The Most Amazing Prophecy in the Bible.\n* Daniel 9A; The 69 Weeks - The Angel Gabriel predicts the precise day on which Jesus presented Himself as the &quot;Meshiach Nagid&quot; (The Messiah the King).\n* Daniel 9B; The 70th Week of Daniel - The mysterious interval between the 69th and 70th &quot;weeks&quot; of Daniel and the final seven years of world history.\n\nThe Final Vision\n\n* Daniel 10; The Dark Side - The spooky glimpse of the spiritual warfare that lies behind world events.\n* Daniel 11; Coming Future Kingdoms - The amazing prediction of the conflicts between the Ptolemaic and Seleucid Empires and the emergence of the final World Leader.\n* Daniel 12 - The Climax of All History\n\n\n\n- Chuck Missler - Genesis - MP3 Commentary and slideshow\n\nChuck Missler Genesis - MP3 Commentary and slideshow\n\n\nRecent breakthroughs in the fields of physics, technology and biology led Chuck Missler to update and re-record this wonderful study in Genesis. With over 24 hours of teaching, this verse-by-verse study of the book of Genesis has been one of our most sought-after and best-selling series in the history of Koinonia House.\n\nPulling back the veil of prehistory, Chuck will take you on a journey into the very nature of our universe, exploring the mechanics of creation, time and space, the physics of eternity and the intricate design of God&amp;#039;s wonderful plan for our salvation\n\nThis foundational study begins where any true adventure does...\n\n&quot;In the Beginning&quot;.\n\n# Over 24 hours of Verse-by-Verse audio teaching through the book of Genesis as MP3 files.\n# 24 individual slideshow presentations.\nThe Genesis Commentary includes the following studies:\n\n* Genesis Session 1- Introduction, The Book of Beginnings, Is the Bible Inerrant?\n* Genesis Session 2- Day One, Satan, The Mysteries of Light.\n* Genesis Session 3- 2nd Day, The Fabric of Space, Stretching the Heavens, Hyperdimensions, Boundaries of Reality.\n* Genesis Session 4- 3rd Day, Dry Land, Seas, Vegetation, The Water Molecule, The Cell Revealed.\n* Genesis Session 5- 4th Day, The Nebular Hypothesis, The Long Day of Joshua, Signs in the Heavens.\n* Genesis Session 6- 5th Day, The Mystery of Life.\n* Genesis Session 7- 6th Day, The Architecture of Man, The Nature of Time.\n* Genesis Session 8- 7th Day, The Sabbath.\n* Genesis Session 9- Chapter 3, The Seed Plot of the Entire Bible.\n* Genesis Session 10- Chapters 4 &amp; 5, The 2nd Murder, The Geneology of Noah.\n* Genesis Session 11- Chapter 6, The Days of Noah.\n* Genesis Session 12- Chapters 7 &amp; 8, The Flood.\n* Genesis Session 13- Chapters 9 &amp; 10, The Post-Flood World.\n* Genesis Session 14- Chapter 11, The Tower of Bab-El.\n* Genesis Session 15- Chapters 12 - 15, The Call of Abraham.\n* Genesis Session 16- Chapters 16 - 20, The Walk of Abraham.\n* Genesis Session 17- Chapters 21, 22, 24, The Birth of Isaac, The Offering of Isaac, A Bride for Isaac.\n* Genesis Session 18- Chapters 23, 25-27, The Death of Sarah, Birth of Esau and Jacob, The Covenent Confirmed, The Stolen Blessing.\n* Genesis Session 19- Chapters 28-31, Jacob at Bethel, Leah and Rachel, Sons of Jacob, Jacob&amp;#039;s Flight.\n* Genesis Session 20- Chapters 32-36, Jacob&amp;#039;s Wrestling, Jacob Reconciles With Esau, Dinah Avenged, Jacob Returns to Bethel, The Generations of Esau.\n* Genesis Session 21- Chapters 37-39, Joseph&amp;#039;s Dreams, Judah&amp;#039;s Sin With Tamar (Review of Ruth), Joseph Imprisoned.\n* Genesis Session 22- Chapters 40-45, Joseph in Egypt.\n* Genesis Session 23- Chapters 46-48 &amp; 50, The Family in Egypt.\n* Genesis Session 24- Chapter 49, The Tribes Prophetically.\n\n\n\n- Chuck Missler - Learn the Bible in 24 hours\n\nThis comprehensive series of 24 one-hour studies will take you from the beginning of all things in Genesis to the final culmination in the Book of Revelation.\n\nObviously, the Bible is truly a lifetime study, but 24 intensive sessions can provide you the strategic grasp that often eludes a detailed study of selected passages. This comprehensive review will provide a perspective from which you can navigate the Scriptures to explore specific studies. One of the astonishing discoveries will be the integrity of the overall design which is visible only through such a comprehensive undertaking.\n\nThis set includes the MP3&amp;#039;s and multimedia slides show presentation. Now it is easier than ever to build that firm foundation of God&amp;#039;s Word\n\n\n\n- Creation Seminar - Kent Hovind DivX\n\nCreation Seminar - Kent Hovind - DivX\n\nRuntime: 17 hrs.\n\nAudio: English\nSubs : None\n\nDr. Hovind&amp;#039;s Creation Seminar Series is his most popular set of videos. God has used the message it presents to bring thousands of people closer to Him.\n\nIn This 17-hour series:\n\nPart 1, The Age of the Earth\n\nGiving scientific evidence to prove a literal six-day creation, Dr. Kent Hovind refutes evolution&amp;#039;s proposition that the earth has evolved over billions of years. The first of seven in the seminar series, The Age of the Earth, uncovers the follies of the Big Bang theory as well as exposing the religious beliefs of evolution. 126 minutes.\n\nPart 2, The Garden of Eden\n\nThe Garden of Eden, part two of the seminar series, describes the earth as it was before the worldwide flood. Dr. Hovind explains in detail how it was possible for man to live over 900 years, for plants and animals to grow much larger than today, and for dinosaurs to thrive along with man. 137 minutes.\n\nPart 3, Dinosaurs and the Bible\n\nFor many years, some thought the existence of dinosaurs discredited the Biblical account of creation. In part three of the seminar series, Dinosaurs and the Bible, Dr. Hovind traces the Biblical and historical references to dinosaurs and interviews people who claim they have seen living dinosaurs. 157 minutes.\n\n\nPart 4, Lies in the Textbooks\n\nIn part four of the seminar series, Dr. Hovind shows how public school textbooks are permeated with fraudulent information in order to convince students that evolution is true. Lies in the Textbooks is a must-see for every public school student, teacher, parent and school board member. 175 minutes.\n\n\nPart 5, The Dangers of Evolution\n\nIn The Dangers of Evolution, Dr. Hovind reveals the terrible effects that evolutionary beliefs have had on societies throughout history. Giving examples of evolution-based philosophies being used to rationalize the brutal acts of rulers, he exposes evolutionary propaganda in its effort toward the &quot;New World Order.&quot; 152 minutes.\n\nPart 6, The Hovind Theory\n\nThe Hovind Theory blends scientific observations with Scripture in a fascinating explanation of what caused Noah&amp;#039;s Flood, the Ice Age, the formation of coal, mountain ranges, and the Grand Canyon. Dr. Hovind gives logical answers to the physical anomalies that geologists cannot explain with the evolutionary theory. 104 minutes.\n\nPart 7, Question and Answer Session\n\nThe last in the seminar series, Questions and Answers, covers a variety of topics including radiometric dating and the speed of light in relation to star distance. In addition to &quot;primitive man&quot; and race origins, Dr. Hovind discusses the mark of the beast and supposed contradiction&amp;#039;s in the Bible. 180 minutes.\n\n\n\n- Dave Hunt - A Woman Rides The Beast (NTSC-VCD)\n\nVirtually all attention these days is focused on the coming Antichrist -- but he is only half the story. Many are amazed to discover in Revelation 17 that there is also another mysterious character at the heart of prophecy -- a woman who rides the beast. Hunt states in his book:\n&quot;The leaders of the Reformation were certain that she represented the Roman Catholic Church in general and the pope in particular. That belief, however, has been rejected lately by most Protestants as provocative and demeaning to a body of fellow Christians with whom evangelicals desire to work together in the task of winning most of the world for Christ before the year 2000. In fact, the subject of the woman is generally avoided today as too divisive to discuss.&quot;\n&quot;Still, the woman, so vividly portrayed by John, cannot be dismissed so easily. There she is. Two of the final chapters in the Bible are devoted to her. What will we do with her? It would be dishonest to ignore such an important prophetic figure. The entire Bible is God&amp;#039;s Word. We have no more right to close our eyes to Revelation 17 and 18 than to John 3:16.&quot;\nIn this video, past and future come together as Dave Hunt carefully sifts through history, biblical truth, and global events to present a well-defined portrait of the woman and her powerful place in the Antichrist&amp;#039;s future empire. This in-depth study of the doctrines, practices, and history of the Catholic Church includes a compelling look at eight clues in Revelation 17 and 18 that provide undeniable proof that the woman who rides the beast is none other than the Roman Catholic Institution.\n\n\n\n- David DivX\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0118933/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0118933/&lt;/a&gt;\n\nRuntime: 3 hrs. 10 min.\n\nAudio: English\nSubs : none\n\nAmazon Review (edited): by Alejandra Vernon\n\nThis is a marvelous production, filmed in Morocco, with wonderful costumes, textiles, and rustic sets, making this telling of King David&amp;#039;s life visually believable. It has some standout performances, and Nathaniel Parker, always a favorite of mine, fares well as Israel&amp;#039;s second king. As Saul, the casting of Jonathan Pryce is an odd choice (Saul was &quot;a head taller than his people&quot; and there was &quot;not a man more handsome than he&quot;) but it works, and he is exceptional as the tormented and demented king.\n\nGideon Turner is very good as the young David, Dominic Rowan is a great bit of casting as Absalom, and as Joab, Maurice Roeves is terrific. Other notables play the two prophets, Leonard Nimoy, in an appealing and powerful portrayal of Samuel, and Franco Nero as a handsome Nathan.\n\nThe photography is lovely (by Raffaele Mertes) and the melodic score by Carlo Siliotto enhances the mood (the final title music is by Ennio Morricone).\n\nThe story line picks up at 1 Samuel, Chapter 9, with Saul looking for his father&amp;#039;s mules, and proceeds through much of both books of Samuel, often being quite faithful to them. It is interspersed with the occasional Psalm, and writer Larry Gross has blended scripture and dialogue quite effectively. It is interesting to watch this with Bible in hand, to see just how cleverly this has been done.\n\nThere are some moving scenes, like David&amp;#039;s annointing, and his proposal to Abigail (played by the beautiful Lina Sastri). This is a way above-average film for television. There are a few gory battle scenes that would be too violent for the very young, but otherwise this is an excellent family film for older children, with the complexity of King David making it a fascinating story for discussion and repeated viewings.\n\n\n\n- David DVD\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0118933/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0118933/&lt;/a&gt;\n\nRuntime: 3 hrs. 10 min.\n\nAudio: English\nSubs : English, Spanish, French.\n\nAmazon Review (edited): by Alejandra Vernon\n\nThis is a marvelous production, filmed in Morocco, with wonderful costumes, textiles, and rustic sets, making this telling of King David&amp;#039;s life visually believable. It has some standout performances, and Nathaniel Parker, always a favorite of mine, fares well as Israel&amp;#039;s second king. As Saul, the casting of Jonathan Pryce is an odd choice (Saul was &quot;a head taller than his people&quot; and there was &quot;not a man more handsome than he&quot;) but it works, and he is exceptional as the tormented and demented king.\n\nGideon Turner is very good as the young David, Dominic Rowan is a great bit of casting as Absalom, and as Joab, Maurice Roeves is terrific. Other notables play the two prophets, Leonard Nimoy, in an appealing and powerful portrayal of Samuel, and Franco Nero as a handsome Nathan.\n\nThe photography is lovely (by Raffaele Mertes) and the melodic score by Carlo Siliotto enhances the mood (the final title music is by Ennio Morricone).\n\nThe story line picks up at 1 Samuel, Chapter 9, with Saul looking for his father&amp;#039;s mules, and proceeds through much of both books of Samuel, often being quite faithful to them. It is interspersed with the occasional Psalm, and writer Larry Gross has blended scripture and dialogue quite effectively. It is interesting to watch this with Bible in hand, to see just how cleverly this has been done.\n\nThere are some moving scenes, like David&amp;#039;s annointing, and his proposal to Abigail (played by the beautiful Lina Sastri). This is a way above-average film for television. There are a few gory battle scenes that would be too violent for the very young, but otherwise this is an excellent family film for older children, with the complexity of King David making it a fascinating story for discussion and repeated viewings.\n\n\n\n\n- End of the Harvest (1998) DivX\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0295236/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0295236/&lt;/a&gt;\n\nRuntime: 54 min.\n\nAudio: English\nSubs : none\n\nThis film stars David White (from the excellent Mercy Streets) as a student on campus who knows and studies his bible furiously but is shy about sharing his faith (a common problem) and his friend who as a sort of revenge organises a speech in front of the philosophy class that specialises in humiliating christians. They have stumbled upon a paper written some 50 years before that claims to know when the world will end.\n\nFeaturing excellent acting and very well put together screenplay, End of the harvest will provoke thought in both christians and non-christians alike on how long this world is going to continue and when it will end. Very well done.\n\nFive Star Review at Amazon.com\n\n\n\n- End of the Harvest (1998) DVD\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0295236/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0295236/&lt;/a&gt;\n\nRuntime: 54 min.\n\nAudio: English,Spanish\nSubs : none\n\nA young Christian is humiliated after he attends a college philosophy club meeting filled with atheists. The club mocks his attempts to prove the existence of God, and now the unprepared student is out for revenge. After finding a mysterious paper written decades ago, he tries to ambush the next meeting by telling the students when the world is going to end and how it&amp;#039;ll happen. When his scare tactics don&amp;#039;t work, he struggles to understand why.\n\nFive Star Review at Amazon.com\n\n\n\n- End Times (2002) DVD\n\n\nRuntime: 55 min.\n\nAudio: English\nSubs : none\n\nLearn about the events prophesied in the Book of Revelations, which proclaimed that the end is nigh. This program depicts worldwide occurrences of war, disease and natural disasters that are believed to signal the coming of the Apocalypse. Includes commentary by Ed Hindson, Thomas Ice, Larry Poland and Tim LaHaye.\n\n\n\n- End Times (2002) DivX\n\n\nRuntime: 55 min.\n\nAudio: English\nSubs : none\n\nLearn about the events prophesied in the Book of Revelations, which proclaimed that the end is nigh. This program depicts worldwide occurrences of war, disease and natural disasters that are believed to signal the coming of the Apocalypse. Includes commentary by Ed Hindson, Thomas Ice, Larry Poland and Tim LaHaye.\n\n\n\n- Gospel of John DivX\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0377992/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0377992/&lt;/a&gt;\n\nRuntime: 180 min.\n\nAudio: English\n\nThis widely acclaimed motion picture is a meticulous recreation of the turbulent era of Jesus and the events that changed the course of history! Narrated by Golden Globe nominee Christopher Plummer (Best Supporting Actor, AMERICAN TRAGEDY, 2000), it is the bold and powerful story of Jesus as told by his disciple John. The best-loved but least understood of the gospels, John presents a uniquely human portrait of courage and passion encompassing Jesus&amp;#039; entire three-year ministry, the final years of his life. Intimate and reflective, THE GOSPEL OF JOHN offers an unparalleled opportunity to experience the incomparable life and times of Jesus Christ.\n\n\n\n\n- Gospel of John DVD 1 and 2\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0377992/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0377992/&lt;/a&gt;\n\nRuntime: 180 min.\n\nAudio: English\n\n\nThis widely acclaimed motion picture is a meticulous recreation of the turbulent era of Jesus and the events that changed the course of history! Narrated by Golden Globe nominee Christopher Plummer (Best Supporting Actor, AMERICAN TRAGEDY, 2000), it?s the bold and powerful story of Jesus as told by his disciple John. The best-loved but least understood of the gospels, John presents a uniquely human portrait of courage and passion encompassing Jesus&amp;#039; entire three-year ministry, the final years of his life. Intimate and reflective, The Gospel of John offers an unparalleled opportunity to experience the incomparable life and times of Jesus Christ.\n\n\n\n- Greatest Story Ever Told DivX\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0059245/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0059245/&lt;/a&gt;\n\nRuntime: 199 minutes\n\nAudio: English\nSubs : none\n\nSwedish actor Max Von Sydow made his English-speaking debut in this gargantuan retelling of the life of Christ from Giant director George Stevens. The much-ballyhooed all-star cast includes Charlton Heston as John the Baptist and John Wayne as The Centurion at The Crucifixion. Filmed in Death Valley and in Utah, Nevada and Arizona locations, this dazzling epic garnered five Oscar nominations, including Best Special Effects and Best Score.\n\n\n\n\n\n- Jacob DivX\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0110175/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0110175/&lt;/a&gt;\n\nRuntime: 91 min.\n\nAudio: English\nSubs : none\n\nIn this inspiring tale from the biblical book of Genesis, young shepherd Jacob (Matthew Modine) falls in love with and wants to marry pretty Rachel (Lara Flynn Boyle), the daughter of his Uncle Laban (Giancarlo Giannini). Lacking a dowry, Jacob toils seven years as his uncle&amp;#039;s indentured servant to win Rachel&amp;#039;s hand -- only to have the calculating Laban dupe him into another seven years of labor.\n\n\n\n\n\n- Jacob DVD\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0110175/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0110175/&lt;/a&gt;\n\nRuntime: 91 min.\n\nAudio: English\nSubs : English, Spanish, French.\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0110175/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0110175/&lt;/a&gt;\n\nIn this inspiring tale from the biblical book of Genesis, young shepherd Jacob (Matthew Modine) falls in love with and wants to marry pretty Rachel (Lara Flynn Boyle), the daughter of his Uncle Laban (Giancarlo Giannini). Lacking a dowry, Jacob toils seven years as his uncle&amp;#039;s indentured servant to win Rachel&amp;#039;s hand -- only to have the calculating Laban dupe him into another seven years of labor.\n\n\n\n\n- Jeremiah DivX\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0174792/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0174792/&lt;/a&gt;\n\nRuntime: 90 min.\n\nAudio: English\n\nThe young Jeremiah grows up in a priest&amp;#039;s family in the village of Anathoth, near Jerusalem. God appears to Jeremiah in different human guises on several occasions, and makes it clear to him that he has been selected to announce God&amp;#039;s message to the people of Jerusalem: a mighty ruler from the north will attack the Kingdom of Judah if the people there continue to worship false idols, and fail to remember the One God. No-one in Anathoth believes Jeremiah&amp;#039;s prophecy, however. Instead, he is accused of blasphemy and is physically attacked - and not even his family comes to his aid. Nevertheless, with the help of Baruch, a temple scribe who hears Jeremiah&amp;#039;s first sermon and becomes his disciple, Jeremiah succeeds in announcing the word of God. The prophet&amp;#039;s message of impending doom incurs only the wrath and rejection of the ruling classes, the priesthood and the King. Jeremiah can find no audience, and lands up in captivity again - but even though he even has to leave his true love for Judith to fate, he still sticks firmly to his mission. It is only when war with the enemy forces from Babylon seems inevitable that the people of Jerusalem start to grow restless, and Jeremiah gradually starts to win support. However the King, who is taking the advice of the false prophet Hananiah, is certain that the country&amp;#039;s powerful neighbours, the Egyptians, will come to his assistance. Shortly afterwards, however, the Babylonians lay siege to the Holy City. Although the King now believes Jeremiah, he still finds it impossible to make the decision to surrender the city. Jerusalem goes up in flames, and the people are led off into exile in Babylon.\n\n\n\n\n- Jeremiah DVD\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0174792/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0174792/&lt;/a&gt;\n\nRuntime: 90 min.\n\nAudio: English\n\nThe young Jeremiah grows up in a priest&amp;#039;s family in the village of Anathoth, near Jerusalem. God appears to Jeremiah in different human guises on several occasions, and makes it clear to him that he has been selected to announce God&amp;#039;s message to the people of Jerusalem: a mighty ruler from the north will attack the Kingdom of Judah if the people there continue to worship false idols, and fail to remember the One God. No-one in Anathoth believes Jeremiah&amp;#039;s prophecy, however. Instead, he is accused of blasphemy and is physically attacked - and not even his family comes to his aid. Nevertheless, with the help of Baruch, a temple scribe who hears Jeremiah&amp;#039;s first sermon and becomes his disciple, Jeremiah succeeds in announcing the word of God. The prophet&amp;#039;s message of impending doom incurs only the wrath and rejection of the ruling classes, the priesthood and the King. Jeremiah can find no audience, and lands up in captivity again - but even though he even has to leave his true love for Judith to fate, he still sticks firmly to his mission. It is only when war with the enemy forces from Babylon seems inevitable that the people of Jerusalem start to grow restless, and Jeremiah gradually starts to win support. However the King, who is taking the advice of the false prophet Hananiah, is certain that the country&amp;#039;s powerful neighbours, the Egyptians, will come to his assistance. Shortly afterwards, however, the Babylonians lay siege to the Holy City. Although the King now believes Jeremiah, he still finds it impossible to make the decision to surrender the city. Jerusalem goes up in flames, and the people are led off into exile in Babylon.\n\n\n\n\n\n\n- Jesus of Nazareth DivX\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0075520/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0075520/&lt;/a&gt;\n\nRuntime: 371 min.\n\nAudio: English\nSubs : none\n\n\nimdb user rating 8.5/10 (1,408 votes)\n\nEditorial Reviews\nAmazon.com essential video\n\nOriginally made for TV in 1977, this in-depth (six hours plus) version of Jesus&amp;#039; life is so thorough that the first hour is devoted solely to the story of his birth. The film doesn&amp;#039;t skimp on some of the other landmark events of this famous story either. Director Franco Zeffirelli gives more than 12 minutes screen time each to the Last Supper and the Crucifixion. Passages of the Bible are quoted verbatim, the locations have a Palestine-like authenticity, and, aside from some of the principals (Robert Powell as Jesus, Olivia Hussey as Mary, and Stacy Keach as Barabbas), many of the non-Roman characters are actually played by Semitic-looking actors. Zeffirelli diligently provides the sociopolitical background that gave rise to Jesus&amp;#039; following and the crisis in belief it caused for the people of Israel (and one or two Romans). While not graphic by today&amp;#039;s standards, some of the scenes--baby boys being ripped from their mothers&amp;#039; arms and slaughtered, nails being driven into Jesus&amp;#039; hands--may disturb young and/or sensitive children. --Kimberly Heinrichs\n\n\n\n\n- Jesus of Nazareth DVD 1 and 2\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0075520/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0075520/&lt;/a&gt;\n\nRuntime: 371 min.\n\nAudio: English\nSubs : none\n\nimdb user rating 8.5/10 (1,408 votes)\n\nEditorial Reviews\nAmazon.com essential video\n\nOriginally made for TV in 1977, this in-depth (six hours plus) version of Jesus&amp;#039; life is so thorough that the first hour is devoted solely to the story of his birth. The film doesn&amp;#039;t skimp on some of the other landmark events of this famous story either. Director Franco Zeffirelli gives more than 12 minutes screen time each to the Last Supper and the Crucifixion. Passages of the Bible are quoted verbatim, the locations have a Palestine-like authenticity, and, aside from some of the principals (Robert Powell as Jesus, Olivia Hussey as Mary, and Stacy Keach as Barabbas), many of the non-Roman characters are actually played by Semitic-looking actors. Zeffirelli diligently provides the sociopolitical background that gave rise to Jesus&amp;#039; following and the crisis in belief it caused for the people of Israel (and one or two Romans). While not graphic by today&amp;#039;s standards, some of the scenes--baby boys being ripped from their mothers&amp;#039; arms and slaughtered, nails being driven into Jesus&amp;#039; hands--may disturb young and/or sensitive children. --Kimberly Heinrichs\n\n\n\n\n- Joseph DivX\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0113483/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0113483/&lt;/a&gt;\n\nRuntime: 185 min.\n\nAudio: English\nSubs : none\n\nJoseph (Paul Mercurio) was cast into a pit by his jealous brothers and pled for mercy, but the brothers turned a deaf ear and sold their youngest sibling into slavery in Egypt. There, Joseph used his gift for divining dreams to become Pharaoh&amp;#039;s most trusted aide, saving Egypt from seven years of famine. When his brothers traveled to Egypt in search of food, they ran straight into ? a forgiving Joseph! Ben Kingsley and Martin Landau co-star.\n\n\n\n\n\n- Joseph DVD\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0113483/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0113483/&lt;/a&gt;\n\nRuntime: 185 min.\n\nAudio: English\nSubs : English, Spanish, French.\n\nJoseph (Paul Mercurio) was cast into a pit by his jealous brothers and pled for mercy, but the brothers turned a deaf ear and sold their youngest sibling into slavery in Egypt. There, Joseph used his gift for divining dreams to become Pharaoh&amp;#039;s most trusted aide, saving Egypt from seven years of famine. When his brothers traveled to Egypt in search of food, they ran straight into ? a forgiving Joseph! Ben Kingsley and Martin Landau co-star.\n\n\n\n\n\n- Joshua DVD\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0271582/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0271582/&lt;/a&gt;\n\nRuntime: 90 min.\n\nAudio: English\nSubs : none\n\n\nThe town of Auburn was always normal, to say the least. True, the people there weren&amp;#039;t really a &quot;community&quot;, but they never noticed...until a stranger named Joshua rolled into town one morning. In small ways, Joshua began to help out around the town-helping a teen play guitar, helping save a marriage in danger, or teaching a bumbling priest how to speak about faith. An old Baptist church that came down in a storm is his next big project. With the help of stuttering Theo, who dreams of being a preacher, he brings the town together to restore the old building. In this way, the whole town unites and becomes a community. This attracts the attention of Father Tordone, who is a bitter man due to the fact that he lost a position in the Vatican. When the mysterious Joshua begins to show up in two places at once and miraculously cures a blind woman, Father Tordone believes Joshua is a false prophet, trying to cheat people. When his next huge miracle-reviving Theo from death after he falls from the roof of the newly completed church-overwhelms the town, Father Tordone seeks out an official condemnation from the Vatican. But Joshua melts his icy heart, and the reformed Father becomes a Vatican member. Joshua sees the Pope himself and reveals himself as Jesus! After his meeting, Joshua leaves-but the people of Auburn, with their dreams fufilled and their happiness increased.\n\n\n\n\n- Miracle Maker - The Story of Jesus DivX\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0208298/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0208298/&lt;/a&gt;\n\nRuntime: 87 min.\n\nAudio: English\nSubs : none\n\n\nA heavyweight cast of voice-over talent (Ralph Fiennes, Julie Christie, William Hurt and Ian Holm) breathes life into this animated version (using the claymation process) of the greatest story ever told. King Herod, Judas Iscariot and Mary Magdalene are all on hand to play their parts in the life story of Jesus Christ. Particularly effective is the imaginative use of flashbacks. Well Worth watching!\n\n\n\n\n- Moses DVD\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0117086/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0117086/&lt;/a&gt;\n\nRuntime: 188 min.\n\nAudio: English\nSubs : English, Spanish, French.\n\nPharaoh Ramses decrees the death of all Hebrew children, but Moses, placed in a basket in the Nile by his mother, is taken by a royal princess and raised as the brother of the heir to the throne of Egypt, Memefta. Moses is called by God to lead his people from Egypt to the promised land. A very reluctant prophet, feeling unworthy of the call, Moses accepts the task. After a series of plagues Memefta agrees to let the Hebrews go. With second thoughts, he pursues them to annihilation of his army in the parting of the Red Sea. Starvation is averted by manna from heaven, the ten commandments are given the people through Moses, they go astray with worship of the golden calf. Forty years of wandering in the wilderness, until finally they reach what will be their home (which Moses lives to see but not to enter).\n\n\n\n\n- Samson and Delilah DVD\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0117547/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0117547/&lt;/a&gt;\n\nRuntime: 172 min.\n\nAudio: English\nSubs : English, French, Spanish\n\n\nDennis Hopper and Diana Rigg star as the biblical Samson and his nefarious lady-in-waiting, Delilah, in this retelling of the age-old story. Gifted with enormous strengths that also leave him vulnerable to the selfishness of others, Samson soon learns what kind of person Delilah truly is. He must prove himself a hero during his darkest hours by avoiding Delilah&amp;#039;s wily ways once and for all and staying true to his God-fearing spirit.\n\n\n\n\n\n\n- Secrets of the Bible Code Revealed DivX\n\nRuntime: 90 minutes\n\nAudio: English\nSubs : none\n\n\nThe encrypted text within the Hebrew Bible has correctly predicted much of history. Can we believe its future prophecies? This two-disc set explores the mystery of the Bible Code, one of the most incredible discoveries of the 20th century. The compelling, thorough documentary covers the events that led to the computer-fueled discovery, the scientific evidence that supports the Bible Code and the significance of these fascinating findings.\n\n\n\n- Secrets of the Bible Code Revealed DVD\n\nRuntime: 90 minutes\n\nAudio: English\nSubs : none\n\n\nThe encrypted text within the Hebrew Bible has correctly predicted much of history. Can we believe its future prophecies? This two-disc set explores the mystery of the Bible Code, one of the most incredible discoveries of the 20th century. The compelling, thorough documentary covers the events that led to the computer-fueled discovery, the scientific evidence that supports the Bible Code and the significance of these fascinating findings.\n\n\n\n- Solomon DVD\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0143889/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0143889/&lt;/a&gt;\n\nRuntime: 172 minutes\n\nAudio: English\nSubs : English, Spanish\n\n\n\nSolomon is the tale of the king of Israel who rules his land with love, peace, and respect. When he meets the Queen of Sheba, her beauty and charm immediately smite him, and he falls hopelessly in love. Against his wishes and desires, she must return to her homeland, leaving the King in a state of deep depression, inevitably leading his kingdom to the verge of collapse.\n\nEnjoy The Movie :-)\n\n\n\n- The Jesus Film (1979) DVD\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0079368/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0079368/&lt;/a&gt;\n\nRuntime: 120 minutes\n\nAudio:\nEnglish, Spanish, French, Portuguese, Mandarin, Japanese, Korean, Arabic\n\nSubtitles:\nEnglish, Spanish, French, Portuguese, Arabic\n\nTouted as the most historically accurate depiction of the life of Jesus, this film, shot in the Holy Land, has been translated into more than 800 languages and has been seen by more than 4.7 billion people in 236 nations. The screenplay comes directly from the Gospel of Luke -- virtually every word spoken by Jesus was drawn from the biblical text. Extensive research also went into the production&amp;#039;s design to achieve historical authenticity.\n\n\n\n\n\n- Twilight Zone (1962-1-5) Nothing In the Dark DivX\n\nTwilight Zone - Nothing In The Dark\nSeason 3, Episode 16\nFirst aired: January 5, 1962\n\nwritten by George Clayton Johnson, offers Gladys Cooper as Wanda Dunn as an old woman who has barricaded herself in her basement apartment for years, fearing that Mr. Death with kill her with a touch.\n\n\nThis Torrent Dedicated to\nJ.R.T.\nS.D.D.\na friend\nand all whom need it.\n\n\n\n- Unlocking the Mystery of Life DVD\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0459139/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0459139/&lt;/a&gt;\n\n Is life on Earth the product of purely undirected processes like time, chance and natural selection? Or, can the origin and diversity of living organisms be traced to an intelligent cause? Unlocking the Mystery of Life explores these timeless questions and presents compelling evidence to support an idea that could revolutionize scientific thought - the theory of intelligent design.\n\n\n\n\n","torrent":{"xt":"urn:btih:a7944d714880659136a33cb4aa60996686ff868d","amp;dn":"Assorted+bible+movie+torrents+4+-+Christian","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7944d714880659136a33cb4aa60996686ff868d","infoHashBuffer":{"type":"Buffer","data":[167,148,77,113,72,128,101,145,54,163,60,180,170,96,153,102,134,255,134,141]},"announce":[],"urlList":[]}}