{"title":"Greg Trooper 7 album","uid":4682934,"size":339595344,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a815009f510ec85aaed77f7c80f88cf2c52da8e1&amp;dn=Greg+Trooper+7+album&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"giampa56","files":-1,"time":1233137699,"description":"Rarely has there been a more aptly named singer/songwriter than Greg Trooper. Over three decades, the New Jersey native has soldiered on through the victories and setbacks unique to a career dedicated to music, proving through gestures large and small that he's one of our best. It's evident in the company he keeps, the critics who praise his recordings, the fans who invest in his shows and the artists who learn his songs, wishing they'd written them. It is most evident in what Amazon.com calls his &quot;catalog of superbly crafted albums.&quot; This impressive discography testifies for an artist who has always served the song and the music above all other things. \n\nRaised in the shore town of Little Silver, NJ Trooper became enthralled by the greater New York area's rich music scene. He discovered a sort of holy musical trinity in the work of Otis Redding, Bob Dylan, and Hank Williams, with their guiding lights of passion, literary dexterity and plainspoken honesty. It's one reason Trooper's music feels equally informed by Memphis soul, Greenwich Village folk and Nashville twang. \n\nTrooper has made an impact on the music scenes in all the places he's lived since leaving home after high school: Austin, Texas, Lawrence, Kansas, New York and Nashville. His albums have demonstrated creative vision as well as a collaborator's heart. Americana star Buddy Miller produced 1998's 'Popular Demons' album, while soul legend Dan Penn steered 2005's extraordinary 'Make It Through This World'. In the studio and on the road, Trooper's colleagues have come from roots music's most rarified circles: Larry Campbell (Dylan), Garry Tallent (Bruce Springsteen), Kenneth Blevins (John Hiatt), as well as headliners like Maura O'Connell and Bill Lloyd. His songs have been recorded by Vince Gill, Steve Earle, Billy Bragg and Robert Earl Keen, among others. \n\nIn a review of his live album 'Between A House And A Hard Place', music critic Barry Mazor said that Trooper &quot;sings with a clarity of purpose and a variety of effect that few in the acoustic world match.&quot; Billboard magazine has called him &quot;an artist of considerable insight and passion.&quot; Nashville music critic Robert K. Oermann has said Trooper's &quot;songs and delivery grab you by the throat.&quot; Fans know a voice of grit and experience signing songs in which they recognize themselves. They also know that come the proverbial hell or high water, Greg will still be forging forward, trooper that he is. \nCraig Havighurst\nfrom Official site Gregtrooper.com","torrent":{"xt":"urn:btih:a815009f510ec85aaed77f7c80f88cf2c52da8e1","amp;dn":"Greg+Trooper+7+album","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a815009f510ec85aaed77f7c80f88cf2c52da8e1","infoHashBuffer":{"type":"Buffer","data":[168,21,0,159,81,14,200,90,174,215,127,124,128,248,140,242,197,45,168,225]},"announce":[],"urlList":[]}}