{"title":"M.Gaweda - IX Zmiana [PL]","uid":12684730,"size":702166189,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a871d3cb3274834e7e3adcfba42425bd8ae72227&amp;dn=M.Gaweda+-+IX+Zmiana+%5BPL%5D+MP3%4080&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"everdarksoul","files":56,"time":1446585884,"description":"Audiobook PL - 54 części /   \r\nrozmiar: 669 MB / czas: 19:27:31\r\nczyta: Aleksander Pawlikowski\r\n\r\nSłużba. Honor. Koleżeństwo. Walka. Strach. Ale również śmierć...\r\nPowieść Marcina Gawędy prowadzi Czytelnika w najbardziej nieoczekiwane miejsca: poznajemy Afganistan - od podziemi po szczyty gór - a ludzkie emocje - od najbardziej szlachetnych po krańcowo destrukcyjne...\r\nW Afganistanie stacjonują zarówno doświadczeni żołnierze, jak i tacy, dla których walka w tym spalonym słońcem kraju, jest pierwszym doświadczeniem BOJOWYM - a przecież przyjechali tu, by zapewniać cywilom spokój i bezpieczeństwo...\r\n\r\nIX Zmiana w powieści Gawędy sama okazuje się celem ataku - a nowy komendant talibów za punkt honoru stawia sobie zabicie jak największej liczby Polaków. Do walki z nim, w polskich szeregach staną - m.in. znani już z &quot;Rebelii&quot; - major Paweł Kalicki i porucznik Tomasz Gazda, wspierani przez takie siły jak GROM, &quot;Nil&quot; czy Samodzielną Grupę Powietrzno-Szturmową.\r\nPrzyjdzie im walczyć nie tylko z rebeliantami, ale i z nieufnością Afgańczyków. Pomocna może okazać się w tym &quot;strategia plam oleju&quot; - choć pod gradem kul nieprzyjaciela niełatwo będzie ją wprowadzać...\r\nNowa strategia, to nowi ludzie - tacy jak np. antropolog, który w patrolu może okazać się bardzo pomocny. Gorzej tylko, gdy jest nim... kobieta.\r\nJak przełamać stereotypy, jeśli inny sposób popatrzenia na ten kraj - to jedyna szansa na ocalenie?\r\n_______________________________________________________\r\n\r\n&quot;... To nie jest kronika prawdziwej IX zmiany Polskiego Kontyngentu Wojskowego w Afganistanie. To powieść osadzona w realiach surowej krainy u podnóża Hindukuszu. Ale choć fabuła jest fikcyjna, w wielu miejscach nie mogłem oprzeć się wrażeniu, że autor opisuje rzeczywiste wydarzenia. Czyniąc to na tyle sugestywnie, że co rusz nawiedzały mnie afgańskie widoki, zapachy, odgłosy. I tamtejszy niepokój, związany z oczekiwaniem na wybuch IED. Gorąco polecam - kawał solidnej, pisarskiej roboty...&quot;\r\n- Marcin Ogdowski, dziennikarz, autor blogu i książki &quot;zAfganistanu.pl&quot;","torrent":{"xt":"urn:btih:a871d3cb3274834e7e3adcfba42425bd8ae72227","amp;dn":"M.Gaweda+-+IX+Zmiana+%5BPL%5D+MP3%4080","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a871d3cb3274834e7e3adcfba42425bd8ae72227","infoHashBuffer":{"type":"Buffer","data":[168,113,211,203,50,116,131,78,126,58,220,251,164,36,37,189,138,231,34,39]},"announce":[],"urlList":[]}}