{"title":"Trilogia Piratas del Caribe HD Rip","uid":5340604,"size":3850537854,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:a8b00354dd5ef79438a0d223c4ce317b625c9cc2&amp;dn=Trilogia+Piratas+del+Caribe+HD+Rip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"litev","files":3,"time":1265476096,"description":"La trilogia de piratas del caribe incluye las tres peliculas en calidad HDRIP y sonido en castellano.\n\ny las peliculas son:\n\n\n\nPiratas del Caribe: La maldiciÃƒÂ³n de la perla negra:\n\nSinopsis\n\nLa idÃƒÂ­lica vida del pÃƒÂ­caro pero irresistible CapitÃƒÂ¡n Jack Sparrow (Johnny Depp) da un vuelco cuando su enemigo, el\ncapitÃƒÂ¡n Barbossa (Geofrey Rush), le roba su barco, la Perla Negra y ataca la ciudad de Port Royal secuestrando a\nElizabeth Swann (Keira Knightley) la hermosa hija del Gobernador. Will Turner (Orlando Bloom), el amigo de la infancia\nde Elizabeth decide unirse a Jack, en un acto de galanterÃƒÂ­a para rescatar a la chica y de paso recuperar la Perla\nNegra. Lo que Will no sabe es que la maldiciÃƒÂ³n de un tesoro ha condenado a Barbossa y a su tripulaciÃƒÂ³n a convertirse\neternamente en esqueletos vivientes. Will debe descubrir la clave que rompa con el maleficio para recuperar el\nmagnÃƒÂ­fico tesoro.\n\n\n\nPiratas del Caribe 2: El cofre del hombre muerto\n\nSinopsis\n\nEl capitÃƒÂ¡n Jack Sparrow deberÃƒÂ¡ resolver la deuda de sangre que tiene con Davy Jones, el legendario capitÃƒÂ¡n del barco\nfantasma, Flying Dutchman. Si no consigue salir del problema estarÃƒÂ¡ condenado por toda la eternidad. Sus problemas se\nentrometerÃƒÂ¡n en los de boda de Will Turner y Elisabeth Swann.\n\n\n\nPiratas del Caribe 3: En el fin del mundo\n\nSinopsis\n\nJusto cuando mÃƒÂ¡s se le necesita, el CapitÃƒÂ¡n Jack Sparrow (Johnny Depp), ese pirata con un encanto pÃƒÂ­caro y astuto,\nqueda atrapado en un mar de arena en los dominios de Davy Jones. En una alianza cada vez mÃƒÂ¡s tambaleante, Will Turner\n(Orlando Bloom), Elizabeth Swann (Keira Knightley) y el CapitÃƒÂ¡n Barbossa (Geoffrey Rush) inician una desesperada\nbÃƒÂºsqueda para encontrarle y rescatarle. El CapitÃƒÂ¡n Jack es el ÃƒÂºltimo de los nueve SeÃƒÂ±ores de la PiraterÃƒÂ­a de la\nCorte de Brethren, que deben reunirse en un ÃƒÂºltimo encuentro para preservar el estilo de vida de los piratas, amantes\nde la libertad. Desde el exÃƒÂ³tico Singapur, hasta mÃƒÂ¡s allÃƒÂ¡ del fin del mundo, desde la Isla de Shipwreck, hasta una\nbatalla titÃƒÂ¡nica, esta aventura estÃƒÂ¡ repleta de acciÃƒÂ³n, humor irreverente, magia y mitos del mar. Todo eso se\nconvierte en una retorcida, complicada y salvaje historia en este ÃƒÂºltimo capÃƒÂ­tulo de la trilogÃƒÂ­a de Piratas del\nCaribe.","torrent":{"xt":"urn:btih:a8b00354dd5ef79438a0d223c4ce317b625c9cc2","amp;dn":"Trilogia+Piratas+del+Caribe+HD+Rip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a8b00354dd5ef79438a0d223c4ce317b625c9cc2","infoHashBuffer":{"type":"Buffer","data":[168,176,3,84,221,94,247,148,56,160,210,35,196,206,49,123,98,92,156,194]},"announce":[],"urlList":[]}}