{"title":"Avatar.2009.iTALiAN.MD.TS.XviD-PiX4R[bt-italiantorrent.org]","uid":5283515,"size":1467152384,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a96cbd712bf72e5a08097d74f90449a98d83de21&amp;dn=Avatar.2009.iTALiAN.MD.TS.XviD-PiX4R%5Bbt-italiantorrent.org%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bt-italiantorrent","files":2,"time":1263637645,"description":"BT-ITALIANTORRENT.ORG PRESENT REGISTRATEVI DA NOI PER SCARICARE VELOCE\n\nAvatar.2009.iTALiAN.MD.TS.XviD-PiX4R\n\n\nTitolo originale: Avatar\nNazione: U.S.A.\nAnno: 2009\nGenere: Azione, Fantascienza, Thriller\nDurata: 166'\nRegia: James Cameron\nSito ufficiale: www.avatarmovie.com\nSito italiano: www.avatarilfilm.it\n\n\nCast: Sam Worthington, Zoe Saldana, Laz Alonso, Sigourney Weaver, Michael Biehn, Wes Studi, Joel Moore, CCH Pounder\nProduzione: Twentieth Century-Fox Film Corporation, Giant Studios Inc., Lightstorm Entertainment\nDistribuzione: 20th Century-Fox\nData di uscita: 15 Gennaio 2010 (cinema)\n\nTrama:\nJake Sully, ÃƒÂ© un ex marine costretto a vivere su una sedia a rotelle. Nonostante la disabilitÃƒÂ  fisica, nel cuore Jake ÃƒÂ¨ rimasto un combattente. Viene arruolato e, dopo un viaggio di alcuni anni luce, raggiunge l'avamposto degli umani su Pandora, dove un consorzio di aziende ÃƒÂ¨ impegnato nell'estrazione di un raro minerale, indispensabile per risolvere la crisi energetica sulla Terra. PoichÃƒÂ© l'atmosfera di Pandora ÃƒÂ¨ tossica, ÃƒÂ¨ stato sviluppato il Programma Avatar, che permette di collegare la coscienza umana a un avatar, cioÃƒÂ¨ un corpo biologico guidato a distanza, in grado di sopravvivere all'atmosfera letale del pianeta. Questi avatar sono ibridi geneticamente modificati in cui il DNA umano ÃƒÂ¨ stato mescolato con quello della popolazione indigena di Pandora... i Na'vi. Rinato nel corpo di un avatar, Jake puÃƒÂ² camminare di nuovo e dare inizio alla missione che gli ÃƒÂ¨ stata assegnata: infiltrarsi nel mondo dei Na'vi, che sono diventati un serio ostacolo per le attivitÃƒÂ  estrattive del prezioso minerale. Ma una bellissima donna Na'vi, Neytiri, gli salva la vita e questo cambia tutto. Jake viene accolto nel suo Clan e impara ad essere uno di loro, dopo avere superato molte prove e vicissitudini. Man mano che il rapporto tra Jake e la riluttante insegnante Neytiri si approfondisce, l'uomo impara a rispettare i Na'vi e il mondo in cui vivono e, alla fine, si schiera dalla loro parte. Presto Jake dovrÃƒÂ  affrontare la prova finale, guidando i Na'vi in una battaglia epica che deciderÃƒÂ  il destino di un mondo intero.","torrent":{"xt":"urn:btih:a96cbd712bf72e5a08097d74f90449a98d83de21","amp;dn":"Avatar.2009.iTALiAN.MD.TS.XviD-PiX4R%5Bbt-italiantorrent.org%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a96cbd712bf72e5a08097d74f90449a98d83de21","infoHashBuffer":{"type":"Buffer","data":[169,108,189,113,43,247,46,90,8,9,125,116,249,4,73,169,141,131,222,33]},"announce":[],"urlList":[]}}