{"title":"Computer Games and Software Engineering - 1st Ed (2015) Gooner","uid":12328888,"size":26872557,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ab3213585bfbe6924063ccc25f175d9d8debc19c&amp;dn=Computer+Games+and+Software+Engineering+-+1st+Ed+%282015%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1441147699,"description":"Publisher: Chapman and Hall/CRC; 1 edition (May 8, 2015)\nLanguage: English\nISBN-10: 1482226685\nISBN-13: 978-1482226683\n\nComputer games represent a significant software application domain for innovative research in software engineering techniques and technologies. Game developers, whether focusing on entertainment-market opportunities or game-based applications in non-entertainment domains, thus share a common interest with software engineers and developers on how to best engineer game software.\n\nFeaturing contributions from leading experts in software engineering, the book provides a comprehensive introduction to computer game software development that includes its history as well as emerging research on the interaction between these two traditionally distinct fields.\n\nAn ideal reference for software engineers, developers, and researchers, this book explores game programming and development from a software engineering perspective. It introduces the latest research in computer game software engineering (CGSE) and covers topics such as HALO (Highly Addictive, sociaLly Optimized) software engineering, multi-player outdoor smartphone games, gamifying sports software, and artificial intelligence in games.\n\nThe book explores the use of games in software engineering education extensively. It also covers game software requirements engineering, game software architecture and design approaches, game software testing and usability assessment, game development frameworks and reusability techniques, and game scalability infrastructure, including support for mobile devices and web-based services","torrent":{"xt":"urn:btih:ab3213585bfbe6924063ccc25f175d9d8debc19c","amp;dn":"Computer+Games+and+Software+Engineering+-+1st+Ed+%282015%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab3213585bfbe6924063ccc25f175d9d8debc19c","infoHashBuffer":{"type":"Buffer","data":[171,50,19,88,91,251,230,146,64,99,204,194,95,23,93,157,141,235,193,156]},"announce":[],"urlList":[]}}