{"title":"Jerry Lee Lewis - Mean Old Man 2010 (flac)","uid":6438332,"size":398238528,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ac2f44a7bf56bd0e387be5c6617699771b0d84ef&amp;dn=Jerry+Lee+Lewis+-+Mean+Old+Man+2010+%28flac%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"barber9","files":-1,"time":1306874489,"description":"It is hard to think of another artist who could bring together so many collaborators from disparate corners of the music world as those who turn up on the Killers latest outing, which include Mick Jagger, Keith Richards and Ron Wood (on separate tracks, natch), Tim McGraw, Sheryl Crow, Gillian Welch, Solomon Burke, Willie Nelson, Robbie Robertson and Jon Brion. But the Muhammads of pop music apparently are only too happy to come to the mountain that is Jerry Lee Lewis, who turned 75 and demonstrates that he is still eminently capable of pumping those 88 black and white keys.\n\nIt is a similar route to the one he took in 2006 with Last Man Standing, that one focusing on his stature as one of the founding fathers of rock &amp; roll, this one emphasizing his second career in the late 60s and 70s as a master of country music.\nHe reprises a couple of his key hits from that period, Rockin My Life Away (aided by Kid Rock and Slash) and Sonny Throckmortons anguished Middle Age Crazy (with McGraw and Brion) and puts his indelible stamp on the title track, written for him by Kris Kristofferson.\nCreedence Clearwaters Bad Moon Rising is one of the few missteps. Fogerty is underutilized simply offering harmonies, and in a key that is too low to show Lewis voice at its best.\nConversely, the pairing of Lewis and Richards is a made-in-heaven meeting of two of rocks most surprising survivors for a wonderfully woozy slide through the Stones Sweet Virginia, which Richards says he originally wrote with Lewis in mind.\n\nMultimillionaire Steve Bing, who has championed the latter-day resuscitation of Lewis career with Shangri-La Music, has said he simply wants to get as much of the Killer on record as he can while he is still playing and sounding this vibrant. May the digital memory continue to roll.    (Randy Lewis)\n\n\n\n 1. Mean Old Man (with Ronnie Wood)\n 2. Rockin' My Life Away (with Kid Rock &amp; Slash)\n 3. Dead Flowers (with Mick Jagger)\n 4. Middle Age Crazy (with Tim McGraw &amp; Jon Brion)\n 5. You Can Have Her (with Eric Clapton &amp; James Burton)\n 6. You Are My Sunshine (with Sheryl Crow &amp; Jon Brion)\n 7. Hold You In My Heart (with Shelby Lynne)\n 8. Swinging Doors (with Merle Haggard)\n 9. Roll Over Beethoven (with Ringo Starr, John Mayer &amp; Jon Brion)\n10. Sweet Virginia (with Keith Richards)\n11. Railroad to Heaven (with Solomon Burke)\n12. Bad Moon Rising (with John Fogerty)\n13. Please Release Me (with Gillian Welch)\n14. Whiskey River (with Willie Nelson)\n15. I Really Don't Want To Know (with Gillian Welch)\n16. Sunday Morning Coming Down\n17. Will The Circle Be Unbroken (with Mavis Staples, Robbie Robertson \n    &amp; Nils Lofgren)\n18. Miss The Mississippi and You\n","torrent":{"xt":"urn:btih:ac2f44a7bf56bd0e387be5c6617699771b0d84ef","amp;dn":"Jerry+Lee+Lewis+-+Mean+Old+Man+2010+%28flac%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac2f44a7bf56bd0e387be5c6617699771b0d84ef","infoHashBuffer":{"type":"Buffer","data":[172,47,68,167,191,86,189,14,56,123,229,198,97,118,153,119,27,13,132,239]},"announce":[],"urlList":[]}}