{"title":"Preben Torntoft","uid":4800188,"size":123062097,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ac3853191bb7e02b9161919bedf9051bdfd6e60c&amp;dn=Preben+Torntoft&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Boychoir","files":23,"time":1238013508,"description":"Preben Torntoft became a student of the renowned music teacher Jette Tikjob and of Hans Erik Knudsen at the Arhus Folk Music School at the age of 12; Knudsen was to be his instructor and accompanist for his entire career as a boy singer. With his obvious vocal gift Preben quickly became a soloist with the Music School's mixed children's choir and also in the school's &quot;opera chorus&quot; class, which under the direction of Jette Tikjob for a number of years produced a series of broadcast opera programmes for and by children. It was on the strength of these radio programmes the Preben Torntoft's name came to be known in Copenhagen.\n\nThe writer and broadcaster Karl Bjarnhof was so taken by the character in this beautiful, bright voice that he in 1951 set up a contact to the record company Tono, and during the course of the following two years Preben recording a total of ten 78 r.p.m. records, primarily of Danish songs. During the same period he criss-crossed the country performing at arrangements ranging from church concerts to country fairs.\n\nThroughout the recorded repertoire the listener rejoices at the young artist's sense of sonority and musical expression. But it is the Danish songs in particular, many of them part of the national heritage, that afford the listener the biggest surprise. The interpretations are characteristic for their simplicity and purity of expression, so often lacking in grown-up professional singers, but most fascinating of all is the instinctive, perfectly natural technique with which the songs are delivered. The technique relies on a quite immediate voice production, which subconsciously allows the text to become one with the musical idea. The actual singing is thus throughout the repertoire marked by an exemplary enunciation of text and crystal clear intonation - characteristics many trained singers must envy him.\n\nIn 1953 Preben's voice broke and his brief career was brought to a close. Preben Torntoft later become M.A. in history and English and is now a high school teacher in Arhus. But he has not as an adult forgotten his love for singing: many are those who over the years have delighted in his fine tenor, both when he has performed solo and in choir. He remains the pride of any tenor section and indeed works as an assistant with the chorus of the National opera in Arhus. \n\nThis Torrent contains the album\n\nDanske Sange,recordings from 1951-1953\n\n\n\n&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;ddaeaab8afb4b6ec9dbbbcaea9b0bcb4b1f3bbb0&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n","torrent":{"xt":"urn:btih:ac3853191bb7e02b9161919bedf9051bdfd6e60c","amp;dn":"Preben+Torntoft","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac3853191bb7e02b9161919bedf9051bdfd6e60c","infoHashBuffer":{"type":"Buffer","data":[172,56,83,25,27,183,224,43,145,97,145,155,237,249,5,27,223,214,230,12]},"announce":[],"urlList":[]}}