{"title":"PhotoEQ v.1.7.0.0 Incl.Patch-URET [deepstatus]","uid":12200893,"size":21958553,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ac629457c5f4bc92d42ec409a59e402b59a197b5&amp;dn=PhotoEQ+v.1.7.0.0+Incl.Patch-URET+%5Bdeepstatus%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"deepstatus","files":1,"time":1438827491,"description":"PhotoEQ v1.7.0 (C) SoftColor\n\nÂ° SoftColor PhotoEQ make fixing common image problems quick and easy. It\nÂ° has an extremely easy to use interface and support for batch processing.\nÂ° With PhotoEQ you can complete your daily image editing and color\nÂ° management tasks fast and easily.\n\n\n\n\n\nSupported Digital Image and RAW Formats\n\nJPEG ,JPEG2000, TIFF, PSD, PNG, BMP,PGM, PPM, JPEG XR\n\n\nRAW Formats:\n\n.dng, .crw, .cr2, .mrw, .nef, .raf, .orf, .pef, .srf, .arw\n\n\nSupport for following JPEG color spaces:\n\nRGB, GrayScale, YCbCr, CMYK, YCbCrK\n\n\nSupport for following TIFF types:\n\nTIFF (rev.6.0 and Tech.Note #2, Packbits, JPEG, LZW, CCITT G.3 and G.4, ZIP) with RGB, CMYK, B/W, CIELab\n\nPhotoEQ manages embedded EXIF, IPTC and XMP meta-data.\n\n\nSupported Digital Image Formats for Output\n\nJPEG, TIFF, PNG, PSD, BMP\n\nPSD files are saved with two layers\n[Original Image / Improved Image]\n\n\nSupport for following JPEG color spaces:\n\nRGB, GrayScale, YCbCr, CMYK, YCbCrK\n\nSupport for following TIFF types:\n\nTIFF (6.0, Packbits, JPEG, LZW, CCITT G.3 and G.4, ZIP) with RGB, CMYK, B/W, CIELab\n\nEmbedded EXIF, IPTC and XMP meta-data is transferred between input and output images if output image format has support for embedded metadata.\n\n\nImage Processing Tools (SoftColor Engine V4)\n\nPhotoEQ has three type of image processing tools.\n\nColor correction which adjust white balance, exposure and contrast settings automatically or manually.\nImage editing by resizing, cropping, rotating, straightening and red-eye fixing.\nImage enhancement by sharpening and de-noising filters.\n\n\nColor Correction\n\nPhotoEQ's automatic color correction algorithm corrects color balance, exposure and contrast problems from original image in single step. White balance, exposure and contrast adjustments are processed as separate layers. This gives full control to fine tune automatic correction intensity and other color correction adjustments.\n\nColorEQ, to adjust white balance.\nNon-linear Exposure\nNon-linear Contrast\nAdjust color correction intensity. This intensity value adjusts how much pixel color values of edited image are mixed with original image after white balance, exposure and contrast correction.\n\n\nImage Editing\n\nPhotoEQ has tools and filters for resizing, cropping, rotating, straightening, sharping, de- noising and red-eye fixing the original image. Image editing in PhotoEQ is non-destructive and layer based operation. Image editing tools and filters can be used together with PhotoEQ's color correction or separately.\n\nPhotoEQ's sharpening tool has two method to adjust sharpness of the edited image:\n\nAutomatic sharpening filter which enhances image by increasing the sharpness of detected objects contours.\nTraditional unsharp masking filter which increases the contrast of the edges between pixels of different colors in an image.\n\nPhotoEQ has automatic noise removing filter and blur filter to remove unwanted noise from edited image. Blur filter performs gaussian blur filtering.\n\n\nColor Management:\n\nPhotoEQ has support for standard ICC profile based color management and loading and saving embedded ICC profiles. PhotoEQ can convert and render between different color spaces, for example conversion from RGB to CMYK. Color management uses 32 bits precision for processing and support v4 and v2 profiles. Rendering intents:\n\nPERCEPTUAL\nRELATIVE COLORIMETRIC\nABSOLUTE COLORIMETRIC\nSATURATION\n\nBlackpoint compensation: [ON/OFF]\n\n\nBatch Processing:\n\nPhotoEQ has todo queue for collecting multiple images to one by one processing or for automatic batch processing. After selecting suitable image processing adjustments and output settings for one image file, automatic batch processing will use same settings to process other images from todo queue.\n\nBatch save operation uses current tools adjustments for processing images. Batch processed images are saved by using current output format and folder settings. Saved files are named with _sc prefix.\n\n\n\n\n\nSystem Requirements\n\nWindows XP, Windows Vista, Windows 7, Windows 8\n\n1GHz Intel or AMD processor\n1Gb of RAM\nScreen resolution of 1024x768 or greater\n42 Mb of disc space\n\nPhotoEQ works on 32bit and 64bit Windows.\n\nReady for Windows 10\n\nWith latest versions PhotoEQ (v.1.7) are ready for Windows 10.\n\nPhotoEQ update (v.1.7 - Jul 31 2015)\n\n\n\nInstallation:\n&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;\n\nJust unpack &amp; install.\n\nCopy the patch in installed program dir and apply it","torrent":{"xt":"urn:btih:ac629457c5f4bc92d42ec409a59e402b59a197b5","amp;dn":"PhotoEQ+v.1.7.0.0+Incl.Patch-URET+%5Bdeepstatus%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac629457c5f4bc92d42ec409a59e402b59a197b5","infoHashBuffer":{"type":"Buffer","data":[172,98,148,87,197,244,188,146,212,46,196,9,165,158,64,43,89,161,151,181]},"announce":[],"urlList":[]}}