{"title":"The Court &amp; Spark - Witch Season [2004][EAC,log,cue. FLAC]","uid":8978100,"size":267136869,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ad833797b9435382e31cb4b2aa4fd77f1d96f4dc&amp;dn=The+Court+%26amp%3B+Spark+-+Witch+Season+%5B2004%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":16,"time":1380491707,"description":"Artist: The Court &amp; Spark\nRelease: Witch Season\nReleased: 2004\nLabel: Absolutely Kosher Records \nCatalog#: AK040\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: USA\nStyle: Rock\n\n1. Suffolk Down Upon the Night\n2. Out on the Water\n3. Denver Annie\n4. Steeplechasing\n5. Sundowner, You\n6. St. John the Evangelist\n7. Witch Season\n8. Wandering Tattler, The\n9. With the Horseshoe King\n10. Hallelujah I\n11. Swimming Endlessly\n12. Titov Sang the Blues\n\nBy tightening up some of the watery qualities that superbly defined the sound of their 2001 full-length Bless You, the Court &amp; Spark immediately open up some space for new textures to lead off their third and most enriched long-player yet, Witch Season. The band has always had an experimental edge and their trials have always worn the tags of meticulousness necessary to keep the meat of the songs in context, but the flag the Court &amp; Spark have unfurled in the mighty and complex opening track eclipses any benchmark in the band's previous history. Titled &quot;Suffolk Down Upon the Night,&quot; the song drunkenly staggers through a heavily treated opening, but only for a few seconds, before a horn section augmented by bells, pedal steel, and the rest of the band kicks the album off into sultry momentum. Co-producer and regular collaborator Scott Solter brought a little bit of crispness from M.C. Taylor's voice this time around that, combined with the slight elevation in Taylor's forcefulness, lifts it more to the surface than on previous recordings without managing to sacrifice the warmth that makes Taylor's voice so comfortable and unique. Soulter also brought his penchant for field recordings and tape manipulations to the table, an idea likely inspired by the 2001 collaboration between him and Taylor called Boxharp. As noted, the content of Witch Season is complex, but it should be stated that it is still very accessible, especially on songs like the exuberant and poppy &quot;Out on the Water,&quot; another song adorned with horns, and the lovely title track, which like the majority of the tracks, features Tom Heyman's pedal steel to fantastic effect. With Witch Season being their second exceptional LP, the Court &amp; Spark should have no problems convincing any skeptics that they are an extremely thoughtful band worthy of considerable attention.\n","torrent":{"xt":"urn:btih:ad833797b9435382e31cb4b2aa4fd77f1d96f4dc","amp;dn":"The+Court+%26amp%3B+Spark+-+Witch+Season+%5B2004%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad833797b9435382e31cb4b2aa4fd77f1d96f4dc","infoHashBuffer":{"type":"Buffer","data":[173,131,55,151,185,67,83,130,227,28,180,178,170,79,215,127,29,150,244,220]},"announce":[],"urlList":[]}}