{"title":"Chrono Crusade","uid":9998265,"size":2311402920,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:aed77693823f2c0e52b734b25b6ad6c10bd55216&amp;dn=Chrono+Crusade+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"procreated666","files":25,"time":1397946051,"description":"The 1920s were well known as a period of excitement and change. It was a time where the women were fast and loose, and the booze flowed freely, in spite of prohibition laws. But the elite of society has found a new form of excess: conjuring devils. By 1928, things were getting out of hand.\n\nA special organization called the Order of Magdalene was created centuries ago to deal with this kind of threat. Headed by Father Remington and Sister Kate, these young men and women were equipped with heavy duty weapons to perform God's good will.\n\nOne of the more infamous members of this group is Sister Rosette. Her fame is not necessarily positive. In fact, Sister Kate thinks she is nothing more than a menace to society, because whenever Rosette is on a case, things tend to explode. It also does not help that Rosette's partner is one of the very things they fight against, a very powerful devil named Chrono. Bound to Rosette by a mystical amulet, Chrono may be under control, but that does not make him any less dangerous.\n\nWhile Rosette and Chrono fight for the Magdalene Order, something is stirring in the background. An evil, more powerful than Chrono, is waiting in the shadows, ready to destroy not only the Order, but all of creation!","torrent":{"xt":"urn:btih:aed77693823f2c0e52b734b25b6ad6c10bd55216","amp;dn":"Chrono+Crusade+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aed77693823f2c0e52b734b25b6ad6c10bd55216","infoHashBuffer":{"type":"Buffer","data":[174,215,118,147,130,63,44,14,82,183,52,178,91,106,214,193,11,213,82,22]},"announce":[],"urlList":[]}}