{"title":"Rebel Ridge Series by Shareon Sala 1 and 3 [ePub] - [HTD]","uid":14101693,"size":684488,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:af151b31a4620d56f70b594e9f9de613298e3e78&amp;dn=Rebel+Ridge+Series+by+Shareon+Sala+1+and+3+%5BePub%5D+-+%5BHTD%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Supernova","files":2,"time":1459322367,"description":"http://boltimg.com/image/pwVC\r\n\r\n1. Next of Kin - Beth Venable has seen too much... Witness to a major mob hit, she's placed in protective custody until the trial. But after her third safe house is riddled with bullets, she goes off-grid to save herself. What the FBI can't do, her kinfolk will. The beautiful but forbidding Appalachian Mountains of Kentucky welcome Beth back, dirt roads and rustic shacks a world apart from L.A. But her homecoming - even her blissful reunion with strong, silent Ryal Walker - is made bittersweet by the fight she's brought to the clan's doorstep. Hidden in a remote cabin with the man she's always wanted, Beth begins to dream of a new life: her old one. But after so long, with such dangers stalking her... impossible. But love can distil life down to its essence: an elixir of pure hope, nerve, and the will to survive.\r\n \nhttp://boltimg.com/image/pgCp\r\n\r\n3. 'Til Death - He left in handcuffs. Now it's time to set himself free. Nearly twenty years after he was wrongly convicted of setting the fire that killed his father, Lincoln Fox returns to Rebel Ridge, Kentucky. There, deep in the Appalachians, the truth of that terrible night lies buried-and he's sworn to uncover it. \r\nHis plans take an unexpected turn when, in the midst of a blizzard, he rescues Meg Walker from her wrecked car. Suddenly Linc discovers another reason to clear his name. Meg, his high school sweetheart, had always believed in his innocence, and if he wants a future with her, he has to show the world proof that she was right. \r\nAs the community chooses sides, those who once let a teenage boy take the fall for their crime are forced to raise the stakes. They kidnap Meg, leaving her to the mercy of the mountain. And a second rescue may be more than even Linc can manage","torrent":{"xt":"urn:btih:af151b31a4620d56f70b594e9f9de613298e3e78","amp;dn":"Rebel+Ridge+Series+by+Shareon+Sala+1+and+3+%5BePub%5D+-+%5BHTD%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af151b31a4620d56f70b594e9f9de613298e3e78","infoHashBuffer":{"type":"Buffer","data":[175,21,27,49,164,98,13,86,247,11,89,78,159,157,230,19,41,142,62,120]},"announce":[],"urlList":[]}}