{"title":"MediaMan 3.10 Build 1106","uid":6428350,"size":14564304,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:afb06366a73444698dcde73e51a12715bf75cb83&amp;dn=MediaMan+3.10+Build+1106&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anacondaz","files":-1,"time":1306559636,"description":"MediaMan 3.10 Build 1106\n\nMediaMan is a general purpose collection organizer. It helps you quickly establish a digital database of your collection, and makes it easy to keep item tracked. It automatically retrieves item information from the web, and provides tags, folders, and editing capability so that you can further manipulate them and keep them organized. MediaMan can also associates files on your hard drive, plays music in background while organizing your collection, and creates beautiful exports or print-outs so that you can share with your friends.\n\nEstablish Collection Quickly and Easily\nMediaMan's revolutionary design of import procedure will greatly save you time when establishing the collection. You can choose to type-in keywords, or scan barcodes using your webcam to search for item information. Pictures and details are automatically retrieved and saved.\n\nYou can also drag and drop a folder into import panel, or click &quot;Scan a folder&quot; to let MediaMan search for information according to files on your hard drive. It'll even scan barcodes from picture files.\n\nTake Pain Out of Organizing\nRight click on any folders to create additional ones to organize items by nature. Drag and drop items to put them in separate folders. This could be the easiest way to get started, and keep your collection clean.\n\nWhen you are ready to classify items in detail, press Ctrl+3 to switch to tag mode. By editing items and assign tags to them, you can use natural words to describe a group of items by genre, subjects, keywords, or how much you liked them.\n\nYou can also try right clicking on items and use &quot;Quick Tag&quot; to assign tags, or drag items to tags to re-organize your collection in a snap.\n\nKeep Tracking of Rentals\nRented titles and lent ones can be marked by right clicking an item and assign a flag. A special tip will be rendered onto the item so that you can easily see them. If you enter a few details in flag dialog, you can further track these special items in flag mode (Ctrl+2) by contacts and dates.\n\nAnd More ...\nElastic user interface suitable for both high resolution TV and low resolution Netbooks\nOutstanding program performance and stability\nUnicode design to work with any language in your collection\nPowerful collection search tool\nExporting to navigable website\nSingle collection file design for easy transferring and backup\n\nHome Page - http://www.imediaman.com/\n\n","torrent":{"xt":"urn:btih:afb06366a73444698dcde73e51a12715bf75cb83","amp;dn":"MediaMan+3.10+Build+1106","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"afb06366a73444698dcde73e51a12715bf75cb83","infoHashBuffer":{"type":"Buffer","data":[175,176,99,102,167,52,68,105,141,205,231,62,81,161,39,21,191,117,203,131]},"announce":[],"urlList":[]}}