{"title":"John Sebastian &amp; David Grisman - 2007 - Satisfied (HDTracks ","uid":9224122,"size":1110615425,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b051b119ab8a6eced332e42f70cc90a6d4940cba&amp;dn=John+Sebastian+%26amp%3B+David+Grisman+-+2007+-+Satisfied+%28HDTracks+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"eika256","files":-1,"time":1384980419,"description":"John Sebastian &amp; David Grisman - 2007 - Satisfied\nHDTracks 24 bits, 96 KHz\n\nSince acoustic and roots music have always formed the base of their respective musics, it seems natural for John Sebastian and David Grisman to cut an album for Acoustic Disc (Grisman's label). The pairing is similar to that of Dylan and Happy Traum way back in 1971 for several nice acoustic duos at the end of Bob Dylan's Greatest Hits, Vol. 2. In both instances, one gains the impression of two friends jamming just for the fun of it, a back-porch authenticity re-created in the studio. The difference, however, says a thing or two about just what it means when friends get together and jam. On the Dylan/Traum sides, the overall quality is quite professional, especially when comparing their version of &quot;You Ain't Goin' Nowhere&quot; to the one recorded with the Band for The Basement Tapes. The newer version, then, may sound off-the-cuff, but Dylan and Traum have worked hard to create a spry, clean take. Sebastian and Grisman are also professional, though their performance level never reaches that of Dylan and Traum's. Sebastian is in good voice, and the acoustic interplay between his guitar and Grisman's mandolin is nice; furthermore, the whole affair is relaxed, much like Grisman's previous effort with John Hartford and Mike Seeger on Retrograss. As enjoyable as it is to listen to two old friends get together and jam, though, Satisfied is too laid-back, with a number of so-so songs mixed in with classics, and some songs overstay their welcome. The entire project would have been strengthened by a better batch of songs and tighter performances. Fans of Sebastian and Grisman will undoubtedly want to tune in to see what these two old pros have been up to, even if Satisfied does have the sound and feel of a home recording. (AllMusic)\n\nTrack list:\n01-Im Satisfied\n02-Strings Of Your Heart\n03-EMD\n04-Deep Purple\n05-John Henry\n06-Walk Right Back\n07-Passing Fantasy\n08-Coffee Blues\n09-Dawgs Waltz\n10-Lonely One In This Town\n11-Its Not Time Now\n12-Harmandola Blues\n13-Coconut Grove\n14-Jug Band Waltz\n\nPersonnel:\nJohn Sebastian - vocals, guitar, whistle, harmonica\nDavid Grisman - vocals, mandolin, mandola\n\nEnjoy and share!","torrent":{"xt":"urn:btih:b051b119ab8a6eced332e42f70cc90a6d4940cba","amp;dn":"John+Sebastian+%26amp%3B+David+Grisman+-+2007+-+Satisfied+%28HDTracks+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b051b119ab8a6eced332e42f70cc90a6d4940cba","infoHashBuffer":{"type":"Buffer","data":[176,81,177,25,171,138,110,206,211,50,228,47,112,204,144,166,212,148,12,186]},"announce":[],"urlList":[]}}