{"title":"Gordon Haskell - It Is And It Isn't (1971) [FLAC]","uid":6346936,"size":225054205,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b07b7614eb4304565488701d26c92e97a779185a&amp;dn=Gordon+Haskell+-+It+Is+And+It+Isn%5C%27t+%281971%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zibbik","files":22,"time":1303867542,"description":"\n\nArtist: Gordon Haskell\nTitle: It Is And It Isn't \nGenre: Progressive Folk Rock\nOrigin: UK\n\nGordon Haskell is usually thought of as a footnote in the history of King Crimson -- the only lead singer in the group's long list of personnel who never played a single live date with the band, though he was with them long enough to cut most of an album (Lizard) and get one performance (&quot;Cadence and Cascade&quot;) onto its predecessor. Otherwise, he's been an enigma even to many Crimson fans.\nHaskell's history with Robert Fripp goes back to the days they spent together in the mid-'60s as members of the League of Gentlemen, a band that backed various American R&amp;B stars on tour and cut a couple of singles. Haskell was also a member of a Liverpool band called the Quotations, formed by ex-Big Three bassist Johnny Gustafson (before he joined the Merseybeats), who recorded for English Decca (&quot;Alright Baby&quot; b/w &quot;Love You All Over Again&quot;) in 1964. His main group affiliation for most of the mid-'60s was the Fleur de Lys, a somewhat lightweight psychedelic band who recorded at least once under the pseudonym of Shyster. Haskell passed through the lineups of Rupert's People and Cupid's Inspiration, and, as a member of the Fleur de Lys, also played on records by Bill Kimber, John Bromley, Sharon Tandy, and Terry Durham. By the end of the '60s, he was a solo act, trying to establish himself as a singer/songwriter, and released a pair of singles in 1969 and 1970, &quot;Boat Trip&quot; and &quot;Oh-La-Di-Doo-Da-Day,&quot; and one LP, Sail in My Boat, all for British CBS.\nIn 1970, as his former League of Gentlemen bandmate Robert Fripp was struggling to keep his current group, King Crimson, viable in some form and complete a second album, Haskell joined the band as successor to bassist-singer Greg Lake, who was leaving the lineup to join Emerson, Lake &amp; Palmer. After singing on one song for that album, In the Wake of Poseidon, he joined a new Crimson lineup and recorded most of the next album, Lizard. As was often the case with Crimson lineups in those days, however, Haskell didn't last -- he and other members of the core band had left by the time Lizard was completed and released late in 1970, and he never worked live with the band.\nHaskell cut a solo album, It Is and It Isn't, during 1973 (actually the album was recorded circa 1971 but saw the limelight round 1973-74), and worked with such artists as Tim Hardin, Alvin Lee, and Van Morrison. His solo work tends to be in a folk-like, singer/songwriter vein, reminiscent of Gordon Lightfoot with something of a progressive rock edge and more humor, some of it very sardonic. Based in southern England at the end of the '90s, he concertizes regularly in the Hampshire and Dorset areas, and he has continued his recording career into the '90s with his albums Butterfly in China and Hambledon Hill. In 1993, he also teamed up with Mike Wedgewood (ex-Curved Air and Caravan) to tour Scandinavia. In the late '90s, Voiceprint Records' Blueprint label reissued Haskell's solo albums of the '60s and '70s on compact disc. The massively popular &quot;How Beautiful You Are&quot; hit British airwaves in the winter of 2001, announcing Haskell's comeback to music. Harry's Bar followed the next year, fully bringing him back into the public spotlight after years of inactivity.\n\nTracks:\n\n1. No Meaning - (3:31)\n2. Could Be - (3:18)\n3. Upside Down - (4:31)\n4. Just a Lovely Day - (3:59)\n5. Sitting by the Fire - (3:44)\n6. When I Lose - (0:26)\n7. No Need - (2:51)\n8. Worms - (4:46)\n9. Spider (Robert Smith, Gordon Haskell) - (4:19)\n10.Learning Not to Feel - (2:39)\n11.Benny - (4:49)\n12.When I Laugh - (0:24)\n\nMusicians\n\n*John Wetton - Organ, Bass, Keyboards, Vocals, Gut String Guitar, Vocal Harmony\n*Gordon Haskell - Guitar, Acoustic Guitar, Vocals\n*Bill Atkinson - Drums\n*Alan Barry - Guitar, Acoustic Guitar, Electric Guitar\n*David Brigati - Vocals\n*Eddie Brigati - Vocals\n*Dave Kaffinetti - Piano, Keyboards, Electric Piano\n*Arif Mardin - Keyboards, Electric Piano, Horn Arrangements, String Arrangements\n*Neal Rosengarden - Piano\n*David Spinozza - Guitar, Rhythm Guitar \n","torrent":{"xt":"urn:btih:b07b7614eb4304565488701d26c92e97a779185a","amp;dn":"Gordon+Haskell+-+It+Is+And+It+Isn%5C%27t+%281971%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b07b7614eb4304565488701d26c92e97a779185a","infoHashBuffer":{"type":"Buffer","data":[176,123,118,20,235,67,4,86,84,136,112,29,38,201,46,151,167,121,24,90]},"announce":[],"urlList":[]}}