{"title":"Storage Networks Explained","uid":4961208,"size":9696719,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b1370a3bb66c4d8623e39a461611793fa70a91c2&amp;dn=Storage+Networks+Explained&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"VasiaZozulia","files":-1,"time":1245320574,"description":"All you need to know about Storage Area Networks\n\nThe amount of data of an average company doubles every year. Thus, companies who own 1TB of data today will own 32TB in five years. Storage networks help to tame such data quantities and to manage this data growth efficiently. Since stored data and information are the biggest asset of any company, anyone who is involved in the planning or the operation of IT systems requires a basic knowledge of the principle and the use of storage networks.\n\nStorage Networks Explained covers the fundaments, techniques and functions of storage networks such as disk subsystems, Fibre Channel SAN, Internet SCSI (iSCSI), Fibre Channel over Ethernet (FCoE), Network Attached Storage (NAS), file systems, and storage virtualization. Furthermore the authors describe the use of these techniques and how they are designed to achieve high-availability, flexibility, and scalability of data and applications. Additional attention is given to network backup and the management of storage networks. Written by leading experts in the field, this book on storage area networks is updated and fully revised.\n\nKey features:\n\n*\nPresents the basic concepts of storage networks, such as I/O techniques, disk subsystems, virtualization, NAS and SAN file systems\n*\nCovers the design of storage networks which provide flexible, highly-available, and scaleable IT systems\n*\nExplains the use of storage networks for data sharing, data protection, and digital archiving\n*\nDiscusses management of storage networks using SNMP, SMI-S, and IEEE 1244\n\nThis book provides system administrators and system architects, as well as students and decision makers, with the tools needed for optimal selection and cost-effective use of storage networks. ","torrent":{"xt":"urn:btih:b1370a3bb66c4d8623e39a461611793fa70a91c2","amp;dn":"Storage+Networks+Explained","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1370a3bb66c4d8623e39a461611793fa70a91c2","infoHashBuffer":{"type":"Buffer","data":[177,55,10,59,182,108,77,134,35,227,154,70,22,17,121,63,167,10,145,194]},"announce":[],"urlList":[]}}