{"title":"The Floating City - His Majestys Sagbutts... (1997) [Philidor]","uid":15391671,"size":316142458,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:b186d446da7139c6cdf62bde0448546484516c28&amp;dn=The+Floating+City+-+His+Majestys+Sagbutts...+%281997%29+%5BPhilidor%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Philidor","files":17,"time":1469352413,"description":"From the liner notes:\r\n\r\n&quot;The name Castello was, and is still, common in Venice; indeed, there appears to have been a family of musicians who served the Doge and other Venetian employers in the first half of the seventeenth century and perhaps earlier. Payment and census records, contracts and necrologies from the period refer to three Castello instrumentalists who were almost certainly related: Bartolomeo, Giovanni Francesco and Giovanni Battista. The last of these was engaged as a member of the Doge’s six-strong team of piffari, or wind players, from 27 December 1624 to 15 November 1633, noted in the San Marco archives as son of ‘Dario of Venice, musician in our aforementioned chapel’.\r\n\r\n&quot;Other biographical references to Dario Castello appear only in the title-pages and dedications of the composer’s two volumes of ‘Sonate concertate’, published in Venice respectively in 1621 and 1629. Several editions of Castello’s popular yet technically demanding and musically adventurous sonata anthologies were made, with Book I reprinted in Venice and Antwerp as late as 1658. Two editions of Book I describe the composer as ‘Capo di Compagnia de Musichi d’Instrumenti da fiato in Venetia’, leader of a Venetian company of piffari, while the Book II dedications announce that he was also a musician at San Marco. Eleanor Selfridge-Field’s painstaking archival detective work in the 1960s and early 1970s discovered no mention of a Dario Castello, musician or otherwise, resident in Venice between 1621 and 1658. Her attempts to reconstruct a ‘non-existent’ biography include the suggestion that the composer’s sonata volumes were published under an anagram of his real name, although there appears to be no suitable candidate to satisfy the efforts even of determined problem-solvers. (Selfridge-Field, Eleanor: ‘Dario Castello: A non-existent biography’. Music and Letters, 53 (1972), 179–190)...&quot;\r\n\r\nTransfers are made at 768 kBits/s, directly from the disc.\r\n\r\nYou can find all my classical uploads by searching on Philidor, or in this thread:\r\n  \nhttps://pirates-forum.org/Thread-Philidor-s-uploads--63895","torrent":{"xt":"urn:btih:b186d446da7139c6cdf62bde0448546484516c28","amp;dn":"The+Floating+City+-+His+Majestys+Sagbutts...+%281997%29+%5BPhilidor%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b186d446da7139c6cdf62bde0448546484516c28","infoHashBuffer":{"type":"Buffer","data":[177,134,212,70,218,113,57,198,205,246,43,222,4,72,84,100,132,81,108,40]},"announce":[],"urlList":[]}}