{"title":"Windows Server 2012 Essentials EN FR - MSDN Untouchedw","uid":8623801,"size":9860301574,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b19607ed6f0473b15c71c99b90231eaf65fd9021&amp;dn=Windows+Server+2012+Essentials+EN+FR+-+MSDN+Untouchedw&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"prathaprabhu","files":4,"time":1372447661,"description":"Windows Server 2012 Essentials provides easier setup, installation, and migration experiences, a simplified management experience, and better network-wide security features. It incorporates the latest Microsoft technologies for management, networking, data storage and backup, security, and document and printer sharing. Windows Server 2012 Essentials provides integration capabilities for cloud-based applications and services, allowing you the flexibility to choose the best environment for your line-of-business and collaboration solutions.\n \nWindows Server 2012 Essentials allows you to retain core network and security features in your local environments, and also includes technologies to enable robust integration with cloud-based services. This allows end-users to work in ways that are familiar to them, while at the same time making it easier to take advantage of the growing set of offerings available in the cloud through platforms such as Microsoft Office 365 and Windows Azure.\n\nNo Password :)","torrent":{"xt":"urn:btih:b19607ed6f0473b15c71c99b90231eaf65fd9021","amp;dn":"Windows+Server+2012+Essentials+EN+FR+-+MSDN+Untouchedw","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b19607ed6f0473b15c71c99b90231eaf65fd9021","infoHashBuffer":{"type":"Buffer","data":[177,150,7,237,111,4,115,177,92,113,201,155,144,35,30,175,101,253,144,33]},"announce":[],"urlList":[]}}