{"title":"Blue Man Group (ft. Dave Matthews) - Sing Along [promo].VOB","uid":8742069,"size":45946880,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:b24464b74004dd2810253bbe64ad913efbfbd550&amp;dn=Blue+Man+Group+%28ft.+Dave+Matthews%29+-+Sing+Along+%5Bpromo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1374815163,"description":"Blue Man Group (ft. Dave Matthews) - Sing Along [promo].VOB\n\n\nHQ very rare promo music video from a promo DVD. &quot;Sing Along&quot;, is a song from  The Complex, the second full-length album by Blue Man Group, released in 2003. The album produced two singles, and debuted at #60 on the Billboard charts. The Allmusic review by Robert L. Doerschuk states &quot;Although its inspirations, musical and conceptual, trace as far back as Kraftwerk, The Complex serves as a reminder that modern devices and glistening production values can be applied to the most primal creative instincts, if utilized by the right -- blue -- hands&quot;, &quot;These tracks adhere to clear song structures, with guest vocalists singing actual lyrics on original as well as cover material; a zombie-like cameo by Dave Matthews on &quot;Sing Along&quot; offers the wryest surprises.&quot;\n\nThe Complex is a concept album that takes place in two separate worlds, a world of rock as in the song &quot;Time to Start,&quot; and the urban isolation world, as in the songs &quot;Sing Along,&quot; &quot;The Current&quot;, and &quot;The Complex.&quot; Both worlds are then tied together in the song &quot;What Is Rock,&quot; which combines the ideals of the rock concert with the ideals of urban isolation.\n\nBlue Man Group is an organization founded in 1987 by Chris Wink, Matt Goldman and Phil Stanton. The organization produces theatrical shows and concerts featuring experimental music (with an emphasis on percussion), comedy and multimedia; recorded music and scores for film and television; television appearances for shows such as The Drew Carey Show, The Tonight Show, Las Vegas, Scrubs, FETCH! with Ruff Ruffman, and Arrested Development, Shake It Up on the Disney Channel, and a children's museum exhibit (&quot;Making Waves&quot;). All of the organization's theatrical performances star a trio of humanoid characters called Blue Men, played by actor - musicians who wear bald caps and uniform blue makeup.\n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/The_Complex_(album)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/The_Complex_(album)&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/JANCPaAeP&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/JANCPaAeP&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic: \n   Video: MPEG2 Video 720x368  29.97fps 5800kbps\n   Audio: Dolby Digital AC3 48000Hz stereo 192kbps\n   Duration: 00:03:36\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.6.8\n\n\n*Media Player Classic Home Cinema*  &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\n\nSgtRlee (Sgt.R.Lee) \n\t","torrent":{"xt":"urn:btih:b24464b74004dd2810253bbe64ad913efbfbd550","amp;dn":"Blue+Man+Group+%28ft.+Dave+Matthews%29+-+Sing+Along+%5Bpromo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b24464b74004dd2810253bbe64ad913efbfbd550","infoHashBuffer":{"type":"Buffer","data":[178,68,100,183,64,4,221,40,16,37,59,190,100,173,145,62,251,251,213,80]},"announce":[],"urlList":[]}}