{"title":"INVADER ZIM [COMPLETE][VERIVIED-VIDZ]","uid":7961530,"size":968138228,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b30ee9a90df77cd0f463c030d4cb2455a634400c&amp;dn=INVADER+ZIM+%5BCOMPLETE%5D%5BVERIVIED-VIDZ%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mike3313","files":-1,"time":1356597731,"description":"INVADER ZIM ALL 46 CANON EPISODES\nSEED AND COMMENT\nIF YOU HAVE A REQUEST COMMENT AND ILL TRY\n\nInvader Zim is an American animated television series created by Jhonen Vasquez. It was produced by and subsequently premiered on Nickelodeon. The series is about an extraterrestrial named Zim from the planet Irk, and his ongoing mission to conquer and destroy Earth. His various attempts to subjugate and destroy the human race are invariably undermined by some combination of his own ineptitude, his malfunctioning robot servant GIR, and paranormal investigator Dib, one of very few humans attentive enough to be aware of Zim's identity.\n\nInvader Zim was first broadcast on March 30, 2001 and was targeted at children in their early teens, and met with critical acclaim, but after the first season, the show's ratings began to suffer. Before the second season was completed, Nickelodeon canceled the series, leaving at least 23 episodes and a planned television movie series finale unfinished. The show has maintained a cult following since cancellation with a pilot episode, 46 canon episodes, and at least 17 episodes that were in production at the time of the series' cancellation. On August 19, 2006, all 46 canon episodes have aired on television and been released on DVD. 19 of the episodes are split into two individual stories, each lasting about 12 minutes. There are 8 double-length episodes. All episodes were directed by Steve Ressel except for the pilot which was directed by Jordan Reichek.","torrent":{"xt":"urn:btih:b30ee9a90df77cd0f463c030d4cb2455a634400c","amp;dn":"INVADER+ZIM+%5BCOMPLETE%5D%5BVERIVIED-VIDZ%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b30ee9a90df77cd0f463c030d4cb2455a634400c","infoHashBuffer":{"type":"Buffer","data":[179,14,233,169,13,247,124,208,244,99,192,48,212,203,36,85,166,52,64,12]},"announce":[],"urlList":[]}}