{"title":"Mystery of The Maya - IMAX","uid":4177334,"size":1048406016,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b33dee9a5ffc62438d8bee3432520bba997335fc&amp;dn=Mystery+of+The+Maya+-+IMAX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"TheLabMan","files":1,"time":1210202360,"description":"Originally Presented in IMAX Theaters - Witness the Splendor of the Mayan Civilization\n\n                           IMAX - Mystery Of The Maya\n\nWitness the splendor of the Mayan civilization through the discovery of their pyramids, palaces and temples.\n\nDeep within the jungles of Mexico and Guatemala, and extending into the Yucatan Peninsula lie the fabled pyramids, temples and palaces of the Maya. While Europe still slumbered in the midst of the dark ages, these innovative people charted the heavens, evolved the only true writing system native to the Americas and made tremendous strides in the areas of mathematics and calendars.\n\nWithout the advantage of metal tools, beasts of burden or even the wheel, they were able to construct vast cities with an amazing degree of architectural perfection and variety.\n\nFilmed on location at numerous sacred sites throughout Central America, including the ruins at Palenque, Tikal, Tulum, Chichen Itza, Copan and Uxmal, Mystery of the Maya explores the culture, science and history of these people.\n\nDirected by Barrie Howells and Robert Rochin Naya, narrated by Susan Glover. Music by Larry Crosley and Dario Domingues.\n\n ","torrent":{"xt":"urn:btih:b33dee9a5ffc62438d8bee3432520bba997335fc","amp;dn":"Mystery+of+The+Maya+-+IMAX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b33dee9a5ffc62438d8bee3432520bba997335fc","infoHashBuffer":{"type":"Buffer","data":[179,61,238,154,95,252,98,67,141,139,238,52,50,82,11,186,153,115,53,252]},"announce":[],"urlList":[]}}