{"title":"Doom Ultimate + Doom 2","uid":4021949,"size":36441363,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b387b4285f58e02e64d9e7b511367f34b5a63c99&amp;dn=Doom+Ultimate+%2B+Doom+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"infinite0101","files":5,"time":1202701083,"description":"*******************************************************************************\n                                  DOOM&amp;DOOM2\n*******************************************************************************\n\n-------------------------------------------------------------------------------\n                              General Information\n-------------------------------------------------------------------------------\nType.................: Game\nPlatform.............: Windows 9x/ME/2000\nSerial #.............: N/A\nPart Size............: 14.3(mb)\nNumber of Parts......: 3\nCompression Format...: RAR\nFile Validation......: SFV\n\n-------------------------------------------------------------------------------\n                                 Release Notes\n-------------------------------------------------------------------------------\nDoom (or DOOM) is a 1993 computer game by id Software that is a landmark title \nin the first-person shooter genre, and in first person gaming in general. It is \nwidely recognized for pioneering immersive 3D graphics, networked multiplayer \ngaming on the PC platform, and support for custom expansions (WADs). Distributed \nas shareware, Doom was downloaded by an estimated 10 million people within two \nyears, popularizing the mode of gameplay and spawning a gaming subculture; as a \nsign of its effect on the industry, games from the mid-1990s boom of \nfirst-person shooters are often known simply as &quot;Doom clones&quot;. Its graphic and \ninteractive violence has also made Doom the subject of much controversy reaching \noutside the gaming world. According to GameSpy, Doom was voted by industry \ninsiders to be the greatest game of all time in 2004.\n\nThe Doom franchise was continued with Doom II: Hell on Earth (1994) and numerous \nexpansion packs, including The Ultimate Doom (1995), Master Levels for Doom II \n(1995), and Final Doom (1996). Originally released for PC/DOS, these games have \nlater been ported to many other platforms, including nine different game \nconsoles, and even PDAs. The series lost mainstream appeal as the technology of \nthe Doom game engine was surpassed in the mid-1990s, although fans have \ncontinued making WADs, speedruns, and modifications to the source code released \nin 1997. The franchise again received popular attention in 2004 with the release \nof Doom 3, a retelling of the original game using new technology, and an \nassociated 2005 Doom motion picture.\n\n\nDoom has a science fiction/horror theme, and a simple plot. The background is \nonly given in the game&amp;#039;s manual, and the in-game story is mainly advanced with \nshort messages displayed between the game&amp;#039;s episodes.\n\nThe player takes the role of a nameless space marine (referred to as &quot;Doomguy&quot; \nby many fans), &quot;one of Earth&amp;#039;s toughest, hardened in combat and trained for \naction&quot;, who has been deported to Mars for assaulting a senior officer when \nordered to kill unarmed civilians. He is forced to work for the Union Aerospace \nCorporation (UAC), a military-industrial conglomerate that is performing secret \nexperiments with teleportation between the moons of Mars, Phobos and Deimos. The \nMarine may have been forced into a security or unimportant staff position \naccording to the manual, stating &quot;with no action for fifty million miles, your \nday consisted of suckin&amp;#039; dust and watchin&amp;#039; restricted flicks in the rec room.&quot; \nSuddenly, something goes wrong and creatures from Hell come out of the \nteleportation gates, or &quot;Gateways&quot;. A defensive response from base security \nfails to halt the invasion, and the bases quickly get overrun by demons; all \npersonnel are killed or turned into zombies. At the same time, Deimos vanishes \nentirely. A UAC team from Mars is sent to Phobos to investigate the incident, \nbut soon radio contact ceases and only one human is left alive ? the player, \nwhose task is to make it out as such.\n\nIn order to complete the game, the player must fight through three episodes \ncontaining nine levels each (see Episodes and levels of Doom). Knee-Deep in the \nDead, the first episode and the only one in the shareware version, is set in the \nhigh-tech military bases on Phobos. It ends with the player fighting the Barons \nof Hell and afterwards entering the teleporter leading to Deimos, ending with \nthe player getting overwhelmed by monsters and seemingly killed. In the second \nepisode, Shores of Hell, the player journeys through the Deimos installation, \nwhose areas are interwoven with beastly architecture, warped and distorted by \nthe demonic invasion. After encountering the Cyberdemon, the truth about the \nvanished moon is discovered: it is floating above Hell. The player climbs down \nto the surface, and the final episode, Inferno, begins. After destroying the \nfinal boss, the Spider Mastermind, a hidden doorway opens for the hero who has \n&quot;proven too tough for Hell to contain&quot;, leading back home to Earth. The \nexpansion pack Ultimate Doom adds a fourth episode, Thy Flesh Consumed, \nchronicling the marine&amp;#039;s return to Earth, in other words his adventures between \nthe first three traditional episodes of Doom and Doom II.\n\nFrom Wikipedia, the free encyclopedia\n\n[Includes]\nDOOM Ultimate\nDOOM 2\n-------------------------------------------------------------------------------\n                                 Install Notes\n-------------------------------------------------------------------------------\n1)Unrar\n2)Play","torrent":{"xt":"urn:btih:b387b4285f58e02e64d9e7b511367f34b5a63c99","amp;dn":"Doom+Ultimate+%2B+Doom+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b387b4285f58e02e64d9e7b511367f34b5a63c99","infoHashBuffer":{"type":"Buffer","data":[179,135,180,40,95,88,224,46,100,217,231,181,17,54,127,52,181,166,60,153]},"announce":[],"urlList":[]}}