{"title":"The Limbourg Brothers - Reflections on the Origins and the Legac","uid":9482680,"size":21421645,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b3add3d830792050ac1a88de01f8fea15169712a&amp;dn=The+Limbourg+Brothers+-+Reflections+on+the+Origins+and+the+Legac&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STBGD","files":-1,"time":1389827665,"description":"The Limbourg Brothers: Reflections on the Origins and the Legacy of Three Illuminators from Nijmegen By Rob Duckers, Pieter Roelofs, Rob Duckers\nPublisher: Brill 2009 | 218 Pages | ISBN: 9004175121 | PDF | 21 MB\n\n\n\nAlthough the Nijmegen artists Herman, Paul and Jean de Limbourg were barely thirty years old when they suddenly died in 1416, they could already look back on a formidable career. Now, even almost six hundred years after their creation, their colourful and highly refined miniatures in the Belles Heures and Tres Riches Heures du Duc de Berry still speak vividly to our imagination. In 2005, Museum Het Valkhof in Nijmegen presented the exhibition The Limbourg Brothers. Nijmegen Masters at the French Court (1400-1416). This was the first time that original miniatures out of four manuscripts by the Limbourg brothers were shown in the Netherlands. The exhibition formed an excellent opportunity to invite prominent scholars to share their views on the art of the Limbourg brothers during a two day conference. This publication presents in written form the conference papers delivered by some of the leading scholars in the field. In that respect, this volume acts as an addendum to the catalogue. Contributors of this title include, Hanneke van Asperen, Gregory T. Clark, Herman Th. Colenbrander, Rob Duckers, Eberhard Konig, Margaret Lawson, Stephen G. Perkinson, Pieter Roelofs, Victor M. Schmidt. \nAbout the Author\nRob Duckers (1972), studied Art History and Classical Archaeology at Radboud University Nijmegen and Codicology at Leiden University. He specializes in medieval codices and in in ecclesiastical art, publishing regularly in both fields. He was co-curator of the exhibition 'The Limbourg Brothers. Nijmegen Masters at the French Court 1400-1416'. Duckers is attached to Emerson College European Center and to the treasury at the Basilica of Saint Servatius at Maastricht.Pieter Roelofs (1972), studied Art History and Classical Achaeology at Radboud University Nijmegen. He has been Curator of Seventeenth Century Dutch Painting at the Rijksmuseum Amsterdam since 2006. Roelofs been involved in a variety of exhibitions in the Netherlands and abroad. In 2005 he was project manager and co-curator of the exhibition 'The Limbourg Brothers. Nijmegen Masters at the French Court 1400-1416'. He has published on a wide range of arthistorical themes. ","torrent":{"xt":"urn:btih:b3add3d830792050ac1a88de01f8fea15169712a","amp;dn":"The+Limbourg+Brothers+-+Reflections+on+the+Origins+and+the+Legac","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3add3d830792050ac1a88de01f8fea15169712a","infoHashBuffer":{"type":"Buffer","data":[179,173,211,216,48,121,32,80,172,26,136,222,1,248,254,161,81,105,113,42]},"announce":[],"urlList":[]}}