{"title":"Grim Dawn v.0.2.9.2(b20) Cracked-3DM","uid":10942139,"size":1606846523,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b403c5762ef35c6333c3661c911fdf89b32cd273&amp;dn=Grim+Dawn+v.0.2.9.2%28b20%29+Cracked-3DM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Nimbleton","files":-1,"time":1409554298,"description":"Grim Dawn v.0.2.9.2(b20) Cracked-3DM\n\nExtract 7zip &amp; play!\n\n\nAbout the Game\nEnter an apocalyptic fantasy world where humanity is on the brink of extinction, iron is valued above gold and trust is hard earned. This ARPG features complex character development, hundreds of unique items, crafting and quests with choice &amp; consequence.\n\nCrate Entertainment is a small indie studio founded by the lead gameplay designer of Titan Quest. Join the Grim Dawn community and provide feedback on the ongoing development of the game. Be among the first to experience our growing world, new features and make your mark by participating in polls and discussions on our forum.\n\nKey Features\n\n    Dual class - combine any of five distinct skill classes each with multiple skill trees in which to specialize. Advance your class mastery to unlock over 25 powerful skills and synergistic modifiers per class. Soldier, Demolitionist, Occultist and Nightblade are currently playable with the Arcanist on the way.\n    Augment your class build with a diverse array of unique skills granted by items and components.\n    Collect hundreds of items in common, magical, rare, epic and legendary classes of loot.\n    Quests with Choice and consequence mean you will face tough decisions that leave significant impacts upon the world. Strangers on the road, desperate families and even entire villages may live or perish based on your actions.\n    Recruit survivors who will lend their services to augment your power. Upgrade the town to improve the lives of human survivors.\n    Gain favor with different NPC factions to unlock additional quest lines and earn perks like merchant discounts. However, aiding one faction could turn a rival faction into your enemy.\n    Connect with old friends or make new allies in glorious multiplayer. Multiplayer encounters will put your teamwork to the ultimate challenge. (multiplayer is not yet available but is expected in late July 2014)\n    Fast-paced tactical combat with enemy blood spatters, ragdoll physics and satisfying enemy death effects. Smash in doors and fight house to house, leaving a path of demolished furniture in your wake.\n    Rotate the camera if you choose to survey the full beauty of the world and always fight from the most optimal angle. Levels are still designed so that players are not forced to rotate the camera; it is purely optional.\n    Test your hero against over 100 named hero monsters, hand-configured with their own unique arrays of deadly skills.\n    Explode obstacles or repair structures to open new paths.\n    Descend into special &quot;challenge dungeons&quot; where enemies levels increase as you progress.\n    Dynamic Weather brings the world to life with region-specific climates and a variety of weather effects. A sunny day can cloud over with mild rain showers that builds into a booming thunderstorm. Variable wind gusts blow grass and affect objects like windmills.\n    Collect item recipes that allow you to combine salvaged components into unique crafted items and then, later, use those basic crafted items with higher-tiered recipes to complete items of amazing power.\n    The ability to spend money to reclaim skill points alleviates the fear and frustration of having to make early, uninformed decisions that could permanently gimp a character.","torrent":{"xt":"urn:btih:b403c5762ef35c6333c3661c911fdf89b32cd273","amp;dn":"Grim+Dawn+v.0.2.9.2%28b20%29+Cracked-3DM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b403c5762ef35c6333c3661c911fdf89b32cd273","infoHashBuffer":{"type":"Buffer","data":[180,3,197,118,46,243,92,99,51,195,102,28,145,31,223,137,179,44,210,115]},"announce":[],"urlList":[]}}