{"title":"HISTORY OF POP AND ROCK MUSIC - part 467","uid":8140731,"size":193988710,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:b5224f6e078c40aca59cdb0be9308ec9cc9982af&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+467&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"pupovaczlatko","files":-1,"time":1360802299,"description":"\n\n\n                         PART  467\n\n\n\n \n                GARLAND JEFFREYS - Matador  (1978)\n\n\n\n             &quot;Matador&quot; is a song written and performed by Garland Jeffreys, in December, 1978. He is a part African-American, and Puerto Rican American, singer and songwriter, transversing the musical genres of rock and roll, reggae, blues and soul.  In 1966, Jeffreys began to play in Manhattan nightclubs. Jeffreys played guitar on John Cale's 1969 debut solo album &quot;Vintage Violence&quot; and contributed the song &quot;Fairweather Friend&quot;. In 1969 he founded Grinder's Switch with Woodstock-area musicians including pianist Stan Szelest, guitarist Ernie Corallo, and percussionist Sandy Konikoff. Lew Merenstein produced this one album before the band dissolved in 1970. In 1973, he released his first solo album, &quot;Garland Jeffreys&quot;.&quot;Wild in the Streets&quot; has become something of an unofficial anthem for the skate community and been covered by several musicians.In 1977 Garland recorded his Ghost Writer album for A&amp;M Records, with &quot;Wild in the Streets&quot; included on side two.The next years saw a string of albums, five within five years, and the release of &quot;Matador&quot; which charted in the top five of a number of countries\n      For the song &quot;Matador&quot; he said  &quot;I wrote the Matador song in Mexico, in December, 1978. Very influenced by the atmosphere, the lyrics seemed to roll right off my tongue with amazing ease. Anything sophisticated such as references to Goya, and Barcelona came along later. The basics were all there - I knew I had a special song but never would I think it would become such a great hit internationally (but for some strange reason, it was never released as a single in the U.S.) . For me, Matador continues my personal love and connection to &quot;Spanish&quot; type songs like &quot;Spanish Town&quot;, and later &quot;El Salvador&quot;, &quot;Spanish Manners&quot;, &quot;Spanish Blood&quot; and in the future &quot;Spanish Steps&quot; perhaps. When I finally recorded this mysterious song, with Herb Alpert, Anton Fig, Alan Freedman, and a picture of Manet's Matador on my music stand, it flowed out perfectly. Di dit dit dit dit dit dit dit&quot;. ","torrent":{"xt":"urn:btih:b5224f6e078c40aca59cdb0be9308ec9cc9982af","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+467","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5224f6e078c40aca59cdb0be9308ec9cc9982af","infoHashBuffer":{"type":"Buffer","data":[181,34,79,110,7,140,64,172,165,156,219,11,233,48,142,201,204,153,130,175]},"announce":[],"urlList":[]}}