{"title":"Thomas R. Kelly - A Testament of Devotion (pdf)","uid":8188084,"size":1627877,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b58051718f6a47853bef2ef84a7fa072068fd1d2&amp;dn=Thomas+R.+Kelly+-+A+Testament+of+Devotion+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"pharmakate","files":-1,"time":1361768120,"description":"Thomas R. Kelly - A Testament of Devotion (Harper &amp; Row, 1941). 124 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\nDescription:\n\nSince its first publication in 1941, A Testament of Devotion, by the renowned Quaker teacher Thomas Kelly, has been universally embraced as a truly enduring spiritual classic. Plainspoken and deeply inspirational, it gathers together five compelling essays that urge us to center our lives on God's presence, to find quiet and stillness within modern life, and to discover the deeply satisfying and lasting peace of the inner spiritual journey. As relevant today as it was a half-century ago, A Testament of Devotion is the ideal companion to that highest of all human arts - the lifelong conversation between God and his creatures.\n\nFrom the book:\n\n&quot;Deep within us all there is an amazing inner sanctuary of the soul, a holy place, a Divine Center, a speaking Voice, to which we may continuously return. Eternity is at our hearts, pressing upon our time-torn lives, warming us with intimations of an astounding destiny, calling us home unto Itself. Yielding to these persuasions, gladly committing ourselves in body and soul, utterly and completely to the Light Within, is the beginning of true life. It is a dynamic center, a creative Life that presses to birth within us. It is a Light Within which illumines the face of God and casts new shadows and new glories upon the face of men. It is a seed stirring to life if we do not choke it. It is the Shekinah of the soul, the Presence in the midst. Here is the slumbering Christ, stirring to be awakened, to become the soul we clothe in earthly form and action. And He is within us all.&quot;\n\n\n\n&quot;Among the few great and undying books of devotion&quot; (Christian Century)\n\nAbout the Author\n\nThomas R. Kelly (1893-1941) was a Quaker missionary, educator, speaker, writer, and scholar.","torrent":{"xt":"urn:btih:b58051718f6a47853bef2ef84a7fa072068fd1d2","amp;dn":"Thomas+R.+Kelly+-+A+Testament+of+Devotion+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b58051718f6a47853bef2ef84a7fa072068fd1d2","infoHashBuffer":{"type":"Buffer","data":[181,128,81,113,143,106,71,133,59,239,46,248,74,127,160,114,6,143,209,210]},"announce":[],"urlList":[]}}