{"title":"Nanotechnology - Societal Implications II - Individual Perspecti","uid":15446455,"size":7120946,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b65230b44504648615a9d1e94de9b866223dfa94&amp;dn=Nanotechnology+-+Societal+Implications+II+-+Individual+Perspecti&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1469891018,"description":"Nanotechnology - Societal Implications II - Individual Perspectives - M.C. Roco, W.S. Bainbridge (Springer, 2007).pdf\r\n\r\nAdvances in nanoscience and nanotechnology promise to have major impacts on human health, wealth, and peace in the coming decades. Among the expected breakthroughs are orders of magnitude increases in computer efficiency, human organ restoration using engineered tissue, `designer' materials created from directed assembly of atoms and molecules, and the emergence of entirely new phenomena in chemistry and physics. This book includes a collection of essays by leading scientists, engineers, and social scientists reviewing the possible uses of these impending technical developments in various industrial, medical, and national security applications, and the corresponding ethical, legal, social, economic, and educational issues that they raise. The report outlines potential areas for research into societal implications of nanotechnology, as well as some preliminary suggestions for how potential positive impacts of nanotechnology can be maximized, while minimizing any possible negative impacts, real or imagined. This book also provides the beginning of a blueprint for how one should address second-order consequences of the new technology, either positive implications or potential risks","torrent":{"xt":"urn:btih:b65230b44504648615a9d1e94de9b866223dfa94","amp;dn":"Nanotechnology+-+Societal+Implications+II+-+Individual+Perspecti","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b65230b44504648615a9d1e94de9b866223dfa94","infoHashBuffer":{"type":"Buffer","data":[182,82,48,180,69,4,100,134,21,169,209,233,77,233,184,102,34,61,250,148]},"announce":[],"urlList":[]}}