{"title":"VHS Camcorder v1.2.5 APK (Android)","uid":14259132,"size":2905976,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:b76ef9780e5e508b3f82f3cb2faf1355154f7f7e&amp;dn=VHS+Camcorder+v1.2.5+APK+%28Android%29+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Pahly","files":1,"time":1460234258,"description":"It'll look that way when you record and send old, messed up-looking videos to friends. They'll swear you built a time machine: &quot;OMG, how'd you shoot that?&quot;\r\n\r\nWith VHS Camcorder, you'll make home movies that look and sound like video tapes pulled out of storage after 30 years. Remember that birthday when Dad pulled out the huge camcorder and chased everyone around with it? Or that Little League game when you struck out in front of all the girls? And who could forget the day of that embarrassing school play when you fell off the stage? We know you've been absolutely dying to relive those moments... and now you can!\r\n\r\nTrust us, we asked literally everyone and it's unanimous: this app is freakin' amazing!\r\n\r\nHere's Why You Need It:\r\n• Four words: Best. Throwback. Videos. Ever.\r\n• Impress that girl you're obsessed with by using our app to convince her you built a time machine\r\n• Make your kids' incredibly boring school plays actually watchable\r\n• The only app you should ever consider to capture your 80s and 90s-themed parties\r\n• Shoot your own &quot;found footage&quot; movie and become a big Hollywood director like those other guys\r\n• Create videos of your kids that look like the ones from your childhood\r\n• Too young to have lived through the 80s? Recapture your non-existent memories by shooting terrible awesome videos\r\n\r\nWhat VHS Camcorder Can Do:\r\n• Realism: the ORIGINAL and BEST app for simulating old videotape recordings\r\n• The most beautiful tape noise, static and tracking distortion the world has ever seen\r\n• On-screen date and time graphics--you know, when cameras actually did that\r\n• Create custom F*L*A*S*H*I*N*G titles for the ultimate in on-screen cheese\r\n• Fake the on-screen date so people think you're way younger--or older--than you really are\r\n• Phony zoom lens feature dramatically enhances the cheese factor\r\n• Control the effect during recording using your finger or by shaking your device\r\n• Don't think we forgot to make things sound bad--we didn't\r\n• Widescreen recording option (but would you REALLY want to use it?)\r\n\r\nPLEASE NOTE:\r\nTHIS APP DOES NOT WORK ON ROOTED DEVICES WITH CUSTOM ROMS. If you don't know what &quot;rooted&quot; means, don't worry about this.\r\n\r\nWhat's in this version :\r\nNow working with HTC One (M7)\r\nFixed issue where preview would sometimes be black at startup\r\nAdded option to disable autofocus\r\nImproved camera detection and error handling\r\nChanges to video/audio threading\r\nRequired Android O/S : 4.4+","torrent":{"xt":"urn:btih:b76ef9780e5e508b3f82f3cb2faf1355154f7f7e","amp;dn":"VHS+Camcorder+v1.2.5+APK+%28Android%29+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b76ef9780e5e508b3f82f3cb2faf1355154f7f7e","infoHashBuffer":{"type":"Buffer","data":[183,110,249,120,14,94,80,139,63,130,243,203,47,175,19,85,21,79,127,126]},"announce":[],"urlList":[]}}