{"title":"Heart Of The Alien - Setup (with Fusion 3.51 emulator)","uid":4593593,"size":42160805,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b7705e1e75e5e76adc16384a728cb3eded27fb60&amp;dn=Heart+Of+The+Alien+-+Setup+%28with+Fusion+3.51+emulator%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ILKnight","files":-1,"time":1229924063,"description":"Setup installer of Heart Of The Alien (the sequel of Another World/Out Of This World) for Windows\n\nThe easier way to install and play Heart of the Alien in Windows XP.\n\nHeart of the Alien is not that great compared with the original game (Another World). Nevertheless, I enjoy playing Heart of the Alien but it cost me too much time and effort to make it work in my PC because it does not exist another version different from the original platform Sega Mega-CD/Sega CD console. Thanks to the Gens and Fusion emulators for Windows, PC gamers can now play this game. The problem its the requirements to start playing the game:\n1st. You need to download the CD image of the game (ISO + MP3).\n2nd. Next, download a Sega CD emulator (Gens or Fusion).\n3rd. Then, you need to download the Sega CD BIOS for the respective country (Europe, Japan or USA).\n4th. Then, you need to indicated the directory of the BIOS in the configuration menu of the emulator.\n5th. And finally, load the image of Heart of the Alien.ISO in the emulator.\n\nIts really complicated, especially without knowing what to do.\nFortunately for the future gamers, I made this setup installer for Heart of the Alien that make all the process very easy. You just need to install the game and all the configurations and trouble to make it work are made automatically.\n\nThis setup installer include: Fusion 3.51 emulator, Heart Of The Alien ISO, the Sega CD BIOS, new icons made by myself, access codes and the CD covers.\nAfter the installation, it will be ready to play, only requires Windows XP (at least its the only operating systems that I try, but maybe others also work)\nI make this EXE file with Inno Setup Compiler version 5.1.6. (by the way, this software its great and easy to use).\n\nThis setup will be not add any file in the system's folder or other folder different from the specified. Only will be created a folder in the Program Files folder (or another folder if you change it). In this folder will be added all the files required to run the game. Also will create the shortcuts but you can disable this option before the installation if you want. It also dont have any adware, virus, worms, spyware or any file that can be harm your computer.\n\n\nYou can also download this game directly (without torrent) from my website: http://interlinkknight.googlepages.com/downloads\n\nI made the Setup, so if you have some problems or suggestions, comment about it here.\n\nIf you like it, please comment and seed.","torrent":{"xt":"urn:btih:b7705e1e75e5e76adc16384a728cb3eded27fb60","amp;dn":"Heart+Of+The+Alien+-+Setup+%28with+Fusion+3.51+emulator%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b7705e1e75e5e76adc16384a728cb3eded27fb60","infoHashBuffer":{"type":"Buffer","data":[183,112,94,30,117,229,231,106,220,22,56,74,114,140,179,237,237,39,251,96]},"announce":[],"urlList":[]}}