{"title":"HISTORY OF POP AND ROCK MUSIC - part 353","uid":7018421,"size":1702366520,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:b9804e7bd89ac5fafeb3f56c6676adf9f9542113&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+353&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pupovaczlatko","files":-1,"time":1328745891,"description":"                 PART  353\n\n\n          RICK JAMES  -  Mary Jane  (1978)\n          RICK JAMES  - You And I   (1978)\n          RICK JAMES  -  Give It To Me Baby ( 1981)\n          RICK JAMES  -  Super Freak (1981)  (long version)\n          CHIC  -  Chic Mystique  (1992)  \n          CHIC  -  Good Times  (remix)\n          CHIC   - Le Freak  (remix)\n\n\n\n        &quot;Mary Jane&quot; is a song by Rick James released in 1978 from his debut album &quot;Come Get It!&quot;, and was one of the first songs to utilize the style of music Rick James labeled &quot;punk-funk.&quot;. The song peaked in the top five on the R&amp;B charts in the United States in 1978. As one of his earliest hits as a solo artist, it is one of his most notable songs. It was composed by James, along with keyboardist Billy Nunn, who was credited for the keyboards, strings, background vocals, helping to compose the song, arranging flute parts, and other instrumentation work.   \n        &quot;You and I&quot; was the name of a hit song for R&amp;B/Funk musician Rick James. It was released from his debut album, Come Get It!. It spent two weeks at number one on the Billboard R&amp;B charts and reached number thirteen on the Billboard Hot 100 in 1978. &quot;You and I&quot; also peaked at number three on the disco chart.\n       &quot;Give It to Me Baby&quot; is the title of a 1981 song by American R&amp;B / funk singer Rick James. Taken from his album &quot;Street Songs&quot;, the song charted on the Billboard Hot 100, spending two weeks at #40 in July 1981. However, the song proved to be more successful with R&amp;B and dance club audiences. It spent five weeks at #1 on the R&amp;B chart, and together with two other tracks from Street Songs, &quot;Super Freak&quot; and &quot;Ghetto Life&quot;, topped the American dance chart for three weeks in the summer of 1981. This song was also featured in the 1999 comedy She's All That. DJ Jazzy Jeff &amp; the Fresh Prince's &quot;I'm All That&quot; used a sample the song as the opening track from the Homebase album in 199\n      &quot;Super Freak&quot; is a 1981 hit single produced and performed by Rick James. The song, co-written by James and Alonzo Miller, was first released on James' album &quot;Street Songs&quot; and became one of James' signature songs. Rolling Stone magazine ranked the song #477 in its list of the 500 Greatest Songs of All Time.   \n      &quot;Chic Mystique&quot; is a 1992 song recorded by American disco and R&amp;B act Chic. Written and produced by guitarist Nile Rodgers, it was the second single from the album Chic-Ism and was a number-one hit on the Billboard Hot Dance Club Play in the U.S. and achieved a moderate success in many European countries where it was only a top 25 hit.\n        &quot;Good Times&quot; is a 1979 song composed by Bernard Edwards and Nile Rodgers. It was first recorded by their band Chic, for their 1979 album &quot;RisquÃƒÂ©&quot;. In August of that year, it became the band's second number one single on both the Billboard Hot 100 and soul singles chart. Along with the tracks, &quot;My Forbidden Lover&quot;, and &quot;My Feet Keep Dancing&quot;, &quot;Good Times&quot; reached number three on the disco charts. The song has become one of the most sampled tunes in music history, most notably in rap and hip-hop music. Billboard magazine named &quot;Good Times&quot; the number one R&amp;B single for 1979.\nThe song is ranked #224 on Rolling Stone's list of the 500 Greatest Songs of All Time.\n","torrent":{"xt":"urn:btih:b9804e7bd89ac5fafeb3f56c6676adf9f9542113","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+353","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9804e7bd89ac5fafeb3f56c6676adf9f9542113","infoHashBuffer":{"type":"Buffer","data":[185,128,78,123,216,154,197,250,254,179,245,108,102,118,173,249,249,84,33,19]},"announce":[],"urlList":[]}}