{"title":"Desperado OST","uid":5320118,"size":341170174,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b9b74f7d58cd3df7b84c616f79490eb9fe7f0700&amp;dn=Desperado+OST&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sunbird76","files":3,"time":1264842707,"description":"Desperado - Original Motion Picture Soundtrack\n\nOriginal Release 1995\n\nVarious Artists - Dire Straits, Los Lobos, Latin Playboys, Antonio Banderas, \nRoger &amp; the Gypsies, Wray Link &amp; the Wraymen, Tito &amp; Tarantula, Selma Hayek,\nCarlos Santana\n\n\n\n\nRipped with EAC v0.99 (log &amp; cue included)\n\n\n\n\n\nReviews:\n\n\nBrent A. Anthonisen &quot;Johnny Sideburns&quot; on a-ma-zon.com \n\nI've lost track of how many times I've had to re-purchase this soundtrack -I think I'm on my fourth copy- because invariably I'll let someone borrow it and because it is SO GOOD I never see it again.\n\nI was one of the two people I knew (my ex-wife being the other) who really enjoyed &quot;Desperado&quot; when it came out. The success of &quot;Once Upon A Time In Mexico&quot; is bringing other people back to it and under the pen of the revisionist critics it will hopefully be given better treatment as a video rental/cult favorite (a la &quot;Scarface&quot;).\n\nThe soundtrack basically followed Quentin Tarantino's &quot;Pulp Fiction&quot; model, using dialogue snippets along with a cutting edge soundtrack utilizing music from multiple genres creating what is essentially a mix tape from within the mind of the movie's director.\n\nThe music from &quot;Pulp Fiction&quot; tended to reflect traditional American forms of music (surf rock, '70's soul), but &quot;Desperado&quot; definitely utilizes music that seems to fit the border town in which the film takes place; there is definitely an American influence (&quot;Strange Face Of Love&quot; is probably the best Stevie Ray Vaughan song that Stevie Ray somehow never managed to write), but the overall flavor is distinctly Latin, with members of Los Lobos (as The Latin Playboys) carrying the bulk of the load. Not to be outdone, Tito Larriva (formerly of the Cruzados, now recording as Tito &amp; Tarantula) provide stand-out tracks with a distinctly more contemporary &quot;classic rock&quot; sound, with Carlos Santana making a contribution in his pre-Grammy warm-up run. The stars of the film also contribute vocal tracks, Antonio Banderas particularly effectively in the main theme &quot;Cancion del Mariachi&quot; (backed by Los Lobos in an absolutely slashing performance), while Salma Hayek is...well, I can't understand a word of what she says in &quot;Quedate Aqui&quot;, but the WAY she says it is absolutely enflaming. Yum.\n\nAn action-filled movie has an action-filled soundtrack. The film soundbites aren't too intrusive; you don't have entire monologues as with &quot;Pulp Fiction's&quot; &quot;Royale With Cheese&quot; bit, for example. All song selections and non-vocal theme music tracks are strong. &quot;Mariachi Suite&quot;, a woefully truncated abreviation of three very distinct themes that range from traditional to contemporary, is one piece that I would have enjoyed seeing performed and recorded in their entirety. Even so it is a fine finishing track off of a CD that is a terrific introduction to Latin music for fans of classically American rock.\n\n\n\nAll Music Guide Review, Roch Parisien\n\nThe soundtrack to Desperado (sequel to El Mariachi -- artist/musician hero in black sports guitar case full of weapons) desperately sought to capture the style of Pulp Fiction, with its Latin-flavored, Tarantino-meets-Morricone mood. It partially succeeded, integrating movie dialogue with choice contributions from Los Lobos and uncentered offshoot band Latin Playboys and vintage instrumental kickers courtesy of Link Wray's &quot;Jack the Ripper&quot; and the obscure &quot;Pass the Hatchet&quot; by Roger &amp; the Gypsies. Salma Hayek's steaming &quot;Quedate Aqui&quot; and Dire Straits' &quot;Six Blade Knife&quot; stay in character, but the mood is lost to bombastic blues rockers by Tito (Larriva of The Cruzados) and Tarantula, Carlos Santana, and one uncharacteristic Los Lobos miscue (the dire &quot;Let Love Reign&quot;).\n\n\n\n\nTrack List:\n\n01.Cancion Del Mariachi (Morena De Mi Corazon) - Los Lobos/Antonio Banderas [2:06]\n02.Six Blade Knife - Dire Straits [4:34]\n03.Jack The Ripper - Link Wray/His Ray Men [2:31]\n04.Manifold De Amour - Latin Playboys [2:03]\n05.Forever Night Shade Mary - Latin Playboys [3:00]\n06.Pass The Hatchet - Roger &amp; The Gypsies [3:00]\n07.Bar Fight - Los Lobos [1:54]\n08.Strange Face Of Love - Tito &amp; Tarantula [5:51]\n09.Bucho's Gracias/Navajas Attacks - Los Lobos [3:56]\n10.Bulletproof - Los Lobos [1:42]\n11.Bella - Carlos Santana [4:29]\n12.Quedate Aqui - Salma Hayek [2:05]\n13.Rooftop Action - Los Lobos [1:36]\n14.Phone Call - Los Lobos [2:16]\n15.White Train (Showdown) - Tito &amp; Tarantula [5:57]\n16.Back To The House That Love Built - Tito &amp; Tarantula [4:41]\n17.Let Love Reign - Los Lobos [3:22]\n18.Mariachi Suite - Los Lobos [4:24]\n \n\n\nThanks to both reviewers and PLEASE KEEP SEEDING!","torrent":{"xt":"urn:btih:b9b74f7d58cd3df7b84c616f79490eb9fe7f0700","amp;dn":"Desperado+OST","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9b74f7d58cd3df7b84c616f79490eb9fe7f0700","infoHashBuffer":{"type":"Buffer","data":[185,183,79,125,88,205,61,247,184,76,97,111,121,73,14,185,254,127,7,0]},"announce":[],"urlList":[]}}