{"title":"Kasabian - West Ryder Pauper Lunatic Asylum (Limited/Special Edi","uid":5970102,"size":1871659530,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:b9ea7b313b4e2962da0e2dff350f75e146b1a25a&amp;dn=Kasabian+-+West+Ryder+Pauper+Lunatic+Asylum+%28Limited%2FSpecial+Edi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"F1ke","files":-1,"time":1290212361,"description":"&quot;Kasabian are back with a third album and surprise surprise, they're not coming quietly. In fact, after favouring brevity on 2004's Kasabian and 2006's Empire, they've gone all-out word crazy with a genius concept album: West Ryder Pauper Lunatic Asylum.\n\nThe concept is the soundtrack to an imaginary movie undoubtedly taking place at the 19th century West Yorkshire facility that gave the album its name. If first single Fire is anything to go by, it's going to be a slow-burning grower of an album.\n\nAfter the departure of co-writer Chris Karloff during the making of Empire, Serge Pizzorno went solo with writing responsibilities and also co-produced with Gorillaz production supreme Dan The Automator between their very juxtaposed bases of Leicester and San Francisco.\n\nThe partnership works like a charm, as you may well have heard already - whether through the album leak, the 2007 EP, the website limited debut, the Bravia TV ad or the soundtrack to FIFA 2009. Kasabian haven't exactly been creeping around ahead of launch.\n\nThese songs are epic, they could open films or welcome boxing titans into the ring. Opener Underdog has an instantly loveable classic, defiant riff. Vlad The Impaler is utter bonkers from the lyrics to the video starring The Mighty Boosh's Noel Fielding as a vampire. There's genuinely touching old-school nostalgia on Where Did All The Love Go and the opening 20 seconds of Fast Fuse could go down in history as one of the finest intros ever created.\n\nSome of the tracks take a while to reveal their charms (Fire, Happiness where Serge's vocals don't quite stand up to Tom's, Take Aim and West Ryder Silver Bullet - a duet with Sin City star Rosario Dawson). But every single one has at least a flash of utter brilliance - and most a darn sight more.\n\nKasabian may be a bunch of rogues, but they're very, very loveable ones making music that's brilliant, uplifting, showy and epic - but above all fun. Only they could make an instrumental track named after the mechanic's hand cleaner Swarfiga cool.\n\nThe swagger is definitely back. But then, if you've got it, why not flaunt it? --Sophie Bruce&quot;\n\n------------------------------------------------------------------------------\n------------------------------------------------------------------------------\n\nLimited Edition/Special Edition. Includes the original recording in FLAC, and the live DVD in AVI format.\n\nIf you've downloaded this, please seed, as I cannot seed 24/7. Sharing is caring!\n\nF1ke","torrent":{"xt":"urn:btih:b9ea7b313b4e2962da0e2dff350f75e146b1a25a","amp;dn":"Kasabian+-+West+Ryder+Pauper+Lunatic+Asylum+%28Limited%2FSpecial+Edi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9ea7b313b4e2962da0e2dff350f75e146b1a25a","infoHashBuffer":{"type":"Buffer","data":[185,234,123,49,59,78,41,98,218,14,45,255,53,15,117,225,70,177,162,90]},"announce":[],"urlList":[]}}