{"title":"Kid Creole and The Coconuts - Tropical Gangsters(1982)EAC-FLAC(o","uid":5831092,"size":475054991,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ba59d21a70c1fa22e801d676107dbe643b158733&amp;dn=Kid+Creole+and+The+Coconuts+-+Tropical+Gangsters%281982%29EAC-FLAC%28o&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"oneanight","files":-1,"time":1284514064,"description":"Not my rip thank you very much to the original poster..;)\n\nKid Creole &amp; The Coconuts - Tropical Gangsters (1982) (2002 Remaster) EAC-FLAC.\n\n\nDigitally Remastered Reissue of the Kid and the Babes Most Successful Album  from the Brindisi Reef that Yielded Hit Singles on Both Sides of the Atlantic and Solidified their Fan Base. The Second in the &quot;Mimi&quot; Cycle, August Darnell's Lyrics  Are Humourous and Thought Provoking in a Spicy Stew of Funk, Calypso and R&amp;b...long Before Anyone Else in the Pop World Attempted to Merge them All. Includes Updated Liner Notes, Rare Photos and an Interview with August Darnell. The Real Bonus for Collectors Are the Six Bonus Tracks; All the 12&quot; Mixes and Single B-songs Released in Tandem with the Original Album: &quot;Christmas on Riverside Drive&quot;, &quot;You Had No Intention&quot;, &quot;Annie I'm Not Your Daddy (Remix)&quot;, &quot;i'm a Wonderful Thing (Original 12&quot; Mix)&quot;, &quot;Stool Pigeon (12&quot; Mix)&quot; and &quot;Double on Back&quot;.\n\n\n\n01. Annie (I'm Not Your Daddy)\n02. I'm A Wonderful Thing, Baby\n03. Imitation\n04. I'm Corrupt\n05. Loving You Made A Fool Out Of Me\n06. Stool Pigeon\n07. The Love We Have\n08. No Fish Today\n09. Christmas On Riverside Drive\n10. You Had No Intention\n11. Annie I'm Not Your Daddy (Remix)\n12. I'm A Wonderful Thing (Original 12&quot; Mix)\n13. Stool Pigeon (12 Inch Mix)\n14. Double On Back (B Side Of Stool Pigeon 12&quot;)\n\n\nGroundbreaking album. Combines many styles of music. Very unique sound. Fantastic use of acoustic instruments with synthsizers. There hasnt been a band yet to capture this amalgamation of music. Too far ahead of its time to enjoy its true success. If this were released today August Darnell would own the world. Customer Review www.amazon.com\n\n\nTropical Gangsters was the soundtrack to my clubbing years in the early eighties.\nPop Music was a lot different then - Culture Club, The Associates, Haircut 100, Dexys Midnight Runners, and er, Musical Youth!\nI had been aware of Kid Creole for a few years before this album was released.\nI already had a Dr Buzzard L.P. and the Mutant Disco Album.\nYou had to be there to understand the impact this album had.\nIt was being played in every Wine Bar and Pub in town, throughout the long hot summer of 1982.\nKid Creole and the Coconuts were famous for risque lyrics, outrageous costumes, and Hollywood style theatrics.\nI went to see them at Birmingham Odeon on the Tropical Gangsters tour.\nHalf of the audience was on stage for the encores!\nThis new release includes all the classic 12&quot; mixes and B sides.\nThere are also another three remastered and expanded Kid Creole albums available now.\nWhat can i say - I will buy the set - if you like great music\nyou should too. Customer Review www.amazon.co.uk\n\nAll Artwork Included At 300dpi","torrent":{"xt":"urn:btih:ba59d21a70c1fa22e801d676107dbe643b158733","amp;dn":"Kid+Creole+and+The+Coconuts+-+Tropical+Gangsters%281982%29EAC-FLAC%28o","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba59d21a70c1fa22e801d676107dbe643b158733","infoHashBuffer":{"type":"Buffer","data":[186,89,210,26,112,193,250,34,232,1,214,118,16,125,190,100,59,21,135,51]},"announce":[],"urlList":[]}}