{"title":"Roadhouse","uid":5837501,"size":984307759,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:baa7cf0e6f3609d462d5746b7b256d8a391954ed&amp;dn=Roadhouse&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cexxx","files":2,"time":1284783520,"description":"Dalton is the Cooler in bars; He backs up and directs the bouncers. He takes a job in a Road House that has gotten far too rough. His attempts to clean things up put him in conflict with Brad Wesley, the town bully and rich person. Things heat up.  Written by John Vogel &lt;&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;81ebedf7eee6e4edc1e2eeece2e0f2f5afefe4f5&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script data-cfhash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;data-cfhash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}t.parentNode.removeChild(t);}}catch(u){}}()/* ]]&gt; */&lt;/script&gt;&gt;\n\nDalton is an expert &quot;cooler&quot; -- a barroom bouncer who can break up fights without getting himself killed in the process. Frank Tilghman, the owner of the Double Deuce in Jasper, Missouri, has hired Dalton away from a bar in New York City, because Tilghman needs someone who can handle the nightly outbreaks of violence at the Double Deuce, and teach the rest of the Double Deuce's bouncers how to handle it. There's even a cage protecting the bar's band from the customers. The band is led by Dalton's old friend Cody, who is blind. Dalton is injured on his first night on the job and is treated by Elizabeth &quot;Doc&quot; Clay, the local doctor. Dalton and Doc soon fall in love with each other, and this angers Brad Wesley, a crime boss that Doc was once involved with -- and may still be involved with. Wesley is also responsible for a lot of the violence at the Double Deuce, and for some time, Wesley has had the sheriff in his pocket, giving him complete control of the town of Jasper. Wesley is out to get rid of Dalton, who has already made some friends in Jasper -- Dalton has rented a room from a man named Emmet, and has befriended local auto parts store owner Red Webster, and has also befriended Pete Stroudenmire, the owner of Stroudenmire Ford, a local car dealership. Wesley wants money from these people and is responsible for much mayhem. Written by Daniel Poniatowski\n\nWhen it becomes too violent at the Double Deuce road house, the club owner hires Dalton, a professional &quot;cooler&quot; (head bouncer) to clean it up. But Dalton's early successes and budding romance with the local doctor enrages Wesley, the town crime boss. When Dalton continues to defy him, the stage is set for a dramatic confrontation that will test Dalton's limits and decide the fate of the town. Written by R. Huston ","torrent":{"xt":"urn:btih:baa7cf0e6f3609d462d5746b7b256d8a391954ed","amp;dn":"Roadhouse","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"baa7cf0e6f3609d462d5746b7b256d8a391954ed","infoHashBuffer":{"type":"Buffer","data":[186,167,207,14,111,54,9,212,98,213,116,107,123,37,109,138,57,25,84,237]},"announce":[],"urlList":[]}}