{"title":"Anthony Burgess - EARTHLY POWERS.pdf","uid":8071355,"size":2046596,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bb055af05586b26aaedf386ea7979cec6f094a0e&amp;dn=Anthony+Burgess+-+EARTHLY+POWERS.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"PEPO99","files":1,"time":1359283919,"description":"I rate this Burgess' best novel, having bought it at least three times! It's a big, heavy book, so I take it to the beach it, read it, and bin it before leaving, to save luggage weight. Then I realise I need to reread it...\nBurgess' narrator namedrops his way shamelessly through the twentieth century as he tells the story of his own life and the intertwined fortunes of his brother-in-law, Carlo Campanati, a Catholic priest whose dearest ambition is to &quot;make Pope&quot;. It's a huge sweep of history and human times to cover, but Burgess centres it around faith, duty, and home, and makes it look easy.\n\nOne warning: he is *very* erudite, so you'll need a dictionary at times. I reckon I have a good vocabulary, but I had no idea what a &quot;venerean strabismus&quot; was. It's up there with &quot;Brideshead Revisited&quot; as a &quot;foodie&quot; book too. One of the beaches I read this on was in Goa, and I was gagging for the Italian meatballs and &quot;cold, black wine&quot; which I couldn't get over there!\n\nStylistically it's self-conscious; the narrator intervenes frequently to remind you he's writing his autobiography. It's not a major problem, and in fact it's necessary. The first time you notice this is the absolutely show-stopping opening paragraph involving archbishops and catamites (reach for your dictionary if you don't know)...!\n\nDid I mention this book is frequently very, very funny? I cried laughing at the later scenes featuring the shoplifting bisexual Nazi.\n\nWarmly recommended; just don't expect Clockwork Orange!","torrent":{"xt":"urn:btih:bb055af05586b26aaedf386ea7979cec6f094a0e","amp;dn":"Anthony+Burgess+-+EARTHLY+POWERS.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb055af05586b26aaedf386ea7979cec6f094a0e","infoHashBuffer":{"type":"Buffer","data":[187,5,90,240,85,134,178,106,174,223,56,110,167,151,156,236,111,9,74,14]},"announce":[],"urlList":[]}}