{"title":"Shack - H.M.S. Fable [1999]","uid":9420221,"size":346663642,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:bca63dc2ba1457bb2caaab90d06958c35fa8cbad&amp;dn=Shack+-+H.M.S.+Fable+%5B1999%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GenXRock","files":-1,"time":1388567735,"description":"Shack is led by Michael Head, who fronted the Pale Fountains in the mid-'80s after his mind was blown by Liverpool's incredible Echo &amp; the Bunnymen and Teardrop Explodes. Head and his brother John know their way around highly-developed '60s-to-'80s pop. Get past what used to be called side one; it's often wonderful, but it's lesser. For instance, the one clunker, &quot;Pull Together,&quot; is like uncharacteristically-bad Oasis. &quot;Lend's Some Dough&quot; is fun Mersey bounce pop like the La's, and the two U.K. singles, &quot;Natalie's Party&quot; and the much better Bunnymen-like &quot;Comedy,&quot; are both guilty of trying too hard. But, starting with &quot;Streets of Kenny,&quot; the LP shifts into a more natural pace, marked by chattering, delicately-picked bright acoustics, ringing electrics, busy background strings, and the Heads' onrushing, splendid harmonies. The level of compositions, arrangements, and singing on side two sets Shack apart from all the merely-OK, press-fed bands cluttering up British festivals. In fact, Head's pop knack has never been greater, as if he finished a long apprenticeship. (1997's The Magical World of the Strands, released as Michael Head &amp; the Strands, is even way better!) He's rather sly about it, too: From the affectionate &quot;You Only Live Twice&quot; coda of the standout, &quot;Since I Met You,&quot; to the staccato Burt Bacharach trumpet blurts of &quot;Re-instated&quot; to the Revolver Beatles outros of &quot;Natalie's Party&quot; and &quot;I Want You&quot; to the Arthur Lee/Love-worship of &quot;Daniella,&quot; the milestones of yesteryear are referenced but built upon as well. What a contrast to the shambles of Shack's 1988 debut. The drums crackle, the guitars zing, the strings wash overhead. Perhaps the Heads sounded better in the past with more organic production, starting with 1996's Water Pistol. The bigger, bolder production is just a new wrinkle. Say no more.","torrent":{"xt":"urn:btih:bca63dc2ba1457bb2caaab90d06958c35fa8cbad","amp;dn":"Shack+-+H.M.S.+Fable+%5B1999%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bca63dc2ba1457bb2caaab90d06958c35fa8cbad","infoHashBuffer":{"type":"Buffer","data":[188,166,61,194,186,20,87,187,44,170,171,144,208,105,88,195,95,168,203,173]},"announce":[],"urlList":[]}}