{"title":"4 Rare 80s Albums [Part 4]","uid":4087734,"size":359634480,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:bcb4dbc2856619e51a90c28f4fbc00d7e06fe68b&amp;dn=4+Rare+80s+Albums+%5BPart+4%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"80zforever","files":47,"time":1205909542,"description":"Four more of my favorite 80s new wave/synthpop albums. Please help seeding them. By the way tune in to more of these series for the coming long weekend!\n\n\n\n\nThe Expression - The Expression [1984]\n\nA wonderful debut album by an Australian band, that unfortunately didn't have the luck to gather in its well deserved success. Band members were Tom Haran, Neville Dowling, Andrew Wong Yen, and Stephen Manassah. &quot;Present Communication&quot;, &quot;With Closed Eyes&quot;, &quot;Total Eclipse&quot;, &quot;Keep Appointments&quot;, &quot;Dawn, Day and Sleep&quot;, &quot;Nothing Changes&quot; and &quot;Satisfied Strangers&quot; were the melodic highlights, full of romanticism, crowned by the longing voice of lead singer and main writer Tom Haran.\n\nThe singles &quot;With Closed Eyes&quot; and &quot;Total Eclipse&quot; should have been worldwide hits, but ...  \n\n01 Present Communication  \n02 With Closed Eyes  \n03 Dawn, Day And Sleep  \n04 Total Eclipse  \n05 Keep Appointments  \n06 Right To A Slice  \n07 Decisions  \n08 You And Me  \n09 About Tomorrow  \n10 Satisfied Strangers  \n11 More Like A Feeling Than A Taste  \n12 Round And Round \n13 Nothing Changes\n14 Three Four Day \n\n\n-----------------------------------------------------------------------------------\n\n\nI Start Counting - My Translucent Hands [1986]\n\nPop experimentalists I Start Counting favored English artiness with a sense of fun. Unlike many other electronic groups from the '80s, I Start Counting never settled into a single formula; the band continued to tinker with its sound, shifting effortlessly from light to dark, accessible to avant-garde. I Start Counting was formed in the early '80s by David Baker and Simon Leonard. In 1984, the duo was signed by Mute and released its debut single, the quirky &quot;Letters to a Friend.&quot; &quot;Letters to a Friend&quot; easily distinguished itself from the glut of synthesizer-laden records from the mid-'80s with Baker's distinctly British talk-sing style and the psychedelic feel of the keyboards. The follow-up, 1985's &quot;Still Smiling,&quot; was hailed as another instant classic from the band. Writing and recording songs from their basement, Baker and Leonard finally released an LP, My Translucent Hands, a year later. I Start Counting gained a significant cult following in the U.K. and the U.S., especially among American suburban teens who were discovering Depeche Mode and Kraftwerk in dance clubs.\n\n\n01 Introduction   \n02 My Translucent Hands   \n03 Catch That Look   \n04 You and I   \n05 Lose Him Baker, Leonard   \n06 Keep the Sun Away   \n07 Cranley Gardens   \n08 Which Way Is Home   \n09 Letters to a Friend   \n10 Still Smiling   \n11 Small Consolation   \n12 (There Is Always the) Unexpected\n\n\n-----------------------------------------------------------------------------------\n\n\nNine Ways to Win - Self-titled [1983]\n\nNine Ways to Win  was a UK new wave band that released only one LP. The band members were Steve Creese (Percussion), Raul d'Oliveira (Trumpet), Stuart Gordon (Violin), Steve Lovell (Guitar), Ronald MacDonald (Saxophone), David Rhodes (Guitar), Nine Ways to Win (Main Performer), Martyn Swain (Bass), Peter Acock (Saxophone), Georgia II (Vocals (Background)), Johnathan Hughston (Vocals), Pete Thomas (Saxophone), David Ferguson (Keyboards). Close to You and Painting over Cracks are the highlights though I love the whole LP.\n  \n01 Close to You\n02 Painting over Cracks\n03 Second Cross on the Hill\n04 Ashes and Diamonds\n05 Breaking Bread\n06 Lights All over the World\n07 Waltz\n08 All Sit Down\n09 High-Wire\n10 Time for Keys\t \t\t \t \n\t \t\n\n-----------------------------------------------------------------------------------\t \t \n\nWa Wa Nee - Self-titled [1986]\n\nLed by the songwriting team of Paul Gray and Steve Williams, the band signed with CBS Records in 1985. Wa Wa Nee had four singles in the Australian top 40 from their debut album release of the same name. They included &quot;Stimulation&quot; which reached number 2 nationally in Australia in 1986, &quot;I Could Make You Love Me&quot;, reaching the top 10 in the same year, and both &quot;One And One (Ain't I Good Enough)&quot; and &quot;Sugar Free&quot; making the top 40. The latter also reached the U.S. Billboard Hot 100 top 30, although this was their only success there.\nThe band's self titled debut album went platinum in Australia.\n\n\n01 One And One (Ain't I Good Enough) \n02 Teacher \n03 Stimulation \n04 Jelly Baby \n05 Gone \n06 Sugar Free \n07 When The World Is A Home \n08 Man Child \n09 Love Reaction \n10 I Could Make You Love Me \n\n\n\n","torrent":{"xt":"urn:btih:bcb4dbc2856619e51a90c28f4fbc00d7e06fe68b","amp;dn":"4+Rare+80s+Albums+%5BPart+4%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bcb4dbc2856619e51a90c28f4fbc00d7e06fe68b","infoHashBuffer":{"type":"Buffer","data":[188,180,219,194,133,102,25,229,26,144,194,143,79,188,0,215,224,111,230,139]},"announce":[],"urlList":[]}}