{"title":"Porno - by Irvine Welsh (read by tam dean burn)","uid":3999162,"size":176099820,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:bcb4adfa141b17c058a03afae23d63691f1686af&amp;dn=Porno+-+by+Irvine+Welsh+%28read+by+tam+dean+burn%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"paulyearwig","files":6,"time":1201462356,"description":"Audio Length: 6 hours and 5 min.\n\n\nIn the fag-end of his youth, Simon &quot;Sick Boy&quot; Williamson is back in his native Edinburgh after a long spell in London. Having failed spectacularly as a hustler, pimp, husband, father, and businessman, Sick Boy taps into an opportunity, which to him represents one last throw of the dice.\nTo enable this scam to work out, Sick Boy needs bedfellows. A desirable one may be the lovely Nicola Fuller-Smith, a young student with enough ambition, ego, and troubles to rival his own. However, to realize his dream of directing and producing a pornographic movie, Sick Boy gets teamed up with old pal and fellow exile Mark Renton and a motley crew that includes the city&amp;#039;s favourite ex-aerated-water-salesman: &quot;Juice&quot; Terry Lawson.\n\nIn the world of Porno, however, nothing is straightforward, as Sick Boy and Renton find out that they have unresolved issues to address, concerning the increasingly unhinged Frank Begbie, the troubled, drug-addled Spud, but, most of all, with each other. Porno is a novel about the Trainspotting crew 10 years further down the line: still scheming, still scamming, still trying to fight for the first-class seats as the locomotive careens at high speed towards the buffers.\n","torrent":{"xt":"urn:btih:bcb4adfa141b17c058a03afae23d63691f1686af","amp;dn":"Porno+-+by+Irvine+Welsh+%28read+by+tam+dean+burn%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bcb4adfa141b17c058a03afae23d63691f1686af","infoHashBuffer":{"type":"Buffer","data":[188,180,173,250,20,27,23,192,88,160,58,250,226,61,99,105,31,22,134,175]},"announce":[],"urlList":[]}}