{"title":"Organic Syntheses Based on Name Reactions,3rd Ed {BBS}","uid":7619259,"size":43139938,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bd941ec901407a09497bd55960dadd73de3af587&amp;dn=Organic+Syntheses+Based+on+Name+Reactions%2C3rd+Ed+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1347283364,"description":"Organic Syntheses Based on Named Reactions is an indispensable reference companion for chemistry students and researchers. Building on Hassner &amp; Stumer's highly regarded 2e, this new work reviews 750 reactions, with over 100 new stereoselective and regioselective reactions. Each A-Z entry provides a carefully condensed summary of valuable information that a chemist needs to understand and utilize these fundamental reactions in their work, including brief practical details. The book is illustrated with real synthetic examples from the literature and about 3,400 references to the primary literature to aid further reading. Extensive indexes (name, reagent, reaction) and a very useful functional group transformation index help the reader fully navigate this extensive collection of important reactions. With its comprehensive coverage, superb organization and quality of presentation, this long-awaited new edition belongs on the shelf of every organic chemist.\n\n * Handy reference guide that explains 750 established named processes and methods that are trusted and used by organic chemists to synthesise or transform molecules  * Provides key data on each transformation including background, mechanism and uniquely to books in this area experimental details  * Extensive and multiple indexes allow the reader to search for information as and how they want and to rapidly plan transformations\n\n\n# Hardcover: 612 pages\n# Publisher: Elsevier; 3 edition (January 5, 2012)\n# Language: English\n# ISBN-10: 0080966306\n# ISBN-13: 978-0080966304","torrent":{"xt":"urn:btih:bd941ec901407a09497bd55960dadd73de3af587","amp;dn":"Organic+Syntheses+Based+on+Name+Reactions%2C3rd+Ed+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd941ec901407a09497bd55960dadd73de3af587","infoHashBuffer":{"type":"Buffer","data":[189,148,30,201,1,64,122,9,73,123,213,89,96,218,221,115,222,58,245,135]},"announce":[],"urlList":[]}}