{"title":"Reza a Lenda 2016 - AVI DVDRIP - Ignus Draco","uid":14651577,"size":731129856,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c041bb1f526971de4e1da4a6f2e3afd41ecbaf8d&amp;dn=Reza+a+Lenda+2016+-+AVI+DVDRIP+-+Ignus+Draco&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"IgnusD","files":1,"time":1463637407,"description":"PT-BR\r\nEm uma terra sem lei, a sorte favorece apenas os mais fortes e corajosos. Ara, um homem de ação e poucas palavras, é o líder de um bando de motoqueiros armados que acredita em uma antiga lenda capaz de devolver justiça e liberdade ao povo da região. Quando realizam um ousado roubo, acabam despertando a fúria do poderoso Tenório. Agora, Tenório vai concentrar todas as suas forças em uma perseguição para destruir o bando de Ara e recuperar aquilo que acredita ser seu por direito. Durante a perseguição, a jovem Laura é resgatada de um acidente e tem que seguir o bando contra a sua vontade, despertando ciúmes em Severina, companheira de Ara.\r\n\r\n\r\nENG\r\nIn a lawless land, luck favors only the strong and courageous. Ara, a man of action and few words, is the leader of a band of armed motorcyclists who believes in an ancient legend capable of restoring justice and freedom to the people of the region. When performing a daring robbery, just arousing the fury of powerful Tenorio. Now, Tenorio will concentrate all his forces in a pursuit to destroy the Ara gang and recover what he believes is rightfully his. During the chase, Laura Young is rescued from an accident and have to follow the pack against his will, arousing jealousy in Severina, Ara companion","torrent":{"xt":"urn:btih:c041bb1f526971de4e1da4a6f2e3afd41ecbaf8d","amp;dn":"Reza+a+Lenda+2016+-+AVI+DVDRIP+-+Ignus+Draco","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c041bb1f526971de4e1da4a6f2e3afd41ecbaf8d","infoHashBuffer":{"type":"Buffer","data":[192,65,187,31,82,105,113,222,78,29,164,166,242,227,175,212,30,203,175,141]},"announce":[],"urlList":[]}}