{"title":"Stossel.2013.10.03.[Just Shut It].Fox Business.CF.avi","uid":9006781,"size":330357076,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c042a3739adfde77a040ac7fe8a34521dcb147ff&amp;dn=Stossel.2013.10.03.%5BJust+Shut+It%5D.Fox+Business.CF.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"skJGZV6z","files":-1,"time":1381050310,"description":"----------\n\nSTOSSEL - [Just Shut It!] - Fox Business Network\n2013, October 3, Thursday\n\nXvid/MP3 AVI - encoded from medium quality ReplayTV stream\n\n----------\n\n[excerpted from John Stossel's blog:]\n\nKeep the government shut? That sounds nuts, but remember that this is just a partial shutdown, and my hope is that this pause in some government spending -- will be a teaching moment. More people may realize that lots of what government does is not so important and given that America's going broke, we ought to cut some of it now, permanently.\n\nTHE SHUTDOWN: Senator Mike Lee proudly says he kick-started the defund Obamacare movement that led to the shutdown. Economist Ben Powell agrees with my hope that a government shutdown will be a good thing.\n\nPRIVATE SECTOR: Companies lay workers off all the time. At the beginning of the year, American Express announced it would cut over 5,000 jobs. It's the creative destruction that helps them innovate and stay useful. Why is it so hard for politicians to make similar decisions? Former NFL defensive lineman turned entrepreneur, Tyoka Jackson, will explain how private businesses constantly make the tough choices, choices that government won't make.\n\nMEDIA BIAS: Some say the media hate Republicans, and it's true that they have &quot;A Slobbering Love Affair&quot; with Barack Obama. But I think the media also has a slobbering love affair... with big government. Bernie Goldberg and I debate the media's coverage of the shutdown.\n\nIMPERIAL WASHINGTON: Tourists visit Washington and admire the beautiful buildings. When I visit Washington, I see politicians and bureaucrats serving themselves. Cato Institute's Executive Vice President, David Boaz, explains why 4 out of 5 of America's richest counties now surround Washington D.C.\n\nGOP: I hear Republicans want to cut government. But Reason's Editor-In-Chief Matt Welch says the GOP wimps out when it comes to making real cuts.\n\nMY TAKE: When asked why Democrats won't negotiate over spending, Nancy Pelosi told CNN's Candy Crowley, &quot;Because the cupboard is bare. There's no more cuts to make.&quot; They spend $3.7 trillion, and the cupboard is &quot;bare&quot;? Give me a break. Tonight I'll rummage through Nancy's cupboard and see what I find.","torrent":{"xt":"urn:btih:c042a3739adfde77a040ac7fe8a34521dcb147ff","amp;dn":"Stossel.2013.10.03.%5BJust+Shut+It%5D.Fox+Business.CF.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c042a3739adfde77a040ac7fe8a34521dcb147ff","infoHashBuffer":{"type":"Buffer","data":[192,66,163,115,154,223,222,119,160,64,172,127,232,163,69,33,220,177,71,255]},"announce":[],"urlList":[]}}