{"title":"Ben 10: Alien Force - Volume 5 (2009) DVDRip Eng Xvid AC3 AVI [B","uid":5149624,"size":953277918,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:c0ad038abbeab1106e88806523e9c88f4879284f&amp;dn=Ben+10%3A+Alien+Force+-+Volume+5+%282009%29+DVDRip+Eng+Xvid+AC3+AVI+%5BB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Bigjazz.h33t","files":6,"time":1257477109,"description":"-------------------------------------------------------------------\n-------------------------------------------------------------------\n\nBen 10: Alien Force - Volume 5 (2009) DVDRip Eng Xvid AC3 AVI\n\nTitle:\t\tBen 10: Alien Force\nRelease:\tTV: 2008, DVD: 2009\nSeason:\t\tVolume 5, Season 2, Episodes 6-9\nRuntime:\tEach episode approx. 22 minutes\n\nEncoding:\n\nVideo;\nResolution:\t576x432\nBitrate:\t~1224kbps @ 25fps\nCodec:\t\tXvid, v1.2.2\nFormat:\t\tAudio Video Interleave (.avi)\n\nAudio;\nTrack 1:\t2.0 Channel AC3 @ 224kbps\n\nFile Size:\t~225MB\n\nSubtitles:\tNone\n\nSource:\t\tPAL DVD, Region 4\n\nBen 10: Alien Force - Volume 5\n\n206 - Pet Project\nForever Knights' scientist Dr. Joseph Chadwick sends Sir Morton to kidnap Ship so that the Forever Knights can use him to mass-produce a fleet of interstellar spacecraft with which to attack the homeworld of the alien dragon that escaped them. Joined by Julie, who has been taking care of Ship, Ben, Gwen, and Kevin mount a raid on the Forever Knights' stronghold to rescue him. Though Joseph is using a control device to make Ship obey him, Julie is able to convince Ship to resist. The Forever Knights' stronghold is destroyed and the group now has access to a spaceship since Ship can transform into the vehicle the Forever Knights had hoped to mass-produce.\n\n207 - Grounded\nWhile fighting one of the Highbreed, Ben's parents catch him transforming into Swampfire. They forbid him from using the Omnitrix, forcing Kevin and Gwen to fight the DNAliens by themselves. After trying to sneak out as Echo Echo, Ben gets grounded and is made to spill the beans about Gwen, getting her grounded, leaving Kevin alone. Kevin's trouble with the DNAliens eventually pushes Ben over the edge, and he breaks out of his house as Humongousaur in front of his parents to help. After a short battle aboard a small freighter carrying a rare isotope which the DNAliens plan on using, Ben's parents come to the rescue, admitting that they are proud of Ben and understand what he needs to do.\n\n208 - Voided\nHelen and Manny call on Ben to help deal with a dangerous foe in the Null Void: D'Void. Ben goes in alone, with Kevin and Gwen waiting on the other side to bring him back. Once inside, Ben is shocked to learn that &quot;D'Void&quot; is really his old enemy Dr. Animo, who has taken control of the Null Guardians and enslaved the inhabitants of the Null Void. Using them as slave labor, he has built a machine to drill through the dimensional wall, hoping to bring his army to Earth. With the help of Grandpa Max, who was transported to the Null Void in &quot;Max Out&quot;, and a small force of rebels he has gathered, Ben manages to destroy the drilling machine as Big Chill and defeat Dr. Animo. Gwen opens a portal back to Earth for Ben, but Grandpa Max cannot join them yet as things have to be set right in the Null Void first.\n\n209 - Inside Man\nThe team rescues a man named Tyler, who stole the Oscillator Key for the Highbreed's hyperspace gateway. He crashes his truck and suffers memory loss as he escapes. Both the DNAliens and the team track down the device, resulting in a battle. The team is victorious, but they discover that Tyler is actually a DNAlien, having managed to resist the Xenocyte controlling him. More DNAliens arrive to reclaim the Oscillator Key, capturing Tyler during the struggle. Ben opts to save Tyler instead of retrieving the Oscillator Key, and uses the Omnitrix to restore him to human form. As the DNAliens escape, the four now know their plan and prepare to take action.\n\n-------------------------------------------------------------------\nPlease share....Don't hit and run...Seed it back at least once.\n\nOf course, if you want to seed it back more than once, that would be ok too :)\n-------------------------------------------------------------------","torrent":{"xt":"urn:btih:c0ad038abbeab1106e88806523e9c88f4879284f","amp;dn":"Ben+10%3A+Alien+Force+-+Volume+5+%282009%29+DVDRip+Eng+Xvid+AC3+AVI+%5BB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0ad038abbeab1106e88806523e9c88f4879284f","infoHashBuffer":{"type":"Buffer","data":[192,173,3,138,187,234,177,16,110,136,128,101,35,233,200,143,72,121,40,79]},"announce":[],"urlList":[]}}