{"title":"A Raven's Nest Bookstore Mystery Series - Allison Kingley","uid":10733500,"size":1602606,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c13f5b3e613e44092c2e00839ecee6b9d822494b&amp;dn=A+Raven%27s+Nest+Bookstore+Mystery+Series+-+Allison+Kingley&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1407659638,"description":"Mind over Murder\nCousins and best friends, Clara and Stephanie Quinn run The Raven's Nest Bookstore, where people go to find their most coveted reads. But they have no idea it's the psychically-gifted Clara who's reading them...\n\nThe bookstore has made an enemy of the town crier, Ana Jordon, who claims that the store's occult collection is &quot;poisoning&quot; the town's youth. Meanwhile, the store's number-one employee, Molly, has made no secret of her anger over Ana's antics. So when Ana is found dead, killed by the bust of Edgar Allen Poe sculpted by Molly, the evidence is stacked against her. And Clara must rely on her gift to make sense of this senseless murder...\n\nA Sinister Sense\nThe Raven's Nest bookstore stocks the best reads in Finn's Harbor, Maine -- and owner Stephanie Quinn employs a genuine mind reader in her cousin, Clara...\n\nSeeing visions of the future and tuning into people's thoughts come naturally to Clara Quinn, thanks to her inherited Quinn Sense. Unfortunately, it offers no insight into her love life -- or -lack thereof -- especially where hardware store owner Rick Sanders is concerned. Even though she's still nursing a broken heart, Clara offers Rick a home for his troublesome dog, Tatters.\n\nBut Tatters is the least of Rick's problems when a dead body is discovered in the back of his truck. The victim was seen in the hardware store -- and bludgeoned to death with a hammer stolen from there. Clara believes Rick is innocent, but she's not sure whether that belief comes from the Quinn Sense in her head or simply from the desire in her heart...\n\nTrouble Vision\nIn quaint Finn's Harbor, Maine, cousins and best friends Clara and Stephanie Quinn run The Raven's Nest bookstore. But thanks to Clara's ability to read minds and see the future, selling books sometimes gets shelved in favor of saving lives... \n\nWhen the new mayor calls a press conference about the controversial hotel resort being built on the edge of the city, the residents of Finn's Harbor have an opportunity to express their concerns about traffic and tourists. But when the debating turns into outright fighting, Clara gets a premonition that's nothing but trouble. \n\nWhile Stephanie is enthralled with her cousin's vision, Clara just wants it to go away. Then a customer comes into The Raven's Nest talking about a fatal fall at the hotel's construction site, and Clara knows better than to ignore her Quinn Sense. In a town full of citizens who want the project to fail, Clara and Stephanie have to figure out who made the jump from anger to murder...\n\nExtra Sensory Deception\nAs the owners of the Raven's Nest bookstore, cousins Stephanie and Clara Quinn are the premier booksellers in the quaint town of Finn's Harbor, Maine. But with Clara's inherited ability to read minds and see the future, she's also the premier crime solver... \nYou don't have to be a psychic to know: The rodeo is coming to town Clara's boyfriend, Rick Sanders, invites her to the show to meet his high school buddy and expert calf roper, Wes Carlton. But when Clara's Quinn Sense offers her a disturbing vision involving a rodeo clown, she worries that there will be more danger at the rodeo than just the traditional bucking bronco. \nOf course, her premonition turns out to be accurate, and a dead body is discovered behind the concert stage, strangled by Wes's piggin' string. Rick is sure that there's no way Wes could have murdered anyone, but he's going to need Clara's Quinn Sense to keep the authorities from roping the wrong suspect...","torrent":{"xt":"urn:btih:c13f5b3e613e44092c2e00839ecee6b9d822494b","amp;dn":"A+Raven%27s+Nest+Bookstore+Mystery+Series+-+Allison+Kingley","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c13f5b3e613e44092c2e00839ecee6b9d822494b","infoHashBuffer":{"type":"Buffer","data":[193,63,91,62,97,62,68,9,44,46,0,131,158,206,230,185,216,34,73,75]},"announce":[],"urlList":[]}}