{"title":"Elementals (Bill Willingham)","uid":9095611,"size":1050443114,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:c1c563db81bd7b7823d87b44baf7462496c60955&amp;dn=Elementals+%28Bill+Willingham%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"Ichthypod_Crane","files":93,"time":1382669485,"description":"Tanned, toned and tendentious, the Ichthypod Upload Machine once more cranks into action, with Bill Willingham's 'Elementals'!\n\nLong before 'Fables', Bill Willingham created 'Elementals', which first saw the light of day as a back-up feature in Texas Comics' 'Justice Machine Annual' in 1983, before moving over to Comico in 1984 for a hefty run.\n\nA certain online encyclopedia says:\n\nWhen a centuries-old sorcerer named Lord Saker built a machine called the Shadowspear to harness the supernatural powers of the world, he upset the natural order of the universe. In response, the four elements, unimaginably powerful spirits who together formed the foundation of existence, each chose an ordinary human who had been killed by their element, and resurrected him or her. They granted each control of that particular element, eternal youth, and the ability to heal from any wound (given sufficient time). These four were the Elementals, sent to oppose Saker.\n\nThe team consisted of:\n\n    Morningstar, aka Jeanette Crane, a Los Angeles homicide detective who had burned to death while confronting a serial arsonist; she received various fire-related abilities, including pyrokinesis and an immunity to fire.\n\n    Vortex, aka Jeff Murphy, a Coast Guard pilot who was asphyxiated in a helicopter crash; he received various air-related abilities, including flight and wind-blasts.\n\n    Fathom, aka Becky Golden, a flighty debutante who fell off a boat and drowned; she received various water-related abilities, as well as bright green skin and webbed fingers. She was also able to convert her body entirely into sentient water and shoot high-pressure streams.\n\n    Monolith, aka Tommy Czuchra, a brilliant if introverted teenaged boy who was crushed to death by a landslide; he received the ability to become an enormous super-strong stone/earth golem.\n\n\nA kindred uploader - Fauzty - torrented the bulk of this in November of last year. This torrent is built upon his/hers with a few tweaks:\n\nAdded Elementals v3 #3\nAdded Oblivion #1-3 (tie-in series)\nReplaced Monolith #4 with correct Monolith #4 (had been &quot;The Monolith&quot; #4 from DC Comics)\n\nTo my knowledge, this torrent is all but complete, missing only the first issue of v2 of Fathom's mini-series, and v2 and v3 (3 issues total) of Elementals: Sex Special, which, phrasing it most delicately, &quot;fall outside of continuity&quot;.\n\nAlso, I've included a file called 'Have you seen...' regarding some things I'm trying to track down. If you have any of them, please drop me an email!\n\nMany thanks to Fauzty, the creators and the scanners! Get it, seed it!\n","torrent":{"xt":"urn:btih:c1c563db81bd7b7823d87b44baf7462496c60955","amp;dn":"Elementals+%28Bill+Willingham%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c1c563db81bd7b7823d87b44baf7462496c60955","infoHashBuffer":{"type":"Buffer","data":[193,197,99,219,129,189,123,120,35,216,123,68,186,247,70,36,150,198,9,85]},"announce":[],"urlList":[]}}