{"title":"Letters from a Nut - Ted L. Nancy (191p) [Inua].pdf","uid":11600572,"size":5998212,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c22e38fcdd434660111490a7820850a57bcbb24f&amp;dn=Letters+from+a+Nut+-+Ted+L.+Nancy+%28191p%29+%5BInua%5D.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Inua1","files":1,"time":1417338148,"description":"Title: Letters from a Nut\nAuthors: Ted L. Nancy \nHardcover: 192 pages\nPublisher: It Books; 1 edition (June 1, 1997)\nLanguage: English\nISBN-10: 0380973545\nISBN-13: 978-0380973545\n\n\n\nWho is Ted L. Nancy?\nHe's a concerned hotel guest searching for a lost tooth...\n\nHe's a superstitious Vegas high-roller who wants to gamble at a casino in his lucky shrimp outfit...\n\nHe's the genius inventor of &quot;Six Day Underwear&quot;...\n\nHe's a demanding dramatist seeking an audience for his play about his 26-year-old dog, Cinnamon...\n\nHe's the proud owner of Charles, a 36-year-old cat who owes his longevity to a pet food company...\n\nHe's a loyal fan of the King of Tonga...\n\nHe is, in reality, a twisted prankster -- a supremely off-kilter alter ego who sends patently ridiculous letters and queries to (and receives surprisingly earnest responses back from) corporate honchos, entertainment conglomerates, national publications, politicians, celebrities and heads of state to everyone, in fact, from the president of the Bon Ami Cleanser Company to U.S. Vice President Al Gore.  \n\nLetters From A Nut is an insanely inspired, truly madcap collection of Nancy correspondence, a laugh-out-loud-in-public-places aggregation of official -- and officially certifiable -- requests, complaints, fan mail and questions that could not possibly have been taken seriously...but, amazingly, were!\n\nDear Mr. Nancy:&quot;It is not often that we receive such enthusiastic support for the paper bag.&quot; --The Paper Bag Council\n\n&quot;On behalf of Greyhound, there should be no problem traveling while in your butter costume.&quot; --Greyhound Bus Lines\n\n&quot;I look forward to working with you to create a better future for this great nation.&quot; -- Vice President Al Gore\n\n&quot;An unending stream of some of the most hilarious exchanges I've ever read. Everyone I lent this book to just read it and laughed out loud like I did. It's so simple, yet totally inventive. I'm sure some sort of mail fraud charges could be brought to stop this man but, personally, I hope they never catch him.&quot; --Jerry Seinfeld\n\n________________________\nThe book is worthy for the page 17. This is the beginning:\n\nDear Mr. Meyer:\n\nI had a seating question and I was referred to you because I understand you manufacture stadium and arena seating. \n\nMy question:\nWhen entering or exiting a seat in a stadium which is the proper side to face the person sitting down? Rear to them or crotch to them?","torrent":{"xt":"urn:btih:c22e38fcdd434660111490a7820850a57bcbb24f","amp;dn":"Letters+from+a+Nut+-+Ted+L.+Nancy+%28191p%29+%5BInua%5D.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c22e38fcdd434660111490a7820850a57bcbb24f","infoHashBuffer":{"type":"Buffer","data":[194,46,56,252,221,67,70,96,17,20,144,167,130,8,80,165,123,203,178,79]},"announce":[],"urlList":[]}}