{"title":"Sexually Broken--AVN award winning MILF India Summer takes on 2 ","uid":9588411,"size":1133970959,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:c2316d71c022a32ed8aecc2856315cc25ed32f42&amp;dn=Sexually+Broken--AVN+award+winning+MILF+India+Summer+takes+on+2+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"merzedes","files":-1,"time":1391860046,"description":"\nAVN award winning MILF India Summer takes on 2 guys, Extreem deepthroating, multiple orgasms! | India Summer | Matt Williams\n\nFebruary 7, 2014\n\n\nMP4 only.\n\n\nIndia Summer is the total package. Stunningly beautiful, a genuinely nice person and the heart and loins of a raging pervert. This is not a bored slut coasting through for a paycheck, this is a lifestyle swinger that loved the animalistic place raw sex takes her and started doing porn so that she could get better access to top shelf dick. Top shelf dick is exactly what Sexuallybroken provides. Today we are going to unravel this sexy swinger with cock until she is cross eyed.\n\nBolted with her back against a wooden beam set at the perfect angle for throat boarding, blindfolded and shackled down in place, India's mouth hole is at the perfect service height. Anyone could come up and make use of it and this blindfolded slut would not even be able to see who it was. And that is exactly what we do. We warm up that responsive cunt with a vibrator and then get to work on that throat. One after another we run a train on her face pussy. India is breathless and dazed and we are just getting started.\n\nMoving quickly while she is still stunned from the throat boarding, we unshackle her and shift her onto a table. Flat on her back and legs in the air, we have perfect access to both ends. It is time to take this swinger down. India is Chinese finger trapped, both ends stuffed full to the hilt. She is utterly overwhelmed, but the the farther we push her the more she loves it. A wide sex crazed grin dances across her face. Her makeup is wrecked, her false eyelashes sliding across her drool covered face. When makeup runs into dick, dick wins every time. This sexy swinger is a mess, completely destroyed by dick.\n\nWhen we have had our fill, we leave her shackled on the fuck table, dazed and cum drunk. She might not be able to remember her own name, but she is certain that she just had the best dicking down of her life. This one is fun as hell and deserves every award for fucking you can throw at her. \n \nScreens &lt;a href=&quot;\nhttp://sexuallybroken.com/sexual/bondage/2014/02_07isummer/SexuallyBroken-India-Summer-Matt-Williams-AVN-award-winning-MILF-India-Summer-takes-on-2-guys-Extreem-deepthroating-multiple-orgasms.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://sexuallybroken.com/sexual/bondage/2014/02_07isummer/SexuallyBroken-India-Summer-Matt-Williams-AVN-award-winning-MILF-India-Summer-takes-on-2-guys-Extreem-deepthroating-multiple-orgasms.php&lt;/a&gt;\n\n13 000 uploads and counting, 14k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)\n\n\nAny Questions ?? Read our FAQ!!\n &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-)  \n\n\n","torrent":{"xt":"urn:btih:c2316d71c022a32ed8aecc2856315cc25ed32f42","amp;dn":"Sexually+Broken--AVN+award+winning+MILF+India+Summer+takes+on+2+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2316d71c022a32ed8aecc2856315cc25ed32f42","infoHashBuffer":{"type":"Buffer","data":[194,49,109,113,192,34,163,46,216,174,204,40,86,49,92,194,94,211,47,66]},"announce":[],"urlList":[]}}