{"title":"Battling Butler (1926)","uid":4981694,"size":735349428,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c26d4c6d0d1fe59385f98274d56ba107208774fe&amp;dn=Battling+Butler+%281926%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Willams","files":15,"time":1246356201,"description":"Battling Butler (1926)\n\n\nBattling Butler has to be the strangest of Buster Keaton's silent features. Based on the musical comedy of the same name, the film casts Keaton as wimpy millionaire Alfred Butler, who goes on a vacation in the mountains in the company of his faithful valet (Snitz Edwards). While communing with nature, Alfred falls in love with a beautiful young girl (Sally O'Neil), who barely acknowledges his existence. Without his master's knowledge, the valet tries to smooth the path of romance by telling the girl that Alfred is, in reality, boxing champion Battling Butler (Francis McDonald). The real champ, a mean-spirited sort, gets wind of this deception and decides to allow Alfred to continue the charade, fully intending to mop the floor with the puny millionaire in the boxing ring. But on the night of the big fight, Alfred suddenly gets tired of being pushed around and turns into a savage opponent, leaving the bullying Butler positively groggy. At this point our hero discovers that the girl would have loved him whether he was Battling Butler or not, and all ends well. Played as traditional Keaton comedy for most of its running time, Battling Butler goes dramatic with a vengeance in the climactic fight scene, with Keaton really giving his ring opponent a going over. The final scene is all the more powerful because it is so completely unexpected; if it surprises today's audiences, one can only imagine the effect it had on Buster Keaton's fans way back in 1926. \n\nThis rip was taken from KG. Thanks to pa6sur, the original uploader on KG. The torrent contains some posters and stills of the film. \n\nIMDB: 7.2/10\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0016630/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0016630/&lt;/a&gt;\n\n\n*****************************FREAKYFLICKS*****************************\n\nFreakyFlicks is a free and open community dedicated to preserving and\nsharing cinematic art in the digital era. Our goal is to disseminate\nsuch works of art to the widest audience possible through the channels\nprovided by P2P technology.\n\nThe FreakyFlicks collection is limited to those films that have played\nan exceptional role in the history of cinema and its progression in\nbecoming a great art. Films that are usually described as classic,\ncult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them\nand participate in our community. All you need do is include this tag\nin your upload and join us at the forum to announce your release.\n       \n \n            &lt;a href=&quot; http://freakyflicks.proboards54.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://freakyflicks.proboards54.com&lt;/a&gt;\t\n\t\n\n*****************************FREAKYFLICKS*****************************\t","torrent":{"xt":"urn:btih:c26d4c6d0d1fe59385f98274d56ba107208774fe","amp;dn":"Battling+Butler+%281926%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c26d4c6d0d1fe59385f98274d56ba107208774fe","infoHashBuffer":{"type":"Buffer","data":[194,109,76,109,13,31,229,147,133,249,130,116,213,107,161,7,32,135,116,254]},"announce":[],"urlList":[]}}