{"title":"The Celts - History, Life, and Culture (gnv64)","uid":8391352,"size":28441591,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c46f4d03af44f83731bff6ab35c0d4dd56febe0d&amp;dn=The+Celts+-+History%2C+Life%2C+and+Culture+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"gnv65","files":1,"time":1366438397,"description":"The Celts: History, Life, and Culture (Vol I &amp; II)\nby John T. Koch and Antone Minard\nABC-CLIO | August 2012 | ISBN: 1598849646 | PDF | 898 pages | 27 MB &lt;a href=&quot;\nhttp://www.amazon.com/The-Celts-History-Life-Culture/dp/1598849646&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/The-Celts-History-Life-Culture/dp/1598849646&lt;/a&gt;\n\nAt the height of their power, the Celts established themselves across Europe, naming major cities such as Paris, Milan, and Vienna in the process. The Celts also introduced trousers and sophisticated wheeled vehicles to the Romans, and their literature brought tales of King Arthur to the world.\nThe study of Celtic history has a wide international appeal, but unfortunately many of the available books on the subject are out-of-date, narrowly specialized, or contain incorrect information. Online information on the Celts is similarly unreliable. This two-volume set provides a well-written, up-to-date, and densely informative reference on Celtic history that is ideal for high school or college-aged students as well as general readers.\nThe Celts: History, Life, and Culture uses a cross-disciplinary approach to explore all facets of this ancient society. The book introduces the archaeology, art history, folklore, history, linguistics, literature, music, and mythology of the Celts and examines the global influence of their legacy. Written entirely by acknowledged experts, the content is accessible without being simplistic. Unlike other texts in the field, The Celts: History, Life, and Culture celebrates all of the cultures associated with Celtic languages at all periods, providing for a richer and more comprehensive examination of the topic.","torrent":{"xt":"urn:btih:c46f4d03af44f83731bff6ab35c0d4dd56febe0d","amp;dn":"The+Celts+-+History%2C+Life%2C+and+Culture+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c46f4d03af44f83731bff6ab35c0d4dd56febe0d","infoHashBuffer":{"type":"Buffer","data":[196,111,77,3,175,68,248,55,49,191,246,171,53,192,212,221,86,254,190,13]},"announce":[],"urlList":[]}}