{"title":"Rocket Ranch (2015).pdf Gooner","uid":12663223,"size":34594440,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c5f30492482067c5f1d8bd922eb43f6ee903be0c&amp;dn=Rocket+Ranch+%282015%29.pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1446329555,"description":"Rocket Ranch - The Nuts and Bolts of the Apollo Moon Program at Kennedy Space Center (2015).pdf Gooner\r\n\r\nPublisher: Springer; 2015 edition (June 26, 2015)\r\nLanguage: English\r\nISBN-10: 3319177885\r\nISBN-13: 978-3319177885\r\n\r\nJonathan Ward takes the reader deep into the facilities at Kennedy Space Center to describe NASA’s first computer systems used for spacecraft and rocket checkout and explain how tests and launches proceeded. Descriptions of early operations include a harrowing account of the heroic efforts of pad workers during the Apollo 1 fire. A companion to the author’s book Countdown to a Moon Launch: Preparing Apollo for Its Historic Journey, this explores every facet of the facilities that served as the base for the Apollo/Saturn missions. Hundreds of illustrations complement the firsthand accounts of more than 70 Apollo program managers and engineers.\r\n\r\nThe era of the Apollo/Saturn missions was perhaps the most exciting period in American space exploration history. Cape Canaveral and Kennedy Space Center were buzzing with activity. Thousands of workers came to town to build the facilities and launch the missions needed to put an American on the Moon before the end of the decade.\r\n\r\nWork at KSC involved much more than just launching rockets. It was a place like none other on Earth. Technicians performed intricate operations, and hazards abounded everywhere, including lightning, fire, highly-toxic fuels, snakes, heat, explosives, LOX spills, and even plutonium. The reward for months of 7-day workweeks under intense pressure was witnessing a Saturn V at liftoff.\r\n\r\nFor anyone who ever wished they had worked at Kennedy Space Center during the Apollo era, this book is the next best thing. The only thing missing is the smell of rocket fuel in the morning","torrent":{"xt":"urn:btih:c5f30492482067c5f1d8bd922eb43f6ee903be0c","amp;dn":"Rocket+Ranch+%282015%29.pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5f30492482067c5f1d8bd922eb43f6ee903be0c","infoHashBuffer":{"type":"Buffer","data":[197,243,4,146,72,32,103,197,241,216,189,146,46,180,63,110,233,3,190,12]},"announce":[],"urlList":[]}}