{"title":"Change Your Thoughts, Change Your Life Living the Wisdom of the ","uid":4001461,"size":792735503,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:c60bb9281c0c7cce24d6bcd0ed9bfa5f9e8d2814&amp;dn=Change+Your+Thoughts%2C+Change+Your+Life+Living+the+Wisdom+of+the+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"IvannaPoot","files":84,"time":1201591777,"description":"Dr. Wayne W. Dyer - Change Your Thoughts, Change Your Life Living the Wisdom of the Tao (Unabridged)\n\nFive hundred years before the birth of Jesus, a God-realized being named Lao-tzu in ancient China dictated 81 verses, which are regarded by many as the ultimate commentary on the nature of our existence. The classic text of these 81 verses, called the Tao Te Ching or the Great Way, offers advice and guidance that is balanced, moral, spiritual, and always concerned with working for the good. \n\nIn this program, Dr. Wayne W. Dyer has reviewed hundreds of translations of the Tao Te Ching and has created 81 distinct essays on how to apply the ancient wisdom of Lao-tzu to today&amp;#039;s modern world. This work contains the entire 81 verses of the Tao, compiled from Wayne&amp;#039;s researching of 10 of the most well-respected translations of text that have survived for more than 25 centuries. As Wayne says, &quot;This is an audiobook that will forever change the way you look at your life, and the result will be that you&amp;#039;ll live in a new world aligned with nature. I&amp;#039;m so proud to present this interpretation of the Tao Te Ching, and offer the same opportunity for change that it has brought me.&quot;\n\nAbout the Author\nDr. Wayne W. Dyer is an internationally renowned author and speaker in the field of self-development. He has written numerous bestselling books and has created a number of audios and videos. He has appeared on thousands of television and radio programs, including The Today Show and Oprah.\n\nIf you like, support the author &amp; buy his stuff!","torrent":{"xt":"urn:btih:c60bb9281c0c7cce24d6bcd0ed9bfa5f9e8d2814","amp;dn":"Change+Your+Thoughts%2C+Change+Your+Life+Living+the+Wisdom+of+the+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c60bb9281c0c7cce24d6bcd0ed9bfa5f9e8d2814","infoHashBuffer":{"type":"Buffer","data":[198,11,185,40,28,12,124,206,36,214,188,208,237,155,250,95,158,141,40,20]},"announce":[],"urlList":[]}}