{"title":"EnigmaT Set Rips { Cuts } - July 11th, 2013","uid":8673973,"size":1048625189,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c693a56f64c9126de1d96ab0abb7777b4731c589&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+July+11th%2C+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EnigmaT","files":103,"time":1373551583,"description":"Abandoned Rainbow - Tornated (Uplifting Mix) (Cut From Summerville Set)-enTc.mp3\nAgnelli &amp; Nelson pres. A&amp;N Project - Quest (Adam Ellis Remix) (Cut From Nadz Set)-enTc.mp3\nAicos - Follow The Light (Original Mix) (Cut From Saux Set)-enTc.mp3\nAirborn - Route 60 (Original Mix) (Cut From ReOrder Set)-enTc.mp3\nAlean &amp; Skyy - Wattzo (Cut From Pit Set)-enTc.mp3\nAlex Fisher feat. Llucky Share - Swim To The Light (Dub Mix) (Cut From Marlo Set)-enTc.mp3\nAlex M.O.R.P.H. - Sucker Punch (Sied van Riel Remix) (Cut From Ferry Set)-enTc.mp3\nAlmer - Things We Do (LTN Remix) (Cut From Ruben Set)-enTc.mp3\nAmadeus vs Aly &amp; Fila - A Dream Of Peace (Manuel Le Saux Remix) (Cut From Saux Set)-enTc.mp3\nAndrew Bayer &amp; James Grant - Living (Cut From Ruben Set)-enTc.mp3\nAndrew Benson - More (Original Mix) (Cut From Anderson Set)-enTc.mp3\nAndrew Benson - Riomaggiore (Mizar B Remix) (Cut From Ruben Set)-enTc.mp3\nAndrew Benson - Riomaggiore (Original Mix) (Cut From Anderson Set)-enTc.mp3\nAndrew StetS - Between Waters (Cut From Aurosonic Set)-enTc.mp3\nAndy Woldman &amp; DJ T.H. feat. Holly Strickland - Calling Out Your Name (ID Remix) (Cut From Summerville Set)-enTc.mp3\nAraya - Perception (Cut From Kandi Set)-enTc.mp3\nBardalimov - Four Points (Alex Blest Remix) (Cut From Summerville Set)-enTc.mp3\nBluEye - Reflections (Cold Rush Remix) (Cut From Akira Set)-enTc.mp3\nBoom Jinx, Maor Levi &amp; Ashley Tomberlin - When You Loved Me (Juventa &amp; Toby Hedges Remix) (Cut From Super8 Set)-enTc.mp3\nBrad Ashtar - UNTITLED (Original Mix) (Cut From Summerville Set)-enTc.mp3\nC-Systems Feat. Hanna Finsen - Leading Destiny (Odonbat Remix) (Cut From Suzy Set)-enTc.mp3\nClay C - On My Way (Cut From Atkinson Set)-enTc.mp3\nCorderoy - Mechanical Tears (Jordan Suckley Remix) (Cut From Kandi Set)-enTc.mp3\nCormac Murphy - Vapour (Cut From Solarstone Set)-enTc.mp3\nD.E.C.A.D.A. - Vitam (Proff Remix) (Cut From Anderson Set)-enTc.mp3\nD.M.P - Deep On (Cut From Slang Set)-enTc.mp3\nDale Corderoy - Mechanical Tears (EDU Club Mix) (Cut From Eteson Set)-enTc.mp3\nDaniel Meyer - Next Move (Original Mix) (Cut From Summerville Set)-enTc.mp3\nDanny Stubbs - Lost In Me (Original Mix) (Cut From Anderson Set)-enTc.mp3\nDanny Stubbs - Lost In Me (Original Mix) (Cut From Solarstone Set)-enTc.mp3\nDart Rayne &amp; Yura Moonlight and Sarah Lynn - Silhouette (Johann Stone Remix) (Cut From Ferry Set)-enTc.mp3\nDashka - The Box (Cut From Jules Set)-enTc.mp3\nDavey Asprey - Chimera (Cut From Eteson Set)-enTc.mp3\nDK8 - Murder Was The Bass (Klonez Remix) (Cut From Atkinson Set)-enTc.mp3\nDreamy - Always With Me (Sunset Emotional Mix) (Cut From Summerville Set)-enTc.mp3\nDreamy - Memoral Memories (Chris Voro Remix) (Cut From Xabi Set)-enTc.mp3\nDuality pres. Bad Robots - Facepalm (Hachen Stein &amp; Bistronics Remix) (Cut From Akira Set)-enTc.mp3\nEagles Butterflies - Mantra (Cut From Ruben Set)-enTc.mp3\nEddie Bitar - Kaboom (Original Mix) (Cut From Bitar Set)-enTc.mp3\nErick Strong &amp; Eskova - Another Day Of Life (NoMosk Remix) (Cut From Suzy Set)-enTc.mp3\nEthillias - Imaginary (Markus Hakala Remix) (Cut From Ruben Set)-enTc.mp3\nFilip Marak &amp; N-Rico - Psycho (Manuelle Lagunes Remix) (Cut From Summerville Set)-enTc.mp3\nGrizli Man - Evolution (Kaimo K Remix) (Cut From Summerville Set)-enTc.mp3\nGrizli Man - Evolution (Original Mix) (Cut From Summerville Set)-enTc.mp3\nI.D - Tri-Polar (Cut From Atkinson Set)-enTc.mp3\nIdo - Connected (Cut From Pit Set)-enTc.mp3\nJackob Roenald - Mysterious Disappearance (Original Emotional Mix) (Cut From Summerville Set)-enTc.mp3\nJamie Drummond - Childsplay (Cut From Nadz Set)-enTc.mp3\nJarod Meyer - Whispers (Cut From Slang Set)-enTc.mp3\nJoseph Fischer &amp; Simon Latham - Ordinary Girl (John Gibbons Remix) (Cut From Aurosonic Set)-enTc.mp3\nKelly Andrew - The Incursion (Afternova Remix) (Cut From Uplift Set)-enTc.mp3\nKelly Andrew - The Incursion (Ikerya Project Club Remix) (Cut From Saux Set)-enTc.mp3\nKris Maydak - UNTITLED (Cut From Kandi Set)-enTc.mp3\nLange - A Different Shade Of Crazy (Original Mix) (Cut From Super8 Set)-enTc.mp3\nLange feat. The Morrighan - Follow Me (2013 Rework) (Cut From Lange Set)-enTc.mp3\nLeftwing &amp; Kody - Deep In (Cut From Palagano Set)-enTc.mp3\nLiam Melly &amp; Jon Martin - Dark Matters (Cut From Nadz Set)-enTc.mp3\nLost Emotions feat. Anthya - Heal (Mike van Fabio Dub Mix) (Cut From Uplift Set)-enTc.mp3\nLost Emotions Feat. Anthya - Heal (Mike van Fabio Remix) (Cut From Suzy Set)-enTc.mp3\nLudovico Einaudi - Una Mattina (10Dens Bootleg) (Cut From Ruben Set)-enTc.mp3\nMaarcos - Blaze (Dirty South Edit) (Cut From Ferry Set)-enTc.mp3\nMarc Poppcke - Breakable (Namatjira Remix) (Cut From Solarstone Set)-enTc.mp3\nMaRLo - The Future (Cut From Marlo Set)-enTc.mp3\nMatt Eray - Frosty Kiss (Original Mix) (Cut From Anderson Set)-enTc.mp3\nMatt Eray - Nowhere But Here (Original Mix) (Cut From Anderson Set)-enTc.mp3\nMax Freegrant &amp; Jerome Isma-Ae - Thrill Me (Steve Haines Remix) (Cut From Super8 Set)-enTc.mp3\nMeridian - Exit  (Cut From Bobina Set)-enTc.mp3\nMichael De Kooker feat. Nanje Nowack - Awake (Original Mix) (Cut From Anderson Set)-enTc.mp3\nMiroslav Vrlik &amp; Martin Jurenka - Crossroads (Original Mix) (Cut From Anderson Set)-enTc.mp3\nMiss Nine - Turn Up The Love (Instrumental Mix) (Cut From Ferry Set)-enTc.mp3\nMobil - One Morning (Cut From Bobina Set)-enTc.mp3\nMoonbeam with. Matvey Emerson - Alive (Paul Thomas Remix) (Cut From Pit Set)-enTc.mp3\nMr. Pit - Wonderland (Cut From Pit Set)-enTc.mp3\nMuska - Top Of The Trees (Cut From Palagano Set)-enTc.mp3\nNAGO - Architectures (Original Mix) (Cut From Summerville Set)-enTc.mp3\nOrbion &amp; Quantum feat. Irina Makosh - I Am Who I Am (Cut From Ruben Set)-enTc.mp3\nPapercut feat. Kristin Mainhart - Adrift (Slang &amp; Technodreamer Remix) (Cut From Slang Set)-enTc.mp3\nPatrick Hagenaar feat. Sarah McLeod - Magik (Vocal Club Mix) (Cut From Anderson Set)-enTc.mp3\nPaul Legvand - Soul (Original Mix) (Cut From Anderson Set)-enTc.mp3\nPaul Pele - Goodbye (UDM Remix - Daniel Kandi's Fix) (Cut From Kandi Set)-enTc.mp3\nPaul Pele - Goodbye (UDM Remix) (Cut From Nadz Set)-enTc.mp3\nPeter Hullsmans - Aggression (Cut From Atkinson Set)-enTc.mp3\nRafael Osmo pres. On &amp; Off - Caplet (-Short- Cut From Pit Set)-enTc.mp3\nReOrder pres. Electric Revolution - Beach Party (Original Quest4Trance Beach Anthem) (Cut From ReOrder Set)-enTc.mp3\nRigby - Earth Meets Water (Vida Bootleg) (Cut From Claessen Set)-enTc.mp3","torrent":{"xt":"urn:btih:c693a56f64c9126de1d96ab0abb7777b4731c589","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+July+11th%2C+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c693a56f64c9126de1d96ab0abb7777b4731c589","infoHashBuffer":{"type":"Buffer","data":[198,147,165,111,100,201,18,109,225,217,106,176,171,183,119,123,71,49,197,137]},"announce":[],"urlList":[]}}