{"title":"THE X-FILES - SKIN - BEN MEZRICH (HarperCollins)","uid":7994300,"size":1204121,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c6c827fa845c30fde9d0093ee10b9c7854912487&amp;dn=THE+X-FILES+-+SKIN+-+BEN+MEZRICH+%28HarperCollins%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STFmaryville","files":-1,"time":1357571857,"description":"The X-Files : Skin by Ben Mezrich\n\nIt's a fairly common, if ghoulish, procedure: the 'harvesting' of skin from corpses for temporary use on emergency burn victims until their own grafts are ready. But when a team of moonlighting medical students accidentally takes skin from the wrong donor, the results are catastrophic: a New York City hospital ward is destroyed in a psychotic bloodbath, and an elderly professor, admitted for a routine skin graft, is suddenly the city's most wanted fugitive.\n\nAgents Fox Mulder and Dana Scully are the only ones to suspect something more ominous than a medical procedure gone awry. As the FBI agents investigating the X-Files, strange and inexplicable cases the Bureau wants to keep hidden, Mulder and Scully are determined to track down the forces they suspect are behind the murderer. While the police hunt the fleeing professor, Mulder and Scully track the skin that was mistakenly grafted onto him. The trail leads from the morgue to the headquarters of a cutting-edge biotech company.\n\nSoon Mulder and Scully are in Thailand, searching the jungles for an abandoned MASH Unit, where napalm victims were treated with an amazing recovery rate even though none of the hundreds of men who were nursed back to health ever returned to their families. Scully is looking for an experimental medical technology with disastrous side effects. Mulder suspects the stakes are even higher, a fear gruesomely confirmed as they begin to uncover an unholy and totally deniable alliance between a battle-trained plastic surgeon, international politicians, and a legendary Thai monster known as the 'Skin-Eater'.","torrent":{"xt":"urn:btih:c6c827fa845c30fde9d0093ee10b9c7854912487","amp;dn":"THE+X-FILES+-+SKIN+-+BEN+MEZRICH+%28HarperCollins%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6c827fa845c30fde9d0093ee10b9c7854912487","infoHashBuffer":{"type":"Buffer","data":[198,200,39,250,132,92,48,253,233,208,9,62,225,11,156,120,84,145,36,135]},"announce":[],"urlList":[]}}