{"title":"Duke Ellington 24 Bit Vinyl Pack","uid":8488124,"size":12322699025,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c7967b0b0dc46bd9064bbc2abb1e152fa7ac1c9e&amp;dn=Duke+Ellington+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1368927596,"description":" \n  Duke Ellington 24 Bit Vinyl Pack\n  \n  Genre: Jazz\n  Styles: Big Band, Early Jazz, Standards, Swing, Progressive Jazz\n  Source: Vinyl\n  Bit Rates: ~ 2,800 - 3,100 kbps\n  Bits Per Sample: 24\n  Sample Rate: 96,000 Hz\n\n  Duke Ellington's Jazz Violin Session\n  With Charles Mingus &amp; Max Roach - Money Jungle\n  Meets Coleman Hawkins\n  And His Orchestra \n  And His Orchestra - Ellington Jazz Party in Stereo\n  And Count Basie - First Time\n  Unknown Session 1960\n  Sophisticated Ellington\n  Festival Session\n  Ellington Indigos\n  And Johnny Hodges \n  And John Coltrane\n  Bill Berry and his Duke Ellington All-Stars - For Duke\n\n Duke Ellington was the most important composer in the history of jazz as well as being a bandleader who held his large group together continuously for almost 50 years. The two aspects of his career were related; Ellington used his band as a musical laboratory for his new compositions and shaped his writing specifically to showcase the talents of his bandmembers, many of whom remained with him for long periods. Ellington also wrote film scores and stage musicals, and several of his instrumental works were adapted into songs that became standards. In addition to touring year in and year out, he recorded extensively, resulting in a gigantic body of work that was still being assessed a quarter century after his death.\n\n  Ellington was the son of a White House butler, James Edward Ellington, and thus grew up in comfortable surroundings. He began piano lessons at age seven and was writing music by his teens. He dropped out of high school in his junior year in 1917 to pursue a career in music. At first, he booked and performed in bands in the Washington, D.C., area, but in September 1923 the Washingtonians, a five-piece group of which he was a member, moved permanently to New York, where they gained a residency in the Times Square venue The Hollywood Club (later The Kentucky Club). They made their first recordings in November 1924, and cut tunes for different record companies under a variety of pseudonyms, so that several current major labels, notably Sony, Universal, and BMG, now have extensive holdings of their work from the period in their archives, which are reissued periodically.\n\n  The group gradually increased in size and came under Ellington's leadership. They played in what was called &quot;jungle&quot; style, their sly arrangements often highlighted by the muted growling sound of trumpeter James &quot;Bubber&quot; Miley. A good example of this is Ellington's first signature song, &quot;East St. Louis Toodle-oo,&quot; which the band first recorded for Vocalion Records in November 1926, and which became their first chart single in a re-recorded version for Columbia in July 1927.\n\n  The Ellington band moved uptown to The Cotton Club in Harlem on December 4, 1927. Their residency at the famed club, which lasted more than three years, made Ellington a nationally known musician due to radio broadcasts that emanated from the bandstand. In 1928, he had two two-sided hits: &quot;Black and Tan Fantasy&quot;/&quot;Creole Love Call&quot; on Victor (now BMG) and &quot;Doin' the New Low Down&quot;/&quot;Diga Diga Doo&quot; on OKeh (now Sony), released as by the Harlem Footwarmers. &quot;The Mooche&quot; on OKeh peaked in the charts at the start of 1929.\nWhile maintaining his job at The Cotton Club, Ellington took his band downtown to play in the Broadway musical Show Girl, featuring the music of George Gershwin, in the summer of 1929. The following summer, the band took a leave of absence to head out to California and appear in the film Check and Double Check. From the score, &quot;Three Little Words,&quot; with vocals by the Rhythm Boys featuring Bing Crosby, became a number one hit on Victor in November 1930; its flip side, &quot;Ring Dem Bells,&quot; also reached the charts.\n\n  The Ellington band left The Cotton Club in February 1931 to begin a tour that, in a sense, would not end until the leader's death 43 years later. At the same time, Ellington scored a Top Five hit with an instrumental version of one of his standards, &quot;Mood Indigo&quot; released on Victor. The recording was later inducted into the Grammy Hall of Fame. As &quot;the Jungle Band,&quot; the Ellington Orchestra charted on Brunswick later in 1931 with &quot;Rockin' in Rhythm&quot; and with the lengthy composition &quot;Creole Rhapsody,&quot; pressed on both sides of a 78 single, an indication that Ellington's goals as a writer were beginning to extend beyond brief works. (A second version of the piece was a chart entry on Victor in March 1932.) &quot;Limehouse Blues&quot; was a chart entry on Victor in August 1931, then in the winter of 1932, Ellington scored a Top Ten hit on Brunswick with one of his best-remembered songs, &quot;It Don't Mean a Thing (If It Ain't Got That Swing),&quot; featuring the vocals of Ivie Anderson. This was still more than three years before the official birth of the swing era, and Ellington helped give the period its name. Ellington's next major hit was another signature song for him, &quot;Sophisticated Lady.&quot; His instrumental version became a Top Five hit in the spring of 1933, with its flip side, a treatment of &quot;Stormy Weather,&quot; also making the Top Five","torrent":{"xt":"urn:btih:c7967b0b0dc46bd9064bbc2abb1e152fa7ac1c9e","amp;dn":"Duke+Ellington+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c7967b0b0dc46bd9064bbc2abb1e152fa7ac1c9e","infoHashBuffer":{"type":"Buffer","data":[199,150,123,11,13,196,107,217,6,75,188,42,187,30,21,47,167,172,28,158]},"announce":[],"urlList":[]}}