{"title":"Business Intelligence with MicroStrategy Cookbook (2013) Gooner","uid":12440244,"size":42203156,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c7a898a68ea2ddc56ec32fa18b65e2936ee71f41&amp;dn=Business+Intelligence+with+MicroStrategy+Cookbook+%282013%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":2,"time":1442571664,"description":"Publisher: Packt Publishing (October 25, 2013)\nLanguage: English\nISBN-10: 1782179755\nISBN-13: 978-1782179757\n\nMicroStrategy products allow you to take control of your business intelligence, and this book gives you the know-how to undertake successful data analysis. With over 90 practical recipes, it's a fully comprehensive cookbook.\n\nOverview\n\nLearn about every step of the BI project, starting from the installation of a sample database\nDesign web reports and documents\nConfigure, develop, and use the Mobile Dashboard\nMaster data discovery with Visual Insight and MicroStrategy Cloud Express\nLearn with the help of practical, real-life examples and screencasts for every exercise\nIn Detail\n\nBusiness intelligence is becoming more important by the day, with cloud offerings and mobile devices gaining wider acceptance and achieving better market penetration. MicroStrategy Reporting Suite is a complete business intelligence platform that covers all the data analysis needs of an enterprise. Scorecards, dashboards, and reports can be explored and delivered on desktop, the Web, mobile devices, and the Cloud. With the latest Visual Insight tool, MicroStrategy brings the power of BI to the business users, allowing them to discover information without the help of IT personnel.\n\nBusiness Intelligence with MicroStrategy Cookbook covers the full cycle of a BI project with the MicroStrategy platform, from setting up the software to using dashboards in the cloud and on mobile devices. This book uses step-by-step instructions to teach you everything from the very basics to the more advanced topics. We will start by downloading and installing the software and a well-known sample SQL Server database. Then, one brick at a time, we will construct a fully-featured BI solution with a web interface, mobile reporting, and agile analytics.\n\nThe chapters are ordered by increasing difficulty, and each one builds on top of the preceding chapter so that the learning process is progressive. The examples given in this book are practical, and you will be able to see the immediate result of your efforts. We will first cover setting up the platform, including the creation of the metadata and the different objects that are part of a BI project: tables, attributes, and metrics. Then, we take a look at how to create and analyze reports, charts, documents, and dashboards, as well as how to manipulate data with the desktop application, the web Interface, and an iPad device.\n\nThe last part of the book is dedicated to advanced topics like the new agile analytics technology from MicroStrategy, where we cover both Visual Insight and MicroStrategy Cloud Express. Whether you are a database developer, data analyst, or a business user, Business Intelligence with MicroStrategy Cookbook will get you up to speed with one of the most powerful BI platforms on the market with the smallest possible investment of time and money.\n\nWhat you will learn from this book\n\nInstall a complete MicroStrategy server (including a web interface)\nCreate a project and connect to a data warehouse\nBuild reports, graphs, documents, dashboards, and interactive visualizations\nConfigure and use MicroStrategy on mobile devices\nAdd values to the data with month to date and year to date analyses\nUse In-Memory technology for instant results and data discovery\nAnalyze data in the cloud with MicroStrategy Cloud Express\n\nApproach\n\nWritten in a cookbook style, this book will teach you through the use of recipes with examples and illustrations. Each recipe contains step-by-step instructions about everything necessary to execute a particular task","torrent":{"xt":"urn:btih:c7a898a68ea2ddc56ec32fa18b65e2936ee71f41","amp;dn":"Business+Intelligence+with+MicroStrategy+Cookbook+%282013%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c7a898a68ea2ddc56ec32fa18b65e2936ee71f41","infoHashBuffer":{"type":"Buffer","data":[199,168,152,166,142,162,221,197,110,195,47,161,139,101,226,147,110,231,31,65]},"announce":[],"urlList":[]}}