{"title":"Singing Dogs - Jingle Bells Ultimate Mix Loop","uid":6814395,"size":113847065,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c8993e8900db59859e0cee2ab7d358370bb8dae2&amp;dn=Singing+Dogs+-+Jingle+Bells+Ultimate+Mix+Loop&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Phaedra74","files":1,"time":1321145139,"description":"O.K., here's a real Christmas treat.  It's that perennial Xmas classic, Jingle Bells, sung by (or rather, barked by) The Singing Dogs.  Yay!\n\nBut this version has a special Pirate Bay twist.  It has been looped 49 times. That's right, 79 minutes of repetitive holiday enjoyment! In an effort to contribute to my office Christmas party this year, I made a non-stop montage of barking holiday cheer.  What was originally just 1 minute and 40 seconds of pure irritation is now extended to nearly 80 minutes of audio torture. It fills up an entire CD! I am happy to share this little bit of nonsense with the world.\n\nUsing Adobe Audition, I carefully spliced the song over and over again, without missing a beat. It segues seamlessly, 49 times! It's the ultimate holiday party mix. I saved the file as a single 111MB MP3, at 192kb/s.\n\n\n\nThis Jingle Bells ultimate mix has many uses:\n\nAnnoy your pesky neighbours!\n\nClear the room of unwanted party guests still hanging around at 3AM!\n\nBlare on speakers in your front yard, so that your Christmas display not only shocks the visual senses, but the audio senses as well!\n\nPlay in repeat mode on your stereo while you're away to make burglars think you have a bunch of big dogs around!\n\nTest out enforcement of your community's nuisance ordinances!\n\nIf you are a radio D.J., play it on air and see how long it takes before people start calling you up to complain!\n\n\n\nI hope you enjoy my little creation.  Have fun and don't forget to seed!","torrent":{"xt":"urn:btih:c8993e8900db59859e0cee2ab7d358370bb8dae2","amp;dn":"Singing+Dogs+-+Jingle+Bells+Ultimate+Mix+Loop","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8993e8900db59859e0cee2ab7d358370bb8dae2","infoHashBuffer":{"type":"Buffer","data":[200,153,62,137,0,219,89,133,158,12,238,42,183,211,88,55,11,184,218,226]},"announce":[],"urlList":[]}}