{"title":"[Kung Fu] Lotus And Sword - Legacy Of The Zen Princess (Volker G","uid":3859895,"size":335121248,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c8f37b82baf37866f47aba7e22b62a486489b80e&amp;dn=%5BKung+Fu%5D+Lotus+And+Sword+-+Legacy+Of+The+Zen+Princess+%28Volker+G&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"JamesKees","files":9,"time":1193420950,"description":"Lotus And Sword - Legacy Of The Zen Princess (Volker Grohskopf, 2005) ES\n\nJourney into one of the most isolated, breathtaking and mystical places on the Earth and experience the phenomenal skill of Kung Fu performed with deadly perfection by the celebrated monks of the Shaolin Temple, and for the first exclusive time by the female masters of the Yongtai Nunnery. This captivating and beautifully shot film tells the story of China?s first Zen monastery, founded 1500 years ago upon the Holy Mountain Songshan as the centre of Zen Buddhism, and of the Yongtai Nunnery, established by a defiant Chinese Princess who dared walk the path of Shaolin and learn the arts of Kung Fu. Opening its doors to cameras for the first time, the Yongtai Nunnery finally reveals hidden wonders to parallel the mysticism of the Shaolin Monastery, providing insight into the education and art of China?s Kung Fu nuns who demonstrate, with astonishing clarity, their skills as true warriors of Shaolin. Proving themselves equal to the Shoalin Monks and to China?s most respected Zen Master, today?s woman of Yongtai re-enact the ferocious fight sequences, Lotus &amp; Sword, which pitted Nuns against the Warriors of Shaolin in order to achieve the recognition sought centuries earlier by China?s legendary Zen Princess.\n &lt;a href=&quot;\nhttp://chaos.com/product/shaolin_lotus_sword_legacy_of_the_zen_princess_647721_213117.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://chaos.com/product/shaolin_lotus_sword_legacy_of_the_zen_princess_647721_213117.html&lt;/a&gt;\n\nP.S.\nSubtitles file for &quot;New Crouching Tiger, Hidden Dragon&quot; available at:\n\n_________________\nDo not break the share chain! Once you have completed download, seed for the next person in the chain as you possibly can. If this torrent link is dead or not well seeded, PM me for a re-seed!\n","torrent":{"xt":"urn:btih:c8f37b82baf37866f47aba7e22b62a486489b80e","amp;dn":"%5BKung+Fu%5D+Lotus+And+Sword+-+Legacy+Of+The+Zen+Princess+%28Volker+G","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8f37b82baf37866f47aba7e22b62a486489b80e","infoHashBuffer":{"type":"Buffer","data":[200,243,123,130,186,243,120,102,244,122,186,126,34,182,42,72,100,137,184,14]},"announce":[],"urlList":[]}}