{"title":"North Dallas Forty Dvdrip H264 Bookerdog.mp4","uid":4976825,"size":925842454,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c8f6d883c984d6136dd8a799eee271ec68751976&amp;dn=North+Dallas+Forty+Dvdrip+H264+Bookerdog.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bookerdog","files":-1,"time":1246039836,"description":"Category\tDramas, Comedies, Recommended, Classic\nStarring\tNick Nolte, Charles Durning, Brian Dennehy, Dabney Coleman, Bo Svenson, Steve Forrest, John Matuszak, Dayle Haddon, Mac Davis\nDirector\tTed Kotcheff\nCinematographer\tPaul Lohmann\nComposer\tJohn Scott\nEditor\tJay Kamen\nProducer\tFrank Yablans\nProduction Designer\tAlfred Sweeney\nScreenwriter\tTed Kotcheff, Frank Yablans, Peter Gent\nNick Nolte, Dayle Haddon, Charles Durning, Bo Svenson, Steve Forrest, Mac Davis - Dir:Ted Kotcheff Nick Nolte stars in this brutally honest and hysterically funny movie about one man's rebellion against the bureaucratic, manipulative world of professional football.\nThis screen adaptation of Peter Gent's best-selling novel about labor abuse in the NFL is one of the greatest gridiron movies ever made.\n\nNORTH DALLAS FORTY is a funny and insightful peek into the world of professional football, adapted from Peter Gent's novel. Phillip Elliott is an aging wide receiver for the North Dallas Bulls who still delivers on the field--despite the many past injuries that keep him in almost constant pain. Almost as painful for him is the constant abuse heaped on the players by management. Now Phillip's determined to do something about it. The corporate bigwigs, however, are growing increasingly annoyed by Elliott's complaining. Will the athlete cave in to the pressure and keep his mouth shut or fight the executives at the risk of ending his career? Featuring a stellar cast that includes Charles Durning, Mac Davis, and Nick Notle, this film ranks with HORSE FEATHERS, SEMI-TOUGH, and THE LONGEST YARD as one of the greatest football films of all time.","torrent":{"xt":"urn:btih:c8f6d883c984d6136dd8a799eee271ec68751976","amp;dn":"North+Dallas+Forty+Dvdrip+H264+Bookerdog.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8f6d883c984d6136dd8a799eee271ec68751976","infoHashBuffer":{"type":"Buffer","data":[200,246,216,131,201,132,214,19,109,216,167,153,238,226,113,236,104,117,25,118]},"announce":[],"urlList":[]}}