{"title":"Stossel.2013.07.25.[Whats up with Detroit].FBN.CF.avi","uid":8747452,"size":351572782,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c948b8638b972c6359970780c7bc9d6453ea7d5c&amp;dn=Stossel.2013.07.25.%5BWhats+up+with+Detroit%5D.FBN.CF.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"skJGZV6z","files":-1,"time":1374956836,"description":"----------\n\nSTOSSEL - [What's up with Detroit?] - Fox Business Network\n2013, July 25, Thursday\n\nXvid/MP3 AVI - encoded from medium quality ReplayTV stream\n\n----------\n\n[excerpted from John Stossel's blog:]\n\nIn 1950, when I was three-years-old, Detroit was the richest city in America. Now it's the biggest U.S. city ever to declare bankruptcy.\n\nFOX2 Detroit Reporter, Charlie LeDuff, says excessive spending will land other cities in the same position.\n\nAndrew Rodney, &quot;Deforce&quot; Filmmaker, says government central planning displaced neighborhoods taking ownership of their communities.\n\nWaste and Abuse: Shikha Dalmia, Reason Foundation senior policy analyst, says crony capitalism and union demands for increased benefits left the city bankrupt. Darcy Olsen, Goldwater Institute President, says Detroit's decline could have been avoided with privatized public services. Sandy Springs, Georgia, did that.\n\nBig Spending: Ken Sikkema, Former Michigan Majority leader, says politicians spent too much and expected bailouts to fix their mistakes.\n\nA Tour of Detroit's Ruins: About two thirds of its population have left town. The city is a mess. Whole neighborhoods have crumbled. Special correspondent Kennedy tours Detroit with community activists and sees what remains of the city.\n\nHope: Rodney Lockwood, &quot;Belle Isle&quot; author, offers to buy Detroit's Belle Isle Park for $1 billion and turn it into a free market commonwealth. Although this would eliminate almost 20% of city's debt, Detroit City Council members like Andre Spivey say no! He says the parks and the $2.5 billion of artwork in the government subsidized museum shouldn't be sold. &quot;They belong to the people!&quot;","torrent":{"xt":"urn:btih:c948b8638b972c6359970780c7bc9d6453ea7d5c","amp;dn":"Stossel.2013.07.25.%5BWhats+up+with+Detroit%5D.FBN.CF.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c948b8638b972c6359970780c7bc9d6453ea7d5c","infoHashBuffer":{"type":"Buffer","data":[201,72,184,99,139,151,44,99,89,151,7,128,199,188,157,100,83,234,125,92]},"announce":[],"urlList":[]}}