{"title":"Idiocracy - deutsch","uid":4199605,"size":714655926,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c968298e8bbade046098e1bf1234d7f8f9c54e4d&amp;dn=Idiocracy+-+deutsch&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"inkorrupt","files":2,"time":1211421565,"description":"Filmdaten\nDeutscher Titel: \tIdiocracy\nOriginaltitel: \t        Idiocracy\nProduktionsland: \tUSA\nErscheinungsjahr: \t2006\nLÃƒÂ¤nge (PAL-DVD): \t84:20 Minuten\nOriginalsprache: \tEnglisch\nAltersfreigabe: \tFSK 12\nCodec:                  XVID-MPEG4\n\n\nIdiocracy ist eine im Jahre 2006 erschienene Science-Fiction-KomÃƒÂ¶die des amerikanischen Regisseurs Mike Judge. Er zeigt eine Dystopie der Welt des Jahres 2505, in der eine geistig degenerierte Gesellschaft vor ihrem Ende steht.\nInhaltsverzeichnis\n[Verbergen]\n\n\nHandlung\n\nZu Beginn des Films wird unsere heutige Gesellschaft persifliert und gegenwÃƒÂ¤rtige Entwicklungen beschrieben. Wie in Deutschland vor einigen Jahren wird auch hier der Missstand thematisiert, dass Akademiker keinen Drang verspÃƒÂ¼ren, Kinder in die Welt zu setzen. Der Film illustriert dies an einem (zunÃƒÂ¤chst) jungen Akademiker-Ehepaar, das ÃƒÂ¼ber ca. 15 Jahre hinweg immer wieder neue Argumente dafÃƒÂ¼r anfÃƒÂ¼hrt, zunÃƒÂ¤chst ohne Kinder weiterleben zu wollen, bis es fÃƒÂ¼r beide irgendwann zu spÃƒÂ¤t geworden ist. Kontrastiert wird dieses Bild durch verschiedene andere Charaktere, die man der Unterschicht zuordnen kÃƒÂ¶nnte, sich aber rasant vermehren.\n\nEine Sondereinheit der US Army plant zeitgleich die Operation Winterschlaf. Es soll ÃƒÂ¼berprÃƒÂ¼ft werden, ob es mÃƒÂ¶glich ist, Menschen ÃƒÂ¼ber einen lÃƒÂ¤ngeren Zeitpunkt in einen gefriergetrockneten Zustand zu versetzen und sie nach einem Jahr wieder zu beleben. Als Versuchspersonen wÃƒÂ¤hlt der verantwortliche Leiter den Armee-Bibliothekar Joe Bauer, den durchschnittlichsten Durchschnittsamerikaner und die afro-amerikanische Prostituierte Rita. Beide wurden ausgewÃƒÂ¤hlt, da sie ohne AngehÃƒÂ¶rige leben, und sich somit niemand ÃƒÂ¼ber deren Verbleiben wÃƒÂ¤hrend des Versuches wundern wÃƒÂ¼rde.\n\nBereits kurz nach Beginn des Versuchs wird der Verantwortliche wegen eines Sexskandals verhaftet, seine Spezialeinheit wird aufgelÃƒÂ¶st und der gesamte StÃƒÂ¼tzpunkt mitsamt den KÃƒÂ¤ltekammern der Versuchspersonen abgerissen und auf eine MÃƒÂ¼lldeponie verfrachtet. In den folgenden Jahrhunderten verdummte die Gesellschaft immer weiter, selbst grundlegende Infrastrukturen wie die MÃƒÂ¼llabfuhr konnten nicht lÃƒÂ¤nger aufrechterhalten werden. Durch diese MissstÃƒÂ¤nde kommt es im Jahr 2505 dann zu einer MÃƒÂ¼lllawine auf einer der gewaltigen MÃƒÂ¼lldeponien. Dadurch werden die KÃƒÂ¤ltekammern wieder freigelegt und beschÃƒÂ¤digt, so dass diese sich ÃƒÂ¶ffnen und Joe und Rita in einer ihnen vÃƒÂ¶llig fremden Welt erwachen. Insbesondere Joe kann sich in dieser Gesellschaft, in der der Film Arsch fÃƒÂ¼r das blosse Zeigen eines menschliches Gesaeses ÃƒÂ¼ber 90 Minuten hinweg, den Oscar fÃƒÂ¼r das beste Drehbuch erhielt, absolut nicht zurechtfinden und gerÃƒÂ¤t schnell mit dem Gesetz in Konflikt. Da er zudem keine gÃƒÂ¼ltige IdentitÃƒÂ¤t besitzt, muss er direkt in ein GefÃƒÂ¤ngnis, wo ihm ein Automat seine neue IdentitÃƒÂ¤t als Nicht Sicher verpasst. Bei einem anschlieÃƒ?enden IQ-Test, der herausfinden sollte, welche Art von Arbeit er im GefÃƒÂ¤ngnis zu leisten in der Lage ist, stellt sich heraus, dass er (mit einem IQ von gerade mal 100) der mit Abstand intelligenteste Mensch der Erde ist (woran sich nebenbei die Unkenntnis des Drehbuchautors erkennen lÃƒÂ¤sst, wie der Intelligenzquotient definiert ist). Daraufhin beruft ihn der aktuelle PrÃƒÂ¤sident der USA, Camacho, ein ehemaliger Rapper, Wrestler und Pornostar zum Innenminister mit besonderen Aufgaben. Dieser erwartet von ihm, dass er alle Probleme der vÃƒÂ¶llig maroden Gesellschaft fÃƒÂ¼r ihn lÃƒÂ¶sen kann. Weil das Volk hungert, will Joe zuerst die marode Landwirtschaft sanieren. Bei einem Ortstermin stellt er fest, dass alle Felder nicht mit Wasser, sondern mit einem grÃƒÂ¼nen Gatorade-ÃƒÂ¤hnlichen GetrÃƒÂ¤nk bewÃƒÂ¤ssert werden. Nur mÃƒÂ¼hsam gelingt es ihm, seine Kabinettskollegen, allesamt geistige Tiefflieger, zu ÃƒÂ¼berzeugen, es einmal mit Wasser zu versuchen. Dadurch allerdings verliert der einflussreiche Brawndo-Konzern, unter anderem ErnÃƒÂ¤hrungsmulti, Hersteller des grÃƒÂ¼nen GetrÃƒÂ¤nks, und nebenbei auch Besitzer der GesundheitsbehÃƒÂ¶rden und des Verbraucherschutzes, sein absolutes Monopol und muss daraufhin all seine Angestellten, immerhin 50% der GesamtbevÃƒÂ¶lkerung, entlassen. Dadurch entstandene Unruhen fÃƒÂ¼hren zu einer Rehabilitierung Joes, was nichts anderes als eine ÃƒÂ¶ffentliche Hinrichtung darstellt.\n\nDie ebenfalls in der Zukunft gestrandete Rita kann allerdings das schlimmste abwenden, indem sie wÃƒÂ¤hrend des laufenden Rehabilitierungsverfahrens Bilder der spriessenden Felder an den Veranstaltungsort ÃƒÂ¼bertrÃƒÂ¤gt. PrÃƒÂ¤sident Camacho ist davon so begeistert, dass er Nicht Sicher zunÃƒÂ¤chst zum VizeprÃƒÂ¤sidenten und anschliessend sogar zu seinem Nachfolger erklÃƒÂ¤rt.\n\nGesellschaftskritik \n\nIn Idiocracy sind gesellschaftskritische Elemente offensichtlich. Indem sich die dystopische Gesellschaft nur noch fÃƒÂ¼r substanzlose OberflÃƒÂ¤chlichkeiten und BedÃƒÂ¼rfnisbefriedigung interessiert, kommt es zu einem dramatischen Kultur- und Werteverlust. Ferner wird Kritik geÃƒÂ¼bt an dem gesellschaftlichen Einfluss der Konzerne (&quot;corporations&quot;) auf diesen Prozess (einige Konzerne wie z.B. die Kaffeefirma Starbucks, die Schnellrestaurantkette Carl&amp;#039;s Junior sowie der konservative Nachrichtensender Fox News). Am Endpunkt dieser fiktiven &quot;Verdummung&quot; entsteht eine Gesellschaft, die nicht einmal mehr in der Lage ist, auch nur die grundlegendste Infrastruktur aufrecht zu erhalten, weil das Individuum sich willig der BedÃƒÂ¼rfnisbefriedigung hingibt und nicht mehr in der Lage ist, Probleme zu lÃƒÂ¶sen und die Lage zu verbessern.[1] Die Hauptfigur Joe Bauers (Luke Wilson) fordert in der Schlussszene, nach seiner Vereidigung zum PrÃƒÂ¤sidenten der Vereinigten Staaten, sich auf Werte wie Intelligenz und Wissenserwerb rÃƒÂ¼ckzubesinnen. Des Weiteren taucht ein humoristischer Seitenhieb auf das heutige Hollywood auf. So lÃƒÂ¤sst Mike Judge seinen Hauptdarsteller sagen (in Bezug auf einen frÃƒÂ¼her im Film erwÃƒÂ¤hnten fiktiven Blockbuster, der lediglich ein furzendes Hinterteil zeigt): &quot;(and we will have) great films, with stories! Where you cared about whose ass it was, and why it was farting!&quot;\n &lt;a href=&quot;\nhttp://de.wikipedia.org/wiki/Idiocracy&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://de.wikipedia.org/wiki/Idiocracy&lt;/a&gt;","torrent":{"xt":"urn:btih:c968298e8bbade046098e1bf1234d7f8f9c54e4d","amp;dn":"Idiocracy+-+deutsch","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c968298e8bbade046098e1bf1234d7f8f9c54e4d","infoHashBuffer":{"type":"Buffer","data":[201,104,41,142,139,186,222,4,96,152,225,191,18,52,215,248,249,197,78,77]},"announce":[],"urlList":[]}}