{"title":"Inheritance - Indira Ganesan","uid":9225148,"size":2166468,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c9a8579ad14355bf698436b9ebcf0c6ca7d17c30&amp;dn=Inheritance+-+Indira+Ganesan&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"Mohammad_AT","files":3,"time":1385000245,"description":"Characters leap off the pages and into our hearts. . . . Ganesan crafts her work with such a gracefully light touch that readers leave the book with the sense of having just experienced something exquisitely fine. -Joan Hinkemeyer, Rocky Mountain News\n\nInheritance is a gracefully wrought novel centering on the emotional awakening of Sonil, a fifteen-year-old girl living with her aunts in India. Overcome by a lingering illness, she travels to the mythic island of Pi to recover under the care of her beloved grandmother. In this lush Arcadian space, boundaries between what is real and what is not diminish, and Sonil begins to discover who she is. Rejected by her emotionally distant mother and searching desperately for any information about her American father, she seeks solace in an affair with an American man twice her age. It is through that relationship of love and loss that she begins to understand and forgive her mother, realizing for the first time what she has inherited and what she must forge for herself.","torrent":{"xt":"urn:btih:c9a8579ad14355bf698436b9ebcf0c6ca7d17c30","amp;dn":"Inheritance+-+Indira+Ganesan","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9a8579ad14355bf698436b9ebcf0c6ca7d17c30","infoHashBuffer":{"type":"Buffer","data":[201,168,87,154,209,67,85,191,105,132,54,185,235,207,12,108,167,209,124,48]},"announce":[],"urlList":[]}}