{"title":"W. D. Hart - The Evolution of Logic. The Evolution of Modern Phi","uid":10292150,"size":2544386,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c9fb46a878575feb3852a70589fb257cc33daa0f&amp;dn=W.+D.+Hart+-+The+Evolution+of+Logic.+The+Evolution+of+Modern+Phi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anette14","files":-1,"time":1401873580,"description":"Description\nProduct Details\nBook Title: The Evolution of Logic (The Evolution of Modern Philosophy)\t\nBook Author: W. D. Hart\nSeries: The Evolution of Modern Philosophy\nPaperback: 306 pages\nPublisher: Cambridge University Press (August 23, 2010)\nLanguage: English\nISBN-10: 0521747724\nISBN-13: 978-0521747721\n\n===================================================================================\nBook Description\nPublication Date: August 23, 2010 | ISBN-10: 0521747724 | ISBN-13: 978-0521747721\nThe Evolution of Logic examines the relations between logic and philosophy over the last 150 years. Logic underwent a major renaissance beginning in the nineteenth century. Cantor almost tamed the infinite, and Frege aimed to undercut Kant by reducing mathematics to logic. These achievements were threatened by the paradoxes, like Russell's. This ferment generated excellent philosophy (and mathematics) by excellent philosophers (and mathematicians) up to World War II. This book provides a selective, critical history of the collaboration between logic and philosophy during this period. After World War II, mathematical logic became a recognized subdiscipline in mathematics departments, and consequently but unfortunately philosophers have lost touch with its monuments. This book aims to make four of them (consistency and independence of the continuum hypothesis, Post's problem, and Morley's theorem) more accessible to philosophers, making available the tools necessary for modern scholars of philosophy to renew a productive dialogue between logic and philosophy.\n\n===================================================================================\nReviews\n&quot;....Hart weaves in philosophical themes in interesting ways, but this book is most appropriate for those with a sound grasp of logic as a sub-discipline of mathematics.... Recommended....&quot;- F. Wilson, University of Toronto, CHOICE\n\n&quot;....The development of logic after the war went rather in the direction of mathematics than philosophy. This period of the history of logic is shown in the book on the example of four problems; consistency and independence of the continuum hypothesis, Post's problem and Morley's theorem. The aim of the author is to make these achievements more accessible to philosophers and in this way to make available for them the tools necessary to renew the dialogue between logic and philosophy.&quot;-Roman Murawski (PL-POZNM; Poznan), Mathematical Reviews\n\n&quot;The Evolution of Logic is a significant study, perhaps a must-read, for those interested in the history of logic and set theory from Cantor to the present day. W. D. Hart illuminates both the ideas that inspire the study of logic and the ideas inspired by discoveries in logic.... The first five chapters provide valuable insights for readers with a moderate preparation in philosophical logic. But the real force of Hart's book is the appeal to philosophers and intellectual historians of the more concerted studies of the mathematics in chapters 6-9....&quot;-John W. Snapper, Illinois Institute of Technology, HOPOS: The Journal of the International Society for the History of Philosophy of Science\n\n&quot;...an admirable job of making the presentation very smooth, with proofs simplified to their essential elements....&quot;-Michael Scanlan, History and Philosophy of Logic\n\n&quot;...The Evolution of Logic is a book of admirable breadth and complexity. I find it to be tremendously interesting and thought-provoking. It will be widely discussed.&quot;-George LÄƒzÄƒroiu, PhD, Institute of Interdisciplinary Studies in Humanities and Social Sciences, Linguistics and Philosophical Investigations\n\n===================================================================================\nBook Description II\nThe Evolution of Logic examines the relations between logic and philosophy over the last 150 years, when logic underwent a renaissance. This mathematical and philosophical movement created the analytical style of philosophy. This book is an exposition and critique of its major trends and includes expositions of mathematical results in logic often inaccessible to philosophers.\n\n===================================================================================\nAbout the Author\nW. D. Hart is currently a Professor of Philosophy at the University of Illinois at Chicago, where he chaired the Philosophy department for 12 years. He has also taught at the University of Michigan, University College London, and the University of New Mexico. He is the author of The Engines of the Soul, now available in paperback (Cambridge University Press, 2009), and the editor of The Philosophy of Mathematics, and has published more than seventy articles and reviews in academic journals.\n===================================================================================","torrent":{"xt":"urn:btih:c9fb46a878575feb3852a70589fb257cc33daa0f","amp;dn":"W.+D.+Hart+-+The+Evolution+of+Logic.+The+Evolution+of+Modern+Phi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9fb46a878575feb3852a70589fb257cc33daa0f","infoHashBuffer":{"type":"Buffer","data":[201,251,70,168,120,87,95,235,56,82,167,5,137,251,37,124,195,61,170,15]},"announce":[],"urlList":[]}}