{"title":"For the Children's Sake By Susan Schaeffer Macaulay Homeschoo","uid":4567993,"size":7325736,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cafb8036f27917733a7b99fda625c1d51640ab30&amp;dn=For+the+Children%5C%27s+Sake+By+Susan+Schaeffer+Macaulay+Homeschoo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"cezen","files":1,"time":1228947742,"description":"***********************************************************************************\n***********************************************************************************\nSpecializing in Homeschool, educational and early elementary software, books and videos.\n\nYou WON&amp;#039;T find anyone else with my content unless they DL&amp;#039;d it from me and re-loaded it.\n\nPlease visit my other torrents located at www.thepiratebay.se/user/cezen\n\nPlease remember not to be dirty leecher and hit and run.  I cannot seed all these files alone \nand need your help.  Please seed to at least a ratio of 1.5 and much more if possible.\n\nIf you don&amp;#039;t like Slow Down Load speeds, then help contribute to the total number of complete copies by seeding to much higher ratios (say 10 or so).\n\nSuggestions taken at www.suprbay.org by contacting me there with same user name.\n\n*******************************************************************************************************************\n*******************************************************************************************************************\n\n\nEditorial Reviews\nProduct Description\nFor the Children&amp;#039;s Sake is a book about what education can be--for your child, in your home, and in your school. It is based first on a Christian understanding of what it means to be human--to be a child, a parent, a teacher--and on the Christian meaning of life. At the same time it is deeply practical. Many of the central ideas have been tried and proven true over a century in almost every kind of educational situation. The ideas are in fact so true that they can be applied equally at home, in different schools, in Africa, in the inner city, and in your own community. But they are also ideas which Susan and her husband Ranald Macaulay have tried and proven in their own family and school experience. \n\nFrom AudioFile\nFifteen years ago--in the world of education, a millennium--Macaulay wrote her ideological treatise on schooling, designed to assist parents and teachers in creating education that is both enriching and joyous. She states in her preface that the book embraces the Christian worldview as it applies the ideas and methods of educator Charlotte Mason to home-schooling, public education and family life. Mary Woods&amp;#039;s crisp, cheerful reading aims to convince and encourage listeners. However, because of Macaulay&amp;#039;s lifelong affiliation with the L&amp;#039;Abri Christian Fellowship in Switzerland and England, the underlying religious message is strong. Despite the acknowledged datedness of many of the books and materials suggested for use, and the underlying political tract, this recording will interest the Christian home-school market. T.B. (c) AudioFile, Portland, Maine --This text refers to the Audio Cassette edition. \n\n--------------------------------------------------------------------------------\nProduct Details\nPaperback: 166 pages \nPublisher: Crossway Books (September 1, 1984) \nLanguage: English \nISBN-10: 089107290X \nISBN-13: 978-0891072904 \nProduct Dimensions: 8.3 x 5.5 x 0.5 inches  \n\nPRODUCT REVIEW\nThis book set the vision in my mind for the type of education I&amp;#039;d like to provide for my children -- warm, intelligent, full of life. A living education full of living books, living ideas, living people! For the past eight years, I&amp;#039;ve tried to re-read this book at least once a year to keep my vision fresh and my mind focused. This is the one book I always recommend -- or give as a gift -- to anyone as they first consider the idea home education. A real treasure! \n*\nI began homeschooling our children in 1985 using a workbook program. I read a review of this book in Mary Pride&amp;#039;s Big Book, and borrowed it through InterLibrary Loan. Now I have my own copy! This book is a short introduction to home education philosophy as well as practice. Charlotte Mason included in the Preface of each of her 6 volume set called &quot;Home Education&quot;, 18 Principles as a synopsis. If you are following these 18, you may be said to be a Charlotte Mason person. All 18 are explained in this book, in a short and easy to read format. I recommend this book to anyone considering homeschooling, or who is tired of the way they are learning and living now. CM is a Christian literature-based educational philosophy. It is a Discipline, an Atmosphere, a Life - and this book can show you how to get there. \n*\nMrs. MacAulay interprets the principles of Charlotte Mason, an English school teacher with ideas similar to Maria Montessori (but grounded in Scripture). Miss Mason lived from 1842-1923 and her writing is a bit flowery for today&amp;#039;s readers. This book gets to the essentials of her philosophy outlined in this mottto &quot;I am, I can, I ought, I will&quot;. What that means is basically that teachers need to help children understand their deep value to God, expose them to many activities so they can discover their gifts, teach the unchanging morals of Scripture and guide children in making moral choices for themselves. \n*\nAs a parent considering homeschooling, I thoroughly enjoyed this book. It presents an appealing overview of what homeschooling and family life can be at its best. It takes the ideas and methods of Charlotte Mason and shows how they can be incorporated into any family, whether homeschooling or not. The information on &quot;living&quot; books makes the book a must read for any parent. \n*\nThis book was worth my time this Sunday morning to sit here and write a review on it. I have my dog-eared copy on my bedside bookshelf, where only the most loved or currently read books may reside. This book falls into both categories. \n\nLast night I picked up the book to read a snippet before falling asleep. I just let the book open where it may and it opened right where I needed it -- on a page that explains how a mother might discipline her unmotivated (lazy?) child without demeaning him. She should encourage him, saying, &quot;I know you can do this. You did ___.&quot; (and there she gives an example of a time when he did something to completion). \n\nAs another reviewer mentioned, this book is not a book for only homeschoolers. It is written for teachers and for parents. \n\nSome quotes that I underlined in my copy: \n\n&quot;Excellence is a habit.&quot; pg. 37 \n\n&quot;The adult, whether teacher or parent, has to be able to enjoy and understand what he or she is reading with the children.&quot; pg. 39 \n\n&quot;In the Bible, the result of wrongdoing was usually related to the offense.&quot; pg. 45 \n\n&quot;If you expect what is good, and are not shocked by the reality of the faltering footsteps toward it, you will be well on the way to leading.&quot; pg. 51 \n\n&quot;Children obey best when their lives are as fully satisfying as possible. If minds are interested, skills are being learned, loving relationships are enjoyed, creativity is encouraged, beauty in art, nature, and music are appreciated, hours are spent in free play - why these children will be well on their way to having their sinful natures put in the back seat!&quot; pg. 55 \n\n(she goes on to say why -- it&amp;#039;s because &quot;sinful natures expand like a malignancy with boredom, loneliness, passivity, tiredness, etc.&quot;) \n\n&quot;Our first concern is to open the door to the knowledge of God.&quot; pg. 92 \n","torrent":{"xt":"urn:btih:cafb8036f27917733a7b99fda625c1d51640ab30","amp;dn":"For+the+Children%5C%27s+Sake+By+Susan+Schaeffer+Macaulay+Homeschoo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cafb8036f27917733a7b99fda625c1d51640ab30","infoHashBuffer":{"type":"Buffer","data":[202,251,128,54,242,121,23,115,58,123,153,253,166,37,193,213,22,64,171,48]},"announce":[],"urlList":[]}}