{"title":"Chronos","uid":4757175,"size":120651213,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:cb4c670322051a47171445aeeecb09a8a46510ec&amp;dn=Chronos&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Zero_Assassin","files":13,"time":1236520652,"description":"\tChronos is the name of 2 fictional characters, a DC Comics supervillain who takes his name from the Greek personification of Time and has the ability to time travel and manipulate history.  This torrent features Walker Gabriel, the second Chronos.\n\n\n\nIn 1952, Walker Gabriel competes with wealthy medical student Thomas Wayne for the affections of a scrappy young socialite named Martha.\n\nIn 1873, Walker Gabriel is arrested with the outlaw Bat Lash for the kidnapping of the mayor's daughter in the booming cowtown of Smallville.\n\nIn 1789, Walker Gabriel watches Ra's al Ghul rise from the dead in the African desert.\n\nIn 1641, Captain Fear, a Caribbean buccaneer, hauls a drowning Walker Gabriel out of the Atlantic near the Florida Keys.\n\nIn 1478, in Italy, a very old man named Vandal Savage convinces Lorenzo de Medici to send Walker Gabriel against his rivals, the Pazzi family.\n\nIn 48,000 BC, Rip Hunter, a man from the future, begs Walker Gabriel to show him the way home.\n\nIn 1943, Walker Gabriel is caught in the crossfire between Allied and Axis soldiers on an island where dinosaurs still exist.\n\nIn 1998, all of this is in Walker Gabriel's future...\n\n(from the first page of John Francis Moore's initial proposal for Chronos)\n\nWalker Gabriel got possession of Clinton's research after his death. He became the second Chronos and was the lead character of a short-lived comic book series published by DC Comics, acting as both a hero and a criminal depending on circumstances, and often running afoul of the Linear Men. He was eventually revealed to be the son of a temporal theorist who had worked with Clinton and created Chronopolis, the city beyond time.\n\nThe series ran for 12 issues (including a DC One Million crossover numbered 1,000,000) between March 1998 and February 1999, and concluded with Gabriel going to extreme measures to save his mother's life.\n\n\nEnjoy, and please continue seeding so that others may enjoy. ","torrent":{"xt":"urn:btih:cb4c670322051a47171445aeeecb09a8a46510ec","amp;dn":"Chronos","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb4c670322051a47171445aeeecb09a8a46510ec","infoHashBuffer":{"type":"Buffer","data":[203,76,103,3,34,5,26,71,23,20,69,174,238,203,9,168,164,101,16,236]},"announce":[],"urlList":[]}}