{"title":"William Least Heat Moon - Blue Highways","uid":9526968,"size":707583232,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:cb59a5ada7d49bfc42b09b3280db2304fef596ad&amp;dn=William+Least+Heat+Moon+-+Blue+Highways&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1390766542,"description":"First published in 1982, William Least Heat-Moon's account of his journey along the back roads of the United States (marked with the color blue on old highway maps) has become something of a classic. When he loses his job and his wife on the same cold February day, he is struck by inspiration: &quot;A man who couldn't make things go right could at least go. He could quit trying to get out of the way of life. Chuck routine. Live the real jeopardy of circumstance. It was a question of dignity.&quot;\nDriving cross-country in a van named Ghost Dancing, Heat-Moon (the name the Sioux give to the moon of midsummer nights) meets up with all manner of folk, from a man in Grayville, Illinois, &quot;whose cap told me what fertilizer he used&quot; to Scott Chisholm, &quot;a Canadian citizen ... [who] had lived in this country longer than in Canada and liked the United States but wouldn't admit it for fear of having to pay off bets he made years earlier when he first 'came over' that the U.S. is a place no Canadian could ever love.&quot; \n\nReview\n&quot;Reading Blue Highways made me go back and look at Jack Kerouac's On the Road to see if Mr. Least Heat-Moon does as well. He does far better . . . Maybe twice a year I read a book I wish were even longer. This is one of them. I could wish Mr. Least Heat-Moon had driven every blue highway in America.&quot; (The New York Times)\n\n&quot;Blue Highways is a splendid book, outstanding Americana, which I rank above the next best thing preceding it in the genre, John Steinbeck's Travel with Charley.&quot; (The Wall Street Journal)\n\n&quot;Better than Kerouac.&quot; (The Chicago Sun-Times)","torrent":{"xt":"urn:btih:cb59a5ada7d49bfc42b09b3280db2304fef596ad","amp;dn":"William+Least+Heat+Moon+-+Blue+Highways","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb59a5ada7d49bfc42b09b3280db2304fef596ad","infoHashBuffer":{"type":"Buffer","data":[203,89,165,173,167,212,155,252,66,176,155,50,128,219,35,4,254,245,150,173]},"announce":[],"urlList":[]}}