{"title":"Katherine Jenkins - A Girl From Neath [2008] AVI + JPEGs","uid":4607421,"size":346052972,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:cce980af95d30d3d18de03873948c9239a2742b3&amp;dn=Katherine+Jenkins+-+A+Girl+From+Neath+%5B2008%5D+AVI+%2B+JPEGs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sweetthing","files":10,"time":1230515580,"description":"This is the documentary Katherine made for BBC2 Wales which was shown on Christmas Day. Unfortunately I missed the first few seconds but what I have uploaded here is essentially the full thing. Lovely programme and even lovlier lady. How does she maintain that SMILE? It provides more warmth than all the energy companies put together!\n\n\nKatherine Jenkins goes on a journey through the treasured places of her childhood and explains why she is proud to be a girl from Neath.\n\nKatherine Jenkins was born on 29 June 1980 in Neath. \n\nHer mother worked as a mammography radiographer, whilst her father, who retired early, passed away from lung cancer when Katherine was a teenager. \n\nKatherine Jenkins is hugely successful opera star and is the first artist to have two Number Ones in the UK classical charts in a year. \n\nKatherine Jenkins attended Alderman Davies Primary School and Dwr-yr-Felin School in Neath. \n\nAs a youngster Katherine Jenkins represented Wales three times in the Choirgirl Of The Year competition and at 17 she won a scholarship to study opera at the Royal Academy of Music. \n\nKatherine Jenkins then went from giving singing lessons to children in Neath to being given the biggest recording deal in the history of classical music. \n\nHer first album, Premiere, made her the fastest selling soprano of all time and she became the first artist to hold the number one and two UK classical album chart positions at the same time, with Premiere and Second Nature, which also reached number 16 in the UK pop charts. \n\nKatherine Jenkins has made numerous live performances at the world's most prestigious venues including Westminster Cathedral, Sydney Opera House, Royal Albert Hall and at the VE Day concert at Trafalgar Square. \n\nKatherine Jenkins's album Living the Dream stayed at No 1 for almost a year in the UK classical charts and got to Number 4 in the pop album charts. \n\nIt was followed in November 2006 by another huge hit, Serenade, which sold more than 50,000 copies in its first week. \n\nShe followed it up with Rejoice. \n\nThe Guardian compared Katherine Jenkins to Charlotte Church: \n\n&quot;Jenkins is everything that her compatriot Charlotte Church could have been until the latter mutated from Voice of an Angel to Little Miss Raunch. She's sweet, slick and antiseptically pretty.&quot; \n\nAsked what the most important lesson life has taught her, Katherine Jenkins told The Guardian: \n\n&quot;You learn your lessons from the mistakes you make, not the things you achieve.&quot; \n\nKatherine Jenkins used to go out with Worlds Apart singer Steve Hart. \n\nIn December 2007, The Sun reported that Katherine Jenkins was secretly dating Gethin Jones of Strictly Come Dancing and Blue Peter fame. \n\nAt the end of 2007 and in 2008, Katherine Jenkins was touring with Darcey Bussell in a stage show, Viva la Diva, a tribute to their heroes and heroines. \n\nKatherine Jenkins and Darcey Bussell also performed together at the Royal Variety Performance in December 2007. \n\nIn October 2008 the BBC reported that Katherine Jenkins had signed the biggest classical recording deal ever, in a five-album deal with Warner Music. \n\nIn November 2008, Katherine Jenkins revealed that she taken drugs when she was younger. According to a BBC report, Katherine Jenkins stopped taking drugs in 2003. \n\nThe BBC's Katherine Jenkins minisite and Katherine Jenkins's official site have more information. \n\n\n","torrent":{"xt":"urn:btih:cce980af95d30d3d18de03873948c9239a2742b3","amp;dn":"Katherine+Jenkins+-+A+Girl+From+Neath+%5B2008%5D+AVI+%2B+JPEGs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cce980af95d30d3d18de03873948c9239a2742b3","infoHashBuffer":{"type":"Buffer","data":[204,233,128,175,149,211,13,61,24,222,3,135,57,72,201,35,154,39,66,179]},"announce":[],"urlList":[]}}