{"title":"The Last Hunter - Ascent (Book 3 of the Antarktos Saga) by  Jere","uid":9566904,"size":329006,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cd49cb66ecbc8832fa0871024f2730ca4996691c&amp;dn=The+Last+Hunter+-+Ascent+%28Book+3+of+the+Antarktos+Saga%29+by++Jere&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Xetron","files":1,"time":1391533298,"description":"I no longer exist. My kidnapping, breaking and corruption at the hands of the half-human, half-demon Nephilim began the journey to nothingness. I had hoped to one day rejoin my loved ones in the outside world, but before I realized it, twenty years had passed. Time is a distance I cannot traverse. If there is any memory of me, it is distant. Worse, the spirit of Nephil, Lord of the Nephilim, used my connection with the continent to decimate the surface world. I've done horrible things in the past, but I'm now responsible for the deaths of billions. Billions. God...\n\nAnd so I have removed myself from the physical world, and Nephil's reach, to live out eternity in Tartarus, a place of endless torture where the burden I carry crushes my soul, driving me to madness. I am weak and cold. My abilities are gone. And I am not alone in this hell. There are things here more horrible than I could have imagined.\n\nBut as much as I think I deserve this fate, I'm driven to find a way to escape. To exist again. To return to my new family--Em and Luca. To set things right. I am Solomon Ull Vincent--The Last Hunter--and I will exist again.\n\n*The Last Hunter - Ascent (Book 3 of the Antarktos Saga) parallels the events in Antarktos Rising, an adult thriller also by Robinson, upon which the Antarktos Saga is based. Read them together for the full experience. The final two books in the Antarktos Saga will complete both storylines as they merge.","torrent":{"xt":"urn:btih:cd49cb66ecbc8832fa0871024f2730ca4996691c","amp;dn":"The+Last+Hunter+-+Ascent+%28Book+3+of+the+Antarktos+Saga%29+by++Jere","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd49cb66ecbc8832fa0871024f2730ca4996691c","infoHashBuffer":{"type":"Buffer","data":[205,73,203,102,236,188,136,50,250,8,113,2,79,39,48,202,73,150,105,28]},"announce":[],"urlList":[]}}