{"title":"Lyricist Lounge Vol. 1 &amp; 2","uid":4923322,"size":292440629,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:cd84958314931736f28d2e2c8ea1a4a89d05a62d&amp;dn=Lyricist+Lounge+Vol.+1+%26+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tzanev","files":55,"time":1243757231,"description":"Lyricist Lounge, Volume One is the first installment of Rawkus Records Lyricist Lounge album series, based on the Lyricist Lounge showcases in New York. The double-disc compilation features De La Soul, Mos Def, Q-Tip, Tash of Tha Alkaholiks, Punch &amp; Words, O.C., Ras Kass, Black Thought, Common, Pharoahe Monch, Saul Williams, Kool Keith, Talib Kweli &amp; Hi-Tek, Bahamadia, Rah Digga, Shabaam Sahdeeq, Jurassic 5, KRS-One, Zack de la Rocha of Rage Against the Machine, Last Emperor and Company Flow. Lyricist Lounge 2 is the second installment in Rawkus Records Lyricist Lounge album series. The release was one of Rawkus' most commercially successful releases, featuring the hit crossover singles, &quot;Oh No&quot; and &quot;Get Up&quot;, the former charting on the Billboard Hot 100. Despite its success, Lyricist Lounge 2 drew criticisms from underground fans, mainly due to the album's more commercial sound, and also because of its focus on established artists, unlike the first installment, which largely featured up-and-coming MC's.\nThe album features appearances from Mos Def, Pharoahe Monch, Nate Dogg, Q-Tip, Wordsworth, Cocoa Brovaz, Beanie Sigel, Royce Da 5'9&quot;, Ghostface Killah, Saukrates, Redman, Talib Kweli, dead prez, Kool G Rap, M.O.P., Big Noyd, Prodigy, Erick Sermon, Sy Scott, Planet Asia, Punchline, Cobra Red, Phil Da Agony, C-Town, Dilated Peoples, Master Fuol, JT Money, Pastor Troy, Macy Gray and Guru, as well as late hip hop legends The Notorious B.I.G. and Big L.","torrent":{"xt":"urn:btih:cd84958314931736f28d2e2c8ea1a4a89d05a62d","amp;dn":"Lyricist+Lounge+Vol.+1+%26+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd84958314931736f28d2e2c8ea1a4a89d05a62d","infoHashBuffer":{"type":"Buffer","data":[205,132,149,131,20,147,23,54,242,141,46,44,142,161,164,168,157,5,166,45]},"announce":[],"urlList":[]}}