{"title":"ZORRO 222-223 [retr?tv]","uid":4224442,"size":456560009,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ceb99097707de618c6c3b23b2f57d889e4123a46&amp;dn=ZORRO+222-223+%5Bretr%3Ftv%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"flixer","files":3,"time":1212753071,"description":"ZORRO (1957) starring Guy Williams (Don Diego de la Vega / El Zorro), Gene Sheldon (Bernardo), Henry Calvin (Sgt. Garcia), George J. Lewis (Don Alejandro de la Vega)\n\n2x22- PLEASE BELIEVE ME  (3/5/1959) \nAnita is still hoping to find her father, but Sergeant Garcia has decided she is nothing but a liar and wants to send her back to Spain. Only Diego believes her story, and he tells her she needs to supply some proof of her father&amp;#039;s existence. She mentions a package of letters her father sent to her, and Diego asks to see them. Anita goes to her room but quickly returns without them, claiming they have been stolen. When Don Alejandro again voices his doubts about her story, she claims the letters must have been taken by Rafael Gonzales, a driver who brought her to the city from her ship. This further angers Alejandro, who has known and trusted Gonzales for many years, and he arranges for her to leave on the next ship. Anita asks Ruiz, one of the de la Vega servants, to escort her to the mission so she can hide, and she offers to pay him in gold. He agrees and arranges for another man to accompany them, planning to rob the unsuspecting girl.\nGuest star: Annette Funicello (Anita Cabrillo), Carlos Rivas (Ruiz), Arthur Space (Rafael Gonzales), Wendell Holmes (Storekeeper), Greigh Phillips (Jose), Penny Santon (Cresencia)\nNote: Annette sings Lonely Guitar, written by another former Mouseketeer, Jimmie Dodd.\n\n2x23- THE BROOCH  (3/12/1959) \nDon Alejandro remains firm in his wish to send Anita back to Spain and tells the girl to pack her bags. Gonzales arrives to take her to the ship and Anita gives Alejandro a goodbye kiss. She turns to climb aboard the carriage but Alejandro stops her, for Anita is wearing a brooch that he once gave to the mission to be sold at a charity auction. When she tells him her father sent it her in Spain, Alejandro finally believes her story about the missing man. He changes his mind and allows her to stay, then plans to research the sales records to learn who bought the brooch. Meanwhile, Ruiz and his partner, Guerrero, try once again to steal Anita&amp;#039;s gold. They tell her to bring it to Castle Rock if she ever wants to see her father again. Anita takes the gold as instructed and is surprised to find Gonzales there, bound and gagged.\n\nTV&gt;XviD/352x256/1.2Mbps/23.97fps\nmp3/62Mbps/44KHz/Stereo/25min\n\nLeave a comment if you&amp;#039;d like to see more!","torrent":{"xt":"urn:btih:ceb99097707de618c6c3b23b2f57d889e4123a46","amp;dn":"ZORRO+222-223+%5Bretr%3Ftv%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ceb99097707de618c6c3b23b2f57d889e4123a46","infoHashBuffer":{"type":"Buffer","data":[206,185,144,151,112,125,230,24,198,195,178,59,47,87,216,137,228,18,58,70]},"announce":[],"urlList":[]}}