{"title":"Harry Sinclair - Topless Women Talk About Their Lives (1997)","uid":6454713,"size":4937590784,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:cefb8c8694d13566dd99144ee846d86f56105462&amp;dn=Harry+Sinclair+-+Topless+Women+Talk+About+Their+Lives+%281997%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"oddeven","files":-1,"time":1307547096,"description":"There are also Turkish subs and an English Director's commentary. There are English permasubs during the German and Maori moments. I guess I should be clear, the film is mostly in English, with a smattering of German and Maori.  There is also a German dub.\n\nThe first feature film by New Zealand director Harry Sinclair.  His two later feature's, The Price of Milk and Toy Love, are well worth a gander. They are all a bit removed from reality, or I am missing something totally unique to New Zealand and  its mating rituals.  Goats and sheep.  I particularly enjoyed the goat in this one.\n\nThere is also an interview with the director, and a short, Sinclair's first film, The Lounge Bar, both with only German permasubs.\n\nThough without the lush colors of his later films, I think I laughed harder during this one.  Yes, there are some topless women, but don't let that be the reason to download it. It mostly relates to a film within the film, an awkward art film with German ladies, topless, telling a narrative as if they were New Zealand locals.\n\n\nUncompressed PAL DVD9 VIDEO_TS folder\n","torrent":{"xt":"urn:btih:cefb8c8694d13566dd99144ee846d86f56105462","amp;dn":"Harry+Sinclair+-+Topless+Women+Talk+About+Their+Lives+%281997%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cefb8c8694d13566dd99144ee846d86f56105462","infoHashBuffer":{"type":"Buffer","data":[206,251,140,134,148,209,53,102,221,153,20,78,232,70,216,111,86,16,84,98]},"announce":[],"urlList":[]}}