{"title":"Psychedelic Surrealistic Pictures","uid":4524987,"size":36805731,"categoryP":"other","categoryS":"pictures","magnet":"?xt=urn:btih:cf0e6122e75fdaecff8baa0708797708a71d8441&amp;dn=Psychedelic+Surrealistic+Pictures&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"767676","files":322,"time":1227318403,"description":"JPEG Collection of mind fucking artwork by psychedelic artist Larry Carlson.\n\nCheck out http://larrycarlson.com for more of his surreal work. \n\n:: ARTIST BIO ::\n\nLarry Carlson is a visionary multi media artist. Working with computers he creates artwork that is completely mind blowing. G4Tech TV called him &quot;The Salvador Dali of the Next Century&quot;, and High Times magazine labeled him an &quot;artistic mastermind&quot;. Working in the mediums of photography, web art, digital art, animation, video art, collage and sound he presents us with the mystical dimensions of consciousness, coaxing us into sweet spiritualized epiphanies one moment then plunging us into completely bizarre surreal frenzies the next. His art is more than just eye candy for stoners. In the tradition of arch-surrealists like MirÃƒÂ³ and Magritte, Carlson at his best gives us a kind of disjointed representation of the slippery nature of the unconscious mind, driven to Dionysian extremes.\n\nInternationally recognized as one of the most original digital artists in the world today, his web sites are at the vanguard of taking the internet to the next level. A pioneer in multimedia experimental web-art, he first started exhibiting his artwork online in 1997. For the past five years Yahoo! directory has ranked Larry Carlson as the number one computer artist in the world. Newspapers around the world like London&amp;#039;s Guardian, Montreal&amp;#039;s Mirror, and Istanbul&amp;#039;s Vatan News have done features on his awe-inspiring artwork.\n\nAs a child growing up in northern New Jersey, Larry Carlson spent a lot of time drawing and began to keep a sketchbook at an early age. His artist&amp;#039;s attention has always been captivated by both nature and technology. He is a Cooper Union School of Art graduate, where he studied painting and filmmaking.\n\nLarry Carlson has exhibited his artwork in museums and galleries in the U.S., Brazil, Sweden, France, and Germany. Recently the Museum of Modern Art ( MOMA ) in New York exhibited his collage art books in the show Book/Shelf, and his movies were shown at Alex Grey&amp;#039;s COSM (Chapel of Sacred Mirrors). He also puts on live experimental video shows and has provided visuals for major electronic music events in New York, Las Vegas, Toronto, and Los Angeles, as well as mixing video live on tour with musical group, The Kottonmouth Kings.","torrent":{"xt":"urn:btih:cf0e6122e75fdaecff8baa0708797708a71d8441","amp;dn":"Psychedelic+Surrealistic+Pictures","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf0e6122e75fdaecff8baa0708797708a71d8441","infoHashBuffer":{"type":"Buffer","data":[207,14,97,34,231,95,218,236,255,139,170,7,8,121,119,8,167,29,132,65]},"announce":[],"urlList":[]}}