{"title":"The Secret Circle S01E04 Nl subs DutchReleaseTeam","uid":6736829,"size":367242601,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:cf75e0186201aa273cd058601c984207b2cd05f8&amp;dn=The+Secret+Circle+S01E04+Nl+subs+DutchReleaseTeam&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Koedje","files":-1,"time":1318358637,"description":"Plot:\n\nCassie Blake was a happy, normal teenage girl, until her mother Amelia dies in what appears to be a tragic accidental fire. Orphaned and deeply saddened, Cassie moves in with her warm and loving grandmother Jane in the beautiful small town of Chance Harbor, Washington - the town her mother left so many years before - where the residents seem to know more about Cassie than she does about herself. When her new friends explain that they are all descended from powerful witches, and they've been waiting for Cassie to join them and complete a new generation of the Secret Circle, Cassie refuses to believe them - until Adam shows her how to unlock her incredible magical powers.\n\n\nVertaling : elthijsie, Winchestergirl &amp; Chillywitch\n\n\nSeizoen 1 Aflevering 4: Heather\n\n\nCassie looks up an old friend of her mother's named Heather Barnes and discovers she has been in a catatonic state since the night of the fire 16 years ago. Feeling guilty that her mother and her Circle may have had something to do with Heather's current state, Cassie tells Diana that she wants to use magic to help Heather. Diana refuses to help, but Faye is more than happy to conjure up a spell - for a price.\n\n\n\n\nDeze serie wordt u aangeboden door het DutchReleaseTeam.\nVoor de reviews van de nieuwste films, muziek, series, games etc\nga dan eens naar http://www.hetmultimediacafe.be\n\nDutchReleaseteam = Hardcoded Dutch Subs","torrent":{"xt":"urn:btih:cf75e0186201aa273cd058601c984207b2cd05f8","amp;dn":"The+Secret+Circle+S01E04+Nl+subs+DutchReleaseTeam","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf75e0186201aa273cd058601c984207b2cd05f8","infoHashBuffer":{"type":"Buffer","data":[207,117,224,24,98,1,170,39,60,208,88,96,28,152,66,7,178,205,5,248]},"announce":[],"urlList":[]}}