{"title":"Charles Darwin - The Origin of Species (Unabridged)","uid":4479418,"size":743522112,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:cf925f08c4b65ca9e0a64a4a13b217f0e45603dc&amp;dn=Charles+Darwin+-+The+Origin+of+Species+%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"pagreen1966","files":337,"time":1225493220,"description":"Charles Darwin's On the Origin of Species (published 24 November 1859) is a seminal work in scientific literature and arguably the pivotal work in evolutionary biology. \n\nIt introduced the theory that populations evolve over the course of generations through a process of natural selection. Darwin's book was the culmination of evidence he had accumulated on the voyage of the Beagle in the 1830s and expanded through continuing investigations and experiments after his return.\n\nThe book is readable even for the non-specialist and attracted widespread interest on publication. The book was controversial because it contradicted religious beliefs that underlay the then current theories of biology, and it generated much discussion on scientific, philosophical, and religious grounds.\n\nThe scientific theory of evolution has itself evolved since Darwin's contributions, but natural selection remains the most widely accepted scientific model of how species evolve. Nonetheless, the creation-evolution controversy continues to this day in some countries and in this respect Darwin's work is championed and defended by such modern day scientists as Professor Richard Dawkins.\n\n\n","torrent":{"xt":"urn:btih:cf925f08c4b65ca9e0a64a4a13b217f0e45603dc","amp;dn":"Charles+Darwin+-+The+Origin+of+Species+%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf925f08c4b65ca9e0a64a4a13b217f0e45603dc","infoHashBuffer":{"type":"Buffer","data":[207,146,95,8,196,182,92,169,224,166,74,74,19,178,23,240,228,86,3,220]},"announce":[],"urlList":[]}}