{"title":"Beck - Where It's At [promo].VOB","uid":9012158,"size":202301444,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:d0ae177c03d7b4e656f5d13814f0342a99c6b766&amp;dn=Beck+-+Where+It%27s+At+%5Bpromo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1381120537,"description":"Beck - Where It's At [promo].VOB\n\n\nHQ rare promo music video from a promo DVD. &quot;Where It's At&quot; is the first single from Beck's 1996 album, Odelay. Beck wrote the song in 1995. He premiered it at Lollapalooza 1995, in a version very similar to its incarnation on Odelay. He has played the song very often since 1995, although he regularly experiments with the music and lyrics.\n\n&quot;Where It's At&quot; has a number of spoken samples that Beck and the Dust Brothers incorporated into it. Many of these come from an obscure sex education album titled Sex for Teens: (Where It's At), a subtitle Beck borrowed. Other vocal samples incorporated into &quot;Where It's At&quot; come from &quot;Needle to the Groove&quot; by old-school hip hop group Mantronix (&quot;we've got two turntables and a microphone...&quot;), as well as The Frogs (&quot;that was a good drum break&quot;). The song also references Gary Wilson, one of Beck's influences. Beck also pays homage to Captain Beefheart by dressing as Captain Beefheart was dressed in the Trout Mask Replica album photo sessions at 1:27 in the video. The video features a parody of William Shatner's video of &quot;Rocket Man&quot;. An adaptation of the song in Futurama was also used with Bender playing the 'washboard' in various parts, the same episode in which Beck makes an appearance throughout the show.\n\nBeck earned the Grammy Award for Best Male Rock Vocal Performance for the song. In October 2011, NME placed it at number 76 on its list of 150 Best Tracks of the Past 15 Years.\n\nOdelay is the fifth studio album by American alternative rock artist Beck, originally released on June 18, 1996, by DGC Records.\n\nOdelay featured several hit singles, including &quot;Where It's At&quot;, &quot;Devils Haircut&quot;, and &quot;The New Pollution&quot;. The album peaked at #16 on the Billboard 200 chart and eventually sold over 2 million copies in the United States. It was also Beck's first hit album in the United Kingdom, making #17; it has since gone platinum in the UK.\n\nOdelay was nominated for the Grammy Award for Album of the Year and won a Grammy Award for Best Alternative Music Album in 1997, as well as a Grammy Award for Best Male Rock Vocal Performance for &quot;Where It's At&quot;. It was ranked 16 in Spin's &quot;100 Greatest Albums, 1985-2005&quot;. Odelay was awarded Album of the Year by the American magazine Rolling Stone. It was voted as the best album of the year in The Village Voice Pazz &amp; Jop critics poll, and also in the NME's annual critics poll. In 1998, Q magazine readers voted Odelay the 51st greatest album of all time. In 2003, the album was ranked number 305 on Rolling Stone magazine's list of the 500 greatest albums of all time. Voters in Channel 4's 2005 &quot;100 Greatest Albums&quot; poll placed it at number 73. The music website Pitchfork Media ranked it at #19 on their top 100 albums of the 1990s.\n\nBeck Hansen (born Bek David Campbell, July 8, 1970), known by the stage name Beck, is an American musician, singer-songwriter and multi-instrumentalist. Beck rose to fame in the early 1990s with his lo-fi, sonically experimental sound, and he became well known for creating musical collages of a wide range of styles. His later recordings encompass everything from folk, funk, soul, hip hop, alternative rock, and country to psychedelia. Beck has released ten studio albums, as well as several non-album singles and a book of sheet music.\n\nWith a pop art collage of musical styles, oblique and ironic lyrics, and postmodern arrangements incorporating samples, drum machines, live instrumentation and sound effects, Beck has been hailed by critics and the public throughout his musical career as being amongst the most creative and idiosyncratic musicians of 1990s and 2000s alternative rock. Beck is currently working on two new studio albums.\n(video has a 5 semi-transparent blue dots at the bottom right)\n\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Where_It%27s_At&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Where_It%27s_At&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/jAABbAaFJ&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/jAABbAaFJ&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic: \n   Video: MPEG2 Video 720x480 (4:3) 29.97fps 6000kbps\n   Audio: LPCM 48000Hz stereo 1536kbps [DVD LPCM, 16 bit]\n   Duration: 00:03:32\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.7.0\n\n\n*Media Player Classic Home Cinema*  &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\n\nSgtRlee (Sgt.R.Lee) \n\t","torrent":{"xt":"urn:btih:d0ae177c03d7b4e656f5d13814f0342a99c6b766","amp;dn":"Beck+-+Where+It%27s+At+%5Bpromo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0ae177c03d7b4e656f5d13814f0342a99c6b766","infoHashBuffer":{"type":"Buffer","data":[208,174,23,124,3,215,180,230,86,245,209,56,20,240,52,42,153,198,183,102]},"announce":[],"urlList":[]}}