{"title":"[K. M. Dooley, Carlos Apesteguia, E. E. Blekkan]Catalysis Volume","uid":11245752,"size":9013278,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d3507946602ea95479c082a55bcc7eb1ed85dbc3&amp;dn=%5BK.+M.+Dooley%2C+Carlos+Apesteguia%2C+E.+E.+Blekkan%5DCatalysis+Volume&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"zombie_rox","files":1,"time":1413736689,"description":"Over 7000 papers are published in the field of catalysis each year. While the majority appear within a handful publications, keeping up with the literature can be difficult. Now in its 26th volume, the Specialist Periodical Report on Catalysis presents critical and comprehensive reviews of the hottest literature published over the last twelve months. Industrial and academic scientists face increasing challenges to find cost-effective and environmentally sound methods for converting natural resources into fuels, chemicals and energy. This series is edited by two leading researchers in the field and provides a balanced and in-depth review of the modern approaches to these challenges, covering major areas of heterogeneous and homogenous catalysis, as well as specific applications of catalysis, such as NOx control, kinetics and experimental techniques, such as microcalorimetry. With chapters detailing specific areas within the field, this series is a comprehensive reference for anyone working in Catalysis and an essential resource for any Library.\n\nPublisher: Royal Society of Chemistry; 26 edition (26 February 2014)\nLanguage: English\nISBN-10: 1849739188\nISBN-13: 978-1849739184","torrent":{"xt":"urn:btih:d3507946602ea95479c082a55bcc7eb1ed85dbc3","amp;dn":"%5BK.+M.+Dooley%2C+Carlos+Apesteguia%2C+E.+E.+Blekkan%5DCatalysis+Volume","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3507946602ea95479c082a55bcc7eb1ed85dbc3","infoHashBuffer":{"type":"Buffer","data":[211,80,121,70,96,46,169,84,121,192,130,165,91,204,126,177,237,133,219,195]},"announce":[],"urlList":[]}}