{"title":"The Complete Guide to High-End Audio (Robert Harley)","uid":9329849,"size":37610051,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d3570d26e538dc43c27d4a5917df71380e98fcc3&amp;dn=The+Complete+Guide+to+High-End+Audio+%28Robert+Harley%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":4,"time":1386706323,"description":"In this newly updated directory, the latest in cutting-edge audio equipment is provided, including how to choose the best audio equipment on a budget, how to get the best sound for the money, and how to set up a system for maximum performance. Revised and expanded to include all the latest audio technologies, this book is packed with expert advice how to make speakers sound up to 50 percent better at no cost, avoid the most common system set-up mistakes, and how to choose the one speaker in 50 worth owning. Among the new topics covered are computer-based music servers, wireless streaming of audio, high-resolution digital audio, internet downloads, HD radio, Blu-ray Disc, and the new high-resolution surround-sound formats. A short course on listening-room acoustics is presented and additional information on audio for home theater, multichannel audio, system set-up secrets, and what each component's specifications and measurements mean is also provided.","torrent":{"xt":"urn:btih:d3570d26e538dc43c27d4a5917df71380e98fcc3","amp;dn":"The+Complete+Guide+to+High-End+Audio+%28Robert+Harley%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3570d26e538dc43c27d4a5917df71380e98fcc3","infoHashBuffer":{"type":"Buffer","data":[211,87,13,38,229,56,220,67,194,125,74,89,23,223,113,56,14,152,252,195]},"announce":[],"urlList":[]}}