{"title":"D3DGear v4.91.1893 Full-BRD [TorDigger]","uid":11092922,"size":17389669,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d395009b89e86a5259e92be46f1fe04209dc8ed0&amp;dn=D3DGear+v4.91.1893+Full-BRD+%5BTorDigger%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TorDigger","files":11,"time":1411552451,"description":"D3DGear\n\nWhat is D3DGear?\n\nD3DGear is very fast game recording software and game broadcasting software for PC. It captures gameplay video to movie with high speed, high quality, very small file size.\n\nVideo Recording Software\n\nD3DGear is a very fast game video recording software. D3DGear allows users to capture game play to movie without slowing down the game. D3DGear has very minimal performance impact on the game and may not cause a game to lag or drop frame rate.\n\nD3DGear recording produces high quality video with small file size, and it supports microphone recording, Push-To-Talk recording and face camera overlay. D3DGear is a perfect video game recorder for users who want to record game play with commentary to a movie and upload it YouTube.\n\nD3DGear recording performance is superior among other similar software such as Fraps software. Visit our Fraps Alternative page for detail comparison between D3DGear and Fraps.\n\nLive Streaming Software\n\nD3DGear is also a very fast game broadcasting software. D3DGear allows users to live stream game play to web without affecting game performance. D3DGear broadcasting function is very fast and very easy to use, and it works with slow upload speed, and it is compatible with twitch.tv and all other live stream web sites.\n\nD3DGear broadcasting function also supports microphone recording Push-To-Talk recording and face camera overlay. D3DGear is a perfect game broadcaster for live streaming game play to web.\n\nD3DGear broadcasting performance is superior among other similar software such as XSplit software. Visit our XSplit Alternative page for detail comparison between D3DGear and XSplit.\n\nScreen Capture Software\n\nD3DGear also allows user to capture video game screenshot with a press of hotykey and save it as image file. D3DGear supports most popular image formats such as BMP, JPG, PNG and GIF; and user has option to add time stamp into screen shot.\n\nHow does D3DGear work?\n\nD3DGear works as a universal video game plugin/add-on, it will automatically attach to a game when it starts. Simply launching D3DGear prior to start a video game, recording or broadcasting video game is as simple as pressing a hot key. Visit Products page for more details on D3DGear features.\n\nD3DGear supports PC video games that use DirectX8, DirectX9, DirectX9Ex, DirectX10, DirectX10.1, DirectX11, DirectX11.1 or OpenGL API. D3DGear runs on 32 and 64 bit of Windows XP, VISTA, Windows 7, Windows 8 and Windows 8.1.\n\nD3DGear is shareware. After a 15 day trial period, user needs purchase a license to continue use it. Visit Purchase page for more details.\n\nD3DGear has passed Microsoft designed tests for software compatibility and reliability on WindowsÂ® 8 and WindowsÂ® 7. D3DGear has passed Windows 8 Compatible and Windows 7 Compatible Logo Certification.\n\nSystem Requirements:\n\nMinimum Hardware Requirements:\n\nPentium compatible 2 GHz or higher processor.\n2 GB or more RAM.\n10 GB or more free hard disk space.\nDirectX 9.c or later compatible graphic cards.\n\nSurpported Operating Systems &amp; Service Packs:\n\nWindows XP 32 with Service Pack 3 (SP3) or higher.\nWindows XP 64 with Service Pack 2 (SP2) or higher.\nWindows Vista 32 with Service Pack 2 (SP2) or higher.\nWindows Vista 64 with Service Pack 2 (SP2) or higher.\nWindows 7 32 with Service Pack 1 (SP1) or higher.\nWindows 7 64 with Service Pack 1 (SP1) or higher.\nWindows 8 32 RTM.\nWindows 8 64 RTM.\n\nSupported DirectX/OpenGL APIs:\n\nDirectX 8, DirectX 9, DirectX 9 Ex, DirectX 10, DirectX 10.1, DirectX 11, DirectX 11.1 APIs.\nOpenGL 2.0 or later APIs.\n\nSupported Video Codecs:\n\nMPEG 4 Simple Profile codec (M4S2).\nMotion JPEG codec (MJPG).\nWindows Media Video 9 codec (WMV3/WVC1).\nHuffyuv Lossless codec.\nH.264/MPEG-4 AVC (H264) codec.\nAll above video codecs are highly optimized for best performance and all are multi-threads enabled.\n\nSupported Audio Codecs:\n\nAudio codecs: MP3, AAC, WMA, Speex, Vorbis.\n\nHomepage: http://d3dgear.com/home.htm \n\nInstallation Instructions: \n\n- Install program.\n- No need to Activate..its Retail full version\n- Done, Enjoy.\n\nHave A Nice Day\n\nNote: Uploader is only responsible if any problem in torrent, never responsible for software functionality problems.","torrent":{"xt":"urn:btih:d395009b89e86a5259e92be46f1fe04209dc8ed0","amp;dn":"D3DGear+v4.91.1893+Full-BRD+%5BTorDigger%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d395009b89e86a5259e92be46f1fe04209dc8ed0","infoHashBuffer":{"type":"Buffer","data":[211,149,0,155,137,232,106,82,89,233,43,228,111,31,224,66,9,220,142,208]},"announce":[],"urlList":[]}}