{"title":"Catalytic Ammonia Synthesis","uid":12074941,"size":46775976,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d4039f48ab6ee4cc3effa3d1ba2f6bdd796ad983&amp;dn=Catalytic+Ammonia+Synthesis&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1435614465,"description":"Catalytic Ammonia Synthesis - Fundamentals and Practice (Fundamental and Applied Catalysis)(Springer, 1991).pdf\n\nISBN 978-1-4757-9594-3\n\nThe phenomenon of catalysis is found in many homogeneous and heterogeneous systems undergoing chemical change, where it effects the rates of approach to the equilibrium state in processes as diverse as those found in the stars, the earth's mantle, living organisms, and the various chemistries utilized by industry. The economies and the living standards of both developed and developing countries depend to varying degrees upon the efficacy of their chemical industries. Con sequently, this century has seen a wide exploration and expansion of catalytic chemistry together with an intensive investigation of specific, essential processes like those contributing to life-supporting agricultures. Prime among the latter must surely be the &quot;fixation&quot; of atmospheric nitrogen by catalytic hydrogenation to anhydrous ammonia, still the preferred synthetic precursor of the nitrogenous components of fertilizers. In each decade contemporary concepts and techniques have been used to further the understanding, as yet incomplete, of the catalyst, the adsorbates, the surface reactions, and the technology of large-scale operation. The contributors to the present volume review the state of the art, the science, and the technology; they reveal existing lacunae, and suggest ways forward. Around the turn of the century, Sabatier's school was extending the descriptive catalytic chemistry of hydrogenation by metals to include almost all types of multiple bond. The triple bond of dinitrogen, which continued to be more resistant than the somewhat similar bonds in carbon monoxide and ethyne, defied their efforts","torrent":{"xt":"urn:btih:d4039f48ab6ee4cc3effa3d1ba2f6bdd796ad983","amp;dn":"Catalytic+Ammonia+Synthesis","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d4039f48ab6ee4cc3effa3d1ba2f6bdd796ad983","infoHashBuffer":{"type":"Buffer","data":[212,3,159,72,171,110,228,204,62,255,163,209,186,47,107,221,121,106,217,131]},"announce":[],"urlList":[]}}