{"title":"Badfinger - Head First [2 CD's][1975][2000][320 KBPS]","uid":11725238,"size":152166549,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d419de3d3ce8970f14505ae8b18b827d75ceafbd&amp;dn=Badfinger+-+Head+First+%5B2+CD%27s%5D%5B1975%5D%5B2000%5D%5B320+KBPS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LameDuck69","files":28,"time":1425014948,"description":"Badfinger - Head First [2 CD's][1975][2000][320 KBPS]\n\n\n\nDisc 1:\n\n01. Lay Me Down\n02. Hey, Mr. Manager\n03. Keep Believing\n04. Passed Fast\n05. Rock 'N' Roll Contract\n06. Saville Row\n07. Moonshine\n08. Back Again\n09. Turn Around\n10. Rockin' Machine\n\n\nDisc 2:\n\n01. Time Is Mine\n02. Smokin' Gun\n03. Old Fashioned Notions\n04. Nothing to Show\n05. You Ask Yourself Why\n06. Keep Your Country Tidy\n07. To Say Goodbye\n08. Queen of Darkness\n09. I Can't Believe In\n10. Thanks to You All\n11. Lay Me Down\n-------------------------------------------\n**320 KBPS CBR\n**Cover Art\n-------------------------------------------------------\nBadfinger were a British rock band that originally consisted of Pete Ham, Mike Gibbins, Tom Evans and Ron Griffiths. The band evolved from an earlier group called The Iveys that was formed in 1961 by Ham, Ron Griffiths and David &quot;Dai&quot; Jenkins in Swansea, Wales. They were signed by the Beatles' Apple label in 1968 as The Iveys. In 1969, Griffiths left and was replaced by Joey Molland, and the band renamed itself Badfinger. In 1970, the band engaged American businessman Stan Polley to manage their commercial affairs. Over the next five years the band recorded several albums for Apple and toured extensively, before they became embroiled in the chaos of Apple Records' dissolution.\n\nBadfinger had four consecutive worldwide hits from 1970 to 1972: &quot;Come and Get It&quot; (written and produced by Paul McCartney), &quot;No Matter What&quot;, &quot;Day After Day&quot; (produced by George Harrison) and &quot;Baby Blue&quot;. In 2013, &quot;Baby Blue&quot; made a resurgence onto the &quot;Hot Rock Songs&quot; Billboard 100 chart at number 14, due to its featuring at the end of the series finale of the hit TV show Breaking Bad.[1] Their song &quot;Without You&quot; has been covered many times, including a Billboard number one hit for Harry Nilsson.\n\nThey signed to Warner Bros., but Polley's financial machinations resulted in a lawsuit by Warner over missing escrow account money. Warner's consequent withdrawal from market of the 1974 album, Wish You Were Here (seven weeks after its release), cut off the band's income. Three days before his 28th birthday, on 24 April 1975, Ham committed suicide by hanging himself, leaving a note that included damning comments about Polley.\n\nOver the next three years, surviving members struggled to rebuild their personal and professional lives against a backdrop of lawsuits. The albums Airwaves (1978) and Say No More (1981) floundered, as Molland and Evans see-sawed between co-operation and struggle in attempts to revive and capitalise on the Badfinger legacy. Having seen Ham's body after Ham's wife had called him, Evans reportedly never got over his friend's suicide, and was quoted as saying in darker moments, &quot;I wanna be where he is.&quot;[2] On 19 November 1983, Evans also took his own life by hanging.\n--------------------------------------------------------------------------------\nHead First is the final studio album to released by British rock band Badfinger, released on November 14, 2000 but recorded 26 years earlier in December 1974, at the Beatles' Apple Studios in London and remained unreleased. Originally intended to be Badfinger's third album under its six-album contract with Warner Bros. Records, the recordings were shelved when legal difficulties erupted between the band and WB that year, and the version that was finally released (as Badfinger's twelfth album, including two live albums) was a rough mix of the album made by Phil McDonald, one of the engineers at Apple. The cover art for the album is a lion roaring.\n--------------------------------------------------------------------------------\n\nPersonnel: \n\nPete Ham: guitar, keyboards, vocals\nTom Evans: bass, synthesizer, vocals\nBob Jackson: guitar, keyboards, vocals\nMike Gibbins: drums, percussion, vocals","torrent":{"xt":"urn:btih:d419de3d3ce8970f14505ae8b18b827d75ceafbd","amp;dn":"Badfinger+-+Head+First+%5B2+CD%27s%5D%5B1975%5D%5B2000%5D%5B320+KBPS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d419de3d3ce8970f14505ae8b18b827d75ceafbd","infoHashBuffer":{"type":"Buffer","data":[212,25,222,61,60,232,151,15,20,80,90,232,177,139,130,125,117,206,175,189]},"announce":[],"urlList":[]}}