{"title":"Florrie - Little White Lies","uid":11056570,"size":5374463,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d44b22b4ef9d3d1e52fec3c8ed1eb59df1561a80&amp;dn=Florrie+-+Little+White+Lies&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"AidenHolland","files":1,"time":1411122642,"description":"Florence Arnold (born 28 December 1988) better known by her stage name Florrie, is an English pop singer, songwriter, drummer and model. Closely associated with the Xenomania production house, since joining as their in-house drummer in 2008 she has played live and on record for popular artists such as Kylie Minogue, Girls Aloud and the Pet Shop Boys.\n\nIn 2010, she began a solo career. She has drawn positive reaction from the online music community for releasing her own material in collaboration with remixers such as Fred Falke for download without charge. In 2010, Florrie released a four-track EP titled Introduction, followed by the six-track EP Experiments in 2011, and by the four-track EP Late in 2012. In April 2013, Florrie released a single, &quot;Live a Little&quot;, that was used in promotion for Sony's XBA-C10 in-ear headphones campaign. In February 2014, she announced that she had signed to a major label, Sony Music, a forthcoming EP, Sirens, which was released in April, and an album to follow by the end of the year. In July, Florrie released Little White Lies, the first single taken from her debut album.","torrent":{"xt":"urn:btih:d44b22b4ef9d3d1e52fec3c8ed1eb59df1561a80","amp;dn":"Florrie+-+Little+White+Lies","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d44b22b4ef9d3d1e52fec3c8ed1eb59df1561a80","infoHashBuffer":{"type":"Buffer","data":[212,75,34,180,239,157,61,30,82,254,195,200,237,30,181,157,241,86,26,128]},"announce":[],"urlList":[]}}