{"title":"PETER PAN - Platinum Edition - DVD 2 [EXTRAS] [FullDVD PAL]","uid":3640503,"size":4389783769,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:d54c5589b01b30cb21efc997c0701a650708bdb4&amp;dn=PETER+PAN+-+Platinum+Edition+-+DVD+2+%5BEXTRAS%5D+%5BFullDVD+PAL%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"jfmrey","files":104,"time":1174136770,"description":"\n PETER PAN - Platinum Edition\n\n DVD 2 The Extras\n\n FullDVD\n\n PAL\n\n \n Audio......: English, Spanish, Portuguese, Cesky\n Subtitles..: English, Spanish, Portuguese, Cesky\n\n Main menu : English, Spanish, Portuguese, Cesky\n\n Only removed : English Read-Along : Peter Pan (Games &amp; Activities). It&amp;#039;s the entire movie with subs in english.\n\n\nTHE EXTRAS\n \nThe second DVD is packed with nifty extras, some that will appeal more to the younger set, and some that are more geared towards their parents. There are games and activities to appeal to the video game generation. &quot;Camp Neverland&quot; offers three multi-level games: Sudoku Challenge, Tarrrget Practice, and Tink&amp;#039;s Fantasy Flight. My kids are really into Sudoku, and the younger ones played it for quite a while. My 10-year-old daughter is a Sudoku whiz, though, and it wasn&amp;#039;t challenging enough to keep her intrigued for long.\n\nThey were never able to quite figure out how to get the target practice to work with our remote, and got frustrated with that pretty quickly. Kids, kids-at-heart, and would-be Lost Boys can take a Virtual Flight with Peter over the London Skyline. There&amp;#039;s also a music video of Disney teeny-bopper group T-Squad singing &quot;The Second Star to the Right.&quot; I could take it or leave it -- I don&amp;#039;t really get the appeal of all these manufactured kid bands, but my kids seem to like it. Overall, the games held the interest of my kids, ages 10, 7 and 5, for a while, but they were really more interested in just watching the movie over and over again and acting out the scenes along with it. Two of them are learning to read, and they particularly like the feature that let&amp;#039;s them watch the words on screen while watching the movie.\n\nThere are a slew of goodies lurking behind &quot;Backstage Disney&quot; and the &quot;Music and More&quot; sections of the bonus disc. Included are a couple of deleted songs -- a pirate song and a lovely song about Never Land (music and lyrics by Richard Sherman) that includes a video of the song being performed by Paige O&amp;#039;Hara, aka Belle from Disney&amp;#039;s Beauty and the Beast. Also included is a special &quot;making of&quot; look at how the hand-drawn animation was done using real people as models, and how Tinkerbell evolved from the flashlight used to represent her in the stage play to a full-blown miniature woman more in keeping with the Tinkerbell from the silent film version. An interview with Margaret Kerry, the model for Tinkerbell, gives a peek at how Tink was brought to life (and those rumors about Tinkerbell being modeled after Marilyn Monroe are laid to rest, once and for all). We also get a sneak peek at the all-new Tinkerbell animated movie that&amp;#039;s underway. I also learned some new things -- for instance, that the actress who voiced Wendy also voiced Alice in Disney&amp;#039;s version of Alice in Wonderland. Now that I know that, it seems obvious, but it never clicked before.\n\nDisney&amp;#039;s version of Peter Pan was the first time Peter Pan had been played by a &quot;boy&quot; -- all the stage versions up to that point (and the 1924 silent film version) starred women in the role of Peter. This led to a great discussion with my daughter about the 1954 Producer&amp;#039;s Showcase version starring Mary Martin, which we&amp;#039;ve resolved to track down. The Disney version of Peter Pan is drawn like a boy, and voiced by Disney child star Bobby Driscoll, who also starred in Song of the South and Treasure Island. Driscoll died an early and tragic death.\n\nOne of the extras I particularly enjoyed was the feature &quot;In Walt&amp;#039;s Words: Why I Made Peter Pan.&quot; The history of Walt Disney&amp;#039;s love for the story of Peter Pan is lovingly recreated here, including a bit of a (what I assume to be) a sepia-toned recreation of a young Walt playing Peter in a school play. We also get to see rejected beginnings to the film that would have started the film in Neverland rather than the Darling&amp;#039;s nursery. Another version would have started with J.M. Barrie&amp;#039;s story about how Peter Pan came into being, but that was rejected by Disney as really being a separate story. Other proposed early versions of the tale that would have had Mrs. Darling, not Wendy, capture Peter&amp;#039;s shadow, or had the dog, Nana, accompany the children to Never Land and narrate the film in a voiceover.\n","torrent":{"xt":"urn:btih:d54c5589b01b30cb21efc997c0701a650708bdb4","amp;dn":"PETER+PAN+-+Platinum+Edition+-+DVD+2+%5BEXTRAS%5D+%5BFullDVD+PAL%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d54c5589b01b30cb21efc997c0701a650708bdb4","infoHashBuffer":{"type":"Buffer","data":[213,76,85,137,176,27,48,203,33,239,201,151,192,112,26,101,7,8,189,180]},"announce":[],"urlList":[]}}