{"title":"Analysis and Performance of Engineering Materials","uid":14414781,"size":14325507,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d602456c3e31fb7340182d29ec40f172703fae40&amp;dn=Analysis+and+Performance+of+Engineering+Materials&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1461486810,"description":"Analysis and Performance of Engineering Materials - Key Research and Development - Gennady E. Zaikov, DSc (AAP, 2016).pdf\r\n\r\nISBN 978-1-4987-0773-2\r\n\r\nThis new book facilitates the study of problematic chemicals in such applications as chemical fate modeling, chemical process design, and experimental design. It provides a valuable overview of current chemical processes, products, and practices and analyzes theories to formulate and prove physicochemical principles. It addresses the production and application of polymers, including chemical, physicochemical, and purely physical methods of examination.\r\n\r\nTopics include:\r\n\r\n• Radiotransparent fiberglass plastic products based on highly cross-linked polymer matrices\r\n\r\n• Properties and development of hyaluronan (HA) for pharmaceutical applications\r\n\r\n• Adhesive bonding of steel sheets treated by nitrooxidation in comparison with nontreated steel\r\n\r\n• Results of simulation by the Monte Carlo method of kinetics of three-dimensional free-radical polymerization of tetrafunctional monomers (TFM)\r\n\r\n• Elastomeric compositions based on systems with functionally active components for extreme conditions\r\n\r\n• Experimental research on efficient clearing of gas emissions in the manufacture of ceramic materials\r\n\r\n• The use of solar cells in the manufacture of textile materials\r\n\r\n• Ceramization of polymer compositions as a method for flame retardancy in materials\r\n\r\nThe important research found in this book will aid scientists and researchers in developing improved engineering materials. The book’s coverage of a broad spectrum of key developments can be applied in industrial chemistry, biochemistry, and materials science","torrent":{"xt":"urn:btih:d602456c3e31fb7340182d29ec40f172703fae40","amp;dn":"Analysis+and+Performance+of+Engineering+Materials","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d602456c3e31fb7340182d29ec40f172703fae40","infoHashBuffer":{"type":"Buffer","data":[214,2,69,108,62,49,251,115,64,24,45,41,236,64,241,114,112,63,174,64]},"announce":[],"urlList":[]}}