{"title":"Basta De Depresion Dr roberto Bonomi Audiolibro","uid":6473656,"size":45371176,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d679f4ed05a3c95d0ec2e9a1e78de64fe59ea85e&amp;dn=Basta+De+Depresion+Dr+roberto+Bonomi+Audiolibro&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gatasalvaje","files":-1,"time":1308234194,"description":"BASTA DE DEPRESION, Dr. Roberto Bonomi [ Audiolibro ]  RelajaciÃƒÂ³n y motivaciÃƒÂ³n subliminal positiva para combatir la depresiÃƒÂ³n.DescripciÃƒÂ³n\n\nExisten muchas formas en que se puede sufrir mentalmente, pero la depresiÃƒÂ³n es la mas comÃƒÂºn.\nCada aÃƒÂ±o, millones y millones de personas padecen enfermedades depresivas, y junto a esos millones de personas que presentan sÃƒÂ­ntomas de depresiÃƒÂ³n , existen cientos de miles de casos de depresiones encubiertas, es decir que existen cientos de miles de personas que no se dan cuenta de que sus dolores fÃƒÂ­sicos, son, en realidad sÃƒÂ­ntomas de depresiÃƒÂ³n.\n\nÃ‚Â¿Que es la depresion? Podemos decir que, en general en la psiquiatrÃƒÂ­a, la depresiÃƒÂ³n es tan comÃƒÂºn como el resfrÃƒÂ­o de la medicina clÃƒÂ­nica, por lo que es la enfermedad que provoca mas consultas al mÃƒÂ©dico.\nCon lo comÃƒÂºn que es esta enfermedad, es increÃƒÂ­ble la cantidad de personas que tienen informaciÃƒÂ³n errÃƒÂ³nea sobre que es la depresion, y es precisamente esta informaciÃƒÂ³n errÃƒÂ³nea la que les impide tomar consciencia de su dolencia y combatir la depresiÃƒÂ³n\n\nPor eso existen tres puntos que deben ser resaltados al respecto y que son:\n- La depresiÃƒÂ³n es una enfermedad\n- El paciente no es culpable de tener depresiÃƒÂ³n\n- La depresiÃƒÂ³n puede ser tratada\n\nTener depresiÃƒÂ³n es como tener encima una piedra de una tonelada, es algo que nos inmoviliza, algo que nos hace pensar que nada se puede hacer para solucionar nuestros problemas, que estamos solos frente al mundo y sin remedio, porque sentimos que los demÃƒÂ¡s no se pueden dar cuenta de cuÃƒÂ¡n profundo es nuestro dolor.\n\nPero relÃƒÂ¡jese, ya que ha dado con la forma adecuada para eliminar fÃƒÂ­sica y emocionalmente las cargas negativas de su pasado, y de esta forma puede de ahora en mÃƒÂ¡s combatir la depresiÃƒÂ³n, renovarse y revitalizar su vida.\n\nLa depresiÃƒÂ³n es un sÃƒÂ­ntoma de que algo no estÃƒÂ¡ funcionando bien en Ud. y yo le dirÃƒÂ© como solucionarlo. Algo que debe tomar en cuenta, es que la depresiÃƒÂ³n puede ser el comienzo de un cambio en su vida, la advertencia de que no puede seguir viviendo como hasta ahora, y que dentro suyo se estÃƒÂ¡n gestando las fuerzas necesarias como para cambiar de forma de ser.\n\nCONTENIDO DE LOS EJERCICIOS\nEste CD consta de dos ejercicios, el primero es un ejercicio de relajacion y motivaciÃƒÂ³n positiva para combatir la depresiÃƒÂ³n, que es guiado paso a paso por el Dr. Bonomi\nEste ejercicio no debe escucharse cuando estÃƒÂ© manejando el auto o necesite mantener su atenciÃƒÂ³n, ya que le inducirÃƒÂ¡ niveles mentales profundos que pueden conducirle al sueÃƒÂ±o.\n\nEl segundo ejercicio es subliminal, o dicho de otra forma contiene mensajes que permiten combatir la depresiÃƒÂ³n desde los niveles subconcientes. Y estÃƒÂ¡ acompaÃƒÂ±ado por el sonido de las olas del mar mezcladas con una suave pulsaciÃƒÂ³n denominada sonido Alpha, que sirve para centrar su cerebro en frecuencias cerebrales profundas.\nPor debajo de las olas del mar y el sonido Alpha, en una frecuencia inaudible para la mente consciente, estÃƒÂ¡n grabadas las frases con las cuales podrÃƒÂ¡ modificar el contenido de su mente subconsciente.\nEste ejercicio subliminal puede ser escuchado en cualquier momento o lugar (inclusive mientras maneja su automovil) y tantas veces al dÃƒÂ­a como desee (cuantas mÃƒÂ¡s veces lo escuche mejor podrÃƒÂ¡ combatir la depresiÃƒÂ³n), ya que han sido removidas todas las frases que podÃƒÂ­an inducirle al sueÃƒÂ±o.\n","torrent":{"xt":"urn:btih:d679f4ed05a3c95d0ec2e9a1e78de64fe59ea85e","amp;dn":"Basta+De+Depresion+Dr+roberto+Bonomi+Audiolibro","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d679f4ed05a3c95d0ec2e9a1e78de64fe59ea85e","infoHashBuffer":{"type":"Buffer","data":[214,121,244,237,5,163,201,93,14,194,233,161,231,141,230,79,229,158,168,94]},"announce":[],"urlList":[]}}