{"title":"Plain White T's - Hate (I Really Don't Like You)  (2nafish","uid":5418935,"size":119789572,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:d6c271963ca452c4ef50878dc1908d1364f4b5d8&amp;dn=Plain+White+T%5C%27s+-+Hate+%28I+Really+Don%5C%27t+Like+You%29++%282nafish&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1268026026,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Hate (I Really Don't Like You)&quot; is a single by the Plain White T's. It is the first single from their fourth studio album Every Second Counts. This song has an acoustic version available on the Best Buy version of Every Second Counts. The song had become one of the band's biggest hit and was regarded as a major success. Recently however, the success of &quot;Hey There Delilah&quot; had overshadowed the song's achievements.\n\nThere is also a music video for &quot;Hate (I Really Don't Like You)&quot; that has been shot and is being shown on major music channels. The video has been seen on MTV, Kerrang!, MTV2 and Fuse TV. The music video shows lead singer Tom Higgenson taking a stroll in the city while many scenes of chaos are happening. It also has shots of the band performing in what seems to be a warehouse. His ex-girlfriend comes along, and in surprise continues to watch him perform. It was filmed in Toronto, Canada.\n\nEvery Second Counts is the fourth studio album released by the Plain White T's. It is the first Plain White T's album to be released on Hollywood Records along with Fearless Records. The album peaked at #10 on Billboard 200 on July 29, 2007 and was certified Gold by the RIAA in October 2007. Every Second Counts peaked at #3 on the UK top 75 albums.\n\nPlain White T's is an American pop rock band started in 1997, originally from Villa Park, Illinois. Formed by high school friends Tom Higgenson and Ken Fletcher, the group had a mostly underground following in Chicago basements, clubs, and bars in its early years, and underwent numerous personnel changes. The band is best known for the songs &quot;Hey There Delilah&quot;, which charted highly in many countries, and &quot;1, 2, 3, 4&quot;. In 2008, they received a Grammy nomination for &quot;Hey There Delilah&quot;. The band broke into the mainstream following the success of &quot;Hey There Delilah&quot; and the well-received &quot;Hate (I Really Don't Like You)&quot; from the album Every Second Counts. The group's latest album is Big Bad World, released in 2008.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:d6c271963ca452c4ef50878dc1908d1364f4b5d8","amp;dn":"Plain+White+T%5C%27s+-+Hate+%28I+Really+Don%5C%27t+Like+You%29++%282nafish","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d6c271963ca452c4ef50878dc1908d1364f4b5d8","infoHashBuffer":{"type":"Buffer","data":[214,194,113,150,60,164,82,196,239,80,135,141,193,144,141,19,100,244,181,216]},"announce":[],"urlList":[]}}