{"title":"AFI - December Underground","uid":5641661,"size":42999737,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d6f8dd61d993d5d3b945620989ab07d3a75044ff&amp;dn=AFI+-+December+Underground&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"musikfreak83","files":12,"time":1277133137,"description":"As AFI rode onto mainstream radio playlists with their gleaming major label debut, Sing the Sorrow, the rumble of disenchanted fans nearly drowned out that of their dark-hued music. But the heavily-tattooed San Francisco band aren't looking back on Decemberunderground, a slickly-produced, MTV-friendly disc brimming with sinister pop charms. The opening &quot;Prelude 12/21&quot; sets the upbeat tone with handclaps, strings, and a cheeky glam-rock stomp. AFI might still operate in that distinct area where punk, goth, and frightening stadium rock come together, only now they seem intent on crashing the retro '80s party attended by the likes of Franz Ferdinand and the Killers, with flashy tracks such as &quot;Miss Muder&quot; and the synth-heavy &quot;Love Like Winter.&quot; &quot;The Interview,&quot; meanwhile, is the closest Davey Havok has ever come to crooning a lighter-waving epic. Despite the odd lapse into the Cookie Monster metal territory of their early days (&quot;Kill Caustic,&quot; &quot;Affliction&quot;), Decemberunderground is even more ambitious than its predecessor. First comes the backlash, then comes the platinum.","torrent":{"xt":"urn:btih:d6f8dd61d993d5d3b945620989ab07d3a75044ff","amp;dn":"AFI+-+December+Underground","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d6f8dd61d993d5d3b945620989ab07d3a75044ff","infoHashBuffer":{"type":"Buffer","data":[214,248,221,97,217,147,213,211,185,69,98,9,137,171,7,211,167,80,68,255]},"announce":[],"urlList":[]}}