{"title":"Porcupine Tree - 2007 - Fear of a Blank Planet [TQMP]","uid":6499259,"size":340628285,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d81ea31e923ab3b23c22c944ce14c49eb8c38d4f&amp;dn=Porcupine+Tree+-+2007+-+Fear+of+a+Blank+Planet+%5BTQMP%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"quose","files":-1,"time":1309188526,"description":" ____________________________________________________________________________\n|                                                                            |\n|               Porcupine Tree - 2007 - Fear of a Blank Planet               |::\n|                                                                            |::\n|          Ripped w/EAC v1.0b2 (Secure) :: Encoded w/FLAC v1.2.1 -8          |::\n|____________________________________________________________________________|::\n  ::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::\n\n       +--------------+\n+------+ Pack / Files +--------------------------------------------------------+\n|      +--------------+                                                        |\n|   No. of Files / Size _____ 20 files / 324.85MB (340,628,285 bytes)          |\n|                                                                              |\n+------------------------------------------------------------------------------+\n\n       +--------------+\n+------+ Audio Source +--------------------------------------------------------+\n|      +--------------+                                                        |\n|   Type / Quantity _________ CD (Compact Disc) (* 1)                          |\n|   Date Released ___________ 16th of April, 2007                              |\n|   User Rating _____________ 4.1/5 (1277 ratings)                             |\n|   Genre(s) ________________ Progressive Rock                                 |\n|                                                                              |\n+------------------------------------------------------------------------------+\n\n       +--------+\n+------+ Review +--------------------------------------------------------------+\n|      +--------+                                                              |\n|   A lonely teenager sits on a couch, watching the TV and zapping with his    |\n|   remote. He's just gamed his fingers to death with his new Xbox. His        |\n|   parents try to talk him out of his lazy habitual lifestyle. He does not    |\n|   respond. They try again, but he ignores them no matter what, his eyes      |\n|   blank and still staring straight at the electronical screen before him.    |\n|   Eventually his parents just give up, leaving him to wallow in his own      |\n|   self-absorbed terrible way of living.                                      |\n|                                                                              |\n|   This is the picture of youth Steven Wilson of Porcupine Tree sketches in   |\n|   the opening track of his latest release, Fear Of A Blank Planet. His       |\n|   decidedly haunting lyrical poetics set the tone for what now already is    |\n|   about to become one of the best albums of the year, not in the least       |\n|   because of the strengths of this album, which lie where they have always   |\n|   lain for this band: the invoking of atmosphere and a sense of              |\n|   psychedelia, layered with thick bass lines, complex drum patterns and      |\n|   melodic guitar riffs.                                                      |\n|                                                                              |\n|   The aforementioned riffs are definitely what make the atmosphere on this   |\n|   album. Wilson chugs out riffs that are louder, darker, more atmospheric,   |\n|   harder, just overall more evil than they usually are. Aided by some        |\n|   cutting edge lyrics of angst and harsh social criticism interwoven in      |\n|   the songs, the album's moods range from melancholy to raging to            |\n|   clinically depressed. This is the first Porcupine Tree outing ever that    |\n|   I have seen that has gone full throttle on the dark side of life like      |\n|   this. The whole disc retains this atmosphere due to the lyrical content    |\n|   of the album being themed around one thing: the sorry state of youth. It   |\n|   is a miserable ride through destroyed teenage lives all the way            |\n|   through.                                                                   |\n|                                                                              |\n|   And his riffs are not just atmospheric or moody. They can be plain         |\n|   monstrous at times. If you have been impressed by Opeth or Dream Theater   |\n|   riffs, just wait till you hear the musical orgasm that is Anesthetize.     |\n|   Containing all the core elements of the PT sound in one seventeen minute   |\n|   plus epic, it begins in a psychedelic mood more reminiscent of Pink        |\n|   Floyd with too much mellotron-esque feel. It slowly moves on and on,       |\n|   until it breaks into a middle part which shows a panorama of metal riffs   |\n|   that would make Mikael Akerfeldt accuse Wilson of blatant plagiarism,      |\n|   that's just how badass and evil this piece is. And it's not just Wilson    |\n|   who shines on here. The band brought in Alex Lifeson (yes, the famous      |\n|   Rush guitarist), who delivers a top-notch guitar solo in the song, and     |\n|   additionally, Gavin Harrison's drumming is just jaw-dropping. It's         |\n|   incredibly tight too; when at the eleven-minute-mark Wilson throws open    |\n|   the guitar sound full throttle it sounds like all hell breaks loose, but   |\n|   due to the drumming not a second of this outburst of violence can be       |\n|   regarded as misplaced. To put it in one word: astounding.                  |\n|                                                                              |\n|   Next to Anesthetize and the title track, which show some of the heavy      |\n|   sides of the band, Porcupine Tree know that they are not a complete all    |\n|   -out metal band destined to kick your ass. They let down the tempo on      |\n|   two tracks. While My Ashes is a decidedly dodgy ballad in the sense that   |\n|   it tries to be Trains, but fails, Sentimental is a more than adequately    |\n|   upgraded version of Lazarus. A great ballad that allows you a breather     |\n|   in between two of the heaviest tracks of the band's impressive             |\n|   catalogue. As Wilson croons out how he doesn't want to really go           |\n|   anywhere and sees that he can't blame his parents for his mistakes, he     |\n|   inadvertently conveys the message of hopelessness and emptiness that       |\n|   besets the whole album.                                                    |\n|                                                                              |\n|   He follows that up with the plainly disturbing Way Out Of Here, which      |\n|   begins with a soundscape from another guest (Robert Fripp of King          |\n|   Crimson fame), but also turns out to have some lyrics that would make      |\n|   Cobain's sense of angst hide in fear of being called a wuss. Especially    |\n|   the verses are heartbreaking and flow along so nicely with the             |\n|   atmosphere of fear and anxiety that once again weaves its threads all      |\n|   through the song. It may be best illustrated by an example:                |\n|                                                                              |\n|   &quot;I can't take the staring and the sympathy                                 |\n|   And I don't like the questions:                                            |\n|   &quot;How do you feel?&quot;                                                         |\n|   &quot;How's it going at school?&quot;                                                |\n|   &quot;Do you wanna talk about it?&quot;                                              |\n|                                                                              |\n|   The prime example of an alienated teenager right here folks, and without   |\n|   a mention of self-harming activities. We don't need explicit imagery to    |\n|   show us how just how messed up we actually are. Just an insight into a     |\n|   troubled mind refusing to answer to the essential questions of life will   |\n|   do, and excellently at that.                                               |\n|                                                                              |\n|   The album ends on a decent note with Sleep Together, which comprises the   |\n|   end. It's not bad by any means, but here I have the feeling that it's      |\n|   something I've already seen before, but the chorus more than makes up      |\n|   for it; even if Porcupine Tree are not going to get a gold star for        |\n|   originality they will at least obtain an award for sheer consistency and   |\n|   class.                                                                     |\n|                                                                              |\n|   So if you are ready for a ride through the dark side of the adolescent     |\n|   mind, spend your bucks on this baby, and sit back and enjoy. Steven        |\n|   Wilson and companions have no doubt created the album of the year with a   |\n|   deftly crafted, varied, yet continuously haunting at atmospheric disc      |\n|   that will leave you begging for repeat plays for weeks after and           |\n|   continually referencing when dealing with teenage angst. Just one last     |\n|   warning: if you're not down with modern metal, this album just may be a    |\n|   little too much to digest. Nevertheless the lyrical concept and the        |\n|   atmospheres still ring true in a world which just exemplifies the stage    |\n|   the band subtly sets. Ergo, I still believe this could be a timeless       |\n|   album due to its relevancy, and I recommend you pick this up first thing   |\n|   in the morning. [jorn van schaik, sputnikmusic]                            |\n|                                                                              |\n+------------------------------------------------------------------------------+\n\n       +------------+\n+------+ Track List +----------------------------------------------------------+\n|      +------------+                                                          |\n|   No. | Title                                                  | Duration    |\n|   ----+--------------------------------------------------------+----------   |\n|   001 | Fear of a Blank Planet ............................... | 00h07m28s   |\n|   002 | My Ashes ............................................. | 00h05m07s   |\n|   003 | Anesthetize .......................................... | 00h17m42s   |\n|   004 | Sentimental .......................................... | 00h05m27s   |\n|   005 | Way Out of Here ...................................... | 00h07m38s   |\n|   006 | Sleep Together ....................................... | 00h07m29s   |\n|   ----+--------------------------------------------------------+----------   |\n|                                                                              |\n|   Total Length ____________ 00h50m51s                                        |\n|                                                                              |\n+------------------------------------------------------------------------------+\n\n       +-----------+\n+------+ Audio Rip +-----------------------------------------------------------+\n|      +-----------+                                                           |\n|   Ripped with _____________ EAC v1.0b2 [http://www.exactaudiocopy.de]        |\n|   Encoded with ____________ FLAC v1.2.1 [http://flac.sourceforge.net]        |\n|   Encoding Stats __________ 1411kbps / 44.1kHz / CBR / 16-bit / Stereo       |\n|   Tag(s) __________________ Vorbis                                           |\n|   Includes Artwork? _______ Yes                                              |\n|   Includes Rip .LOG? ______ Yes                                              |\n|   Includes Rip .CUE? ______ Yes                                              |\n|   Includes Playlist? ______ Yes                                              |\n|                                                                              |\n+------------------------------------------------------------------------------+\n\nrainfo v0.2 [2011/06/27 @ 21:17:03]","torrent":{"xt":"urn:btih:d81ea31e923ab3b23c22c944ce14c49eb8c38d4f","amp;dn":"Porcupine+Tree+-+2007+-+Fear+of+a+Blank+Planet+%5BTQMP%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d81ea31e923ab3b23c22c944ce14c49eb8c38d4f","infoHashBuffer":{"type":"Buffer","data":[216,30,163,30,146,58,179,178,60,34,201,68,206,20,196,158,184,195,141,79]},"announce":[],"urlList":[]}}