{"title":"The Queen of New Beginnings - Erica James.epub","uid":9332154,"size":1040969,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d91b3ccd80b2d4d329ebc323ccfaad0b489790f5&amp;dn=The+Queen+of+New+Beginnings+-+Erica+James.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1386788464,"description":"A sparkling new tale from the author of &quot;A Breath of Fresh Air,&quot; for anyone who has ever dreamt of starting over Alice Shoemaker habitually goes to great lengths to avoid telling the truth about herself and her past. After agreeing to help out a friend by shopping and cleaning for the unknown man staying at Cuckoo House, she soon becomes suspicious that her strange and obnoxiously rude client has something to hide. Clayton Miller's life is a mess. His career as one of the country's best comedy scriptwriters has stalled, and his long-term girlfriend has left him for his ex-best friend and ex-writing partner. Just when he thinks his life couldn't get any worse, he commits a spectacularly public fall from grace, and with the press hounding him, his agent banishes him to the middle of nowhere until the dust has settled. When Alice and Clayton discover the truth about each other they form an unlikely friendship--until Alice discovers Clayton has betrayed her in the worst possible way.","torrent":{"xt":"urn:btih:d91b3ccd80b2d4d329ebc323ccfaad0b489790f5","amp;dn":"The+Queen+of+New+Beginnings+-+Erica+James.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d91b3ccd80b2d4d329ebc323ccfaad0b489790f5","infoHashBuffer":{"type":"Buffer","data":[217,27,60,205,128,178,212,211,41,235,195,35,204,250,173,11,72,151,144,245]},"announce":[],"urlList":[]}}