{"title":"Characterization of Solid Materials and Heterogeneous Catalysts","uid":15385530,"size":22179350,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d91eaa8258ad32f6f5bde59b4da7b8f666f714b5&amp;dn=Characterization+of+Solid+Materials+and+Heterogeneous+Catalysts&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1469289834,"description":"Characterization of Solid Materials and Heterogeneous Catalysts - Michel Che, Jacques C. Vedrine (Wiley-VCH, 2012).pdf\r\n\r\nThis two-volume book provides an overview of physical techniques used to characterize the structure of solid materials, on the one hand,\r\nand to investigate the reactivity of their surface, on the other. Therefore this book is a must-have for anyone working in fields related to surface\r\nreactivity. Among the latter, and because of its most important industrial impact, catalysis has been used as the directing thread of the book.\r\nAfter the preface and a general introduction to physical techniques by M. Che and J.C. Védrine, two overviews on physical techniques are\r\npresented by G. Ertl and Sir J.M. Thomas for investigating model catalysts and porous catalysts, respectively.\r\nThe book is organized into four parts: Molecular/Local Spectroscopies, Macroscopic Techniques, Characterization of the Fluid Phase (Gas and/\r\nor Liquid), and Advanced Characterization. Each chapter focuses upon the following important themes: overview of the technique, most important parameters to interpret the experimental data, practical details, applications of the technique, particularly during chemical processes,\r\nwith its advantages and disadvantages, conclusions","torrent":{"xt":"urn:btih:d91eaa8258ad32f6f5bde59b4da7b8f666f714b5","amp;dn":"Characterization+of+Solid+Materials+and+Heterogeneous+Catalysts","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d91eaa8258ad32f6f5bde59b4da7b8f666f714b5","infoHashBuffer":{"type":"Buffer","data":[217,30,170,130,88,173,50,246,245,189,229,155,77,167,184,246,102,247,20,181]},"announce":[],"urlList":[]}}