{"title":"Dangerous Divas - Devious Disguises","uid":7745721,"size":571427620,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:d9a7a0ad770528b4940ea7b83c14ca7fc5551c60&amp;dn=Dangerous+Divas+-+Devious+Disguises&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"merzedes","files":-1,"time":1350760762,"description":"Dangerous Diva's Devious Disguises! FMConcepts\n \nStars: Jade Indica, Molly Matthews, Franziska Facella, Ruby Luster and Loren Chance as the Dangerous Diva\n\nMP4.\n\nPreliminary research is occasionally necessary for Dangerous Diva's \nescapades, as when she took on the guise of a mild-mannered reporter \nfor a local newspaper to pump naive little Jade Indica about a \nprecious family heirloom! It was the ruthless woman in the catsuit, \nof course, who slipped into Jade's bedroom later that night, then \nball- gagged and frog-tied her as the girl writhed in her skimpy \nnightgown. Helpless and bereft of her treasure, poor Jade finally \nunderstood how cruelly she'd been conned! \n\nThe caper figured to be a simple one: hit the office when it was \nalmost deserted, tie and gag pretty secretary Franziska Facella, \ncrack the safe and score one for Dangerous Diva! But when the safe \nfailed to yield its booty, the Diva had to think fast! A brisk \ninterrogation of Franziska revealed that her contact for delivering \nthe sensitive device had been delayed; more promisingly, he'd never \nactually met Franziska! So after briskly stripping the frightened \ngirl of her clothes, D. D. left the squirming blonde hogtied and \ntape-gagged in pantyhose on her desk and headed off to complete her \nscore!\n\nMolly Matthews seethed for months after Dangerous Diva wrecked her \nblackmail scheme and mocked her as Molly squirmed naked and trussed \nup in her bathtub! Now, with the help of her friend Ruby Luster, \nMolly was about to achieve a richly-satisfying revenge! Bound and \nball-gagged, the Diva struggled as foul-smelling smoke filled the \nroom around her -- she cursed herself for letting her guard down so \ncompletely! But Molly's plan collapsed as the Diva wriggled free of \nher bonds! First Molly, then both she and Ruby tasted bondage \nhumiliation as only D. D. can dish it out! Legs spread and tied to a \nwooden bar, wrists roped together, Molly and Ruby squirmed naked and \nwhimpered through their ball-gags as the Diva laughed last once \nagain!\n\nTHERE IS TONS OF ON-SCREEN TYING BY THE DANGEROUS DIVA! \n\nScreens &lt;a href=&quot;\nhttp://www.dangerousdiva.com/dvd/dvd5.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.dangerousdiva.com/dvd/dvd5.html&lt;/a&gt;\n\n8000 uploads and counting, if you like what Shallow2 and I upload, how about leaving us a nice comment below ? :)   \n \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:d9a7a0ad770528b4940ea7b83c14ca7fc5551c60","amp;dn":"Dangerous+Divas+-+Devious+Disguises","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9a7a0ad770528b4940ea7b83c14ca7fc5551c60","infoHashBuffer":{"type":"Buffer","data":[217,167,160,173,119,5,40,180,148,14,167,184,60,20,202,127,197,85,28,96]},"announce":[],"urlList":[]}}