{"title":"Business Card Shop with CORE keygen v. 4.5.3","uid":8386997,"size":300771960,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:d9def34cda15f4fc22057f517a113156600e203b&amp;dn=Business+Card+Shop+with+CORE+keygen+v.+4.5.3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"polisdavid","files":-1,"time":1366310088,"description":"Official Web Site: &lt;a href=&quot; http://www.chronosnet.com/Products/businesscardshop.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.chronosnet.com/Products/businesscardshop.html&lt;/a&gt;\n\nMultigen courtesy of C.O.R.E\n\nBusiness Card Shop (was SOHO Business Cards) helps users create one-of-a-kind business card designs. Simple, one-step tools let users quickly draw shapes, add graphics, arrange and align objects, rotate objects and add designer special effects. There are more than 30 shapes with individual controls to help users create logos and custom design elements. Built-in rulers, project grid lines, snap-to-grid, real-time alignment guides and full zoom capabilities make positioning objects a breeze.\n\nBusiness Card Shop can import logos, photos and clip art in popular formats. A built-in Scrapbook lets users store favorite graphics, shapes, and text for quick and easy future reuse. The Scrapbook even remembers any special formatting or attributes applied to an object such as font, stroke color, transparency, masks, etc.\n\nWhat's New:\n\n* Added option to manually choose an iPhoto or Aperture library in the \n  version of the software sold directly from the Chronos website (the Mac\n   App Store version already has this capability)\n\n* Added error reporting when the iPhoto or Aperture library can't be \n  found or opened\n\n* Added iPhoto/Aperture Info button to see path and additional info \n  (including error information) for current library\n\n* Added a preview and other improvements to the Custom Layout sheet\n\n* Added ability to use custom stock sizes for cards other than US Letter \n  or A4\n\n* Added menu commands to show/hide/customize the toolbar\n\n* Added ability to start editing text in a selected text box by simply   \n  starting to type. This allows text boxes that are behind other objects to be \n  edited\n\n* Added Long date format in addition to existing Short, Medium, and \n  Full (formerly called &quot;Long&quot;) date formats\n\n* Added Short, Medium, Long, and Full date formats to the custom \n  option that exclude the year component\n\n* Fixed problem where it was possible to paste an object outside the \n  Canvas\n\n* Fixed problem creating a new layer when more than one document is \n  open\n\n* Fixed problem swapping the horizontal and vertical spacing in the\n   Custom Layout sheet when the orientation changes\n\n* Fixed problem creating a blank vertical card that resulted in a blank\n   horizontal card\n\n* Fixed problem swapping the horizontal and vertical spacing in the \n  Custom Layout sheet when the orientation changes\n\n* Fixed problem problem where if a photo that was just inserted was\n   cropped, then immediately uncropped, the photo would disappear\n\n* Fixed problem where a photo that was inserted then immediately set as\n   the background image wouldn't appear in the background\n\nSystem Requirements:\n\nIntel Mac,  OS X.6 or later\nProcessor type(s) &amp; speed: 64 Bit CPU\n\n--- PLEASE SEED ---\n\n","torrent":{"xt":"urn:btih:d9def34cda15f4fc22057f517a113156600e203b","amp;dn":"Business+Card+Shop+with+CORE+keygen+v.+4.5.3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9def34cda15f4fc22057f517a113156600e203b","infoHashBuffer":{"type":"Buffer","data":[217,222,243,76,218,21,244,252,34,5,127,81,122,17,49,86,96,14,32,59]},"announce":[],"urlList":[]}}