{"title":"Radio 2 Comedy Season - Tommy Cooper Just Like This! - Audio Com","uid":5707704,"size":54161285,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:db7a2abdaf76ff7b96a2fe822f28df3c9fa3891b&amp;dn=Radio+2+Comedy+Season+-+Tommy+Cooper+Just+Like+This%21+-+Audio+Com&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"_Slimoo_","files":1,"time":1279761151,"description":"Tommy Cooper: Just Like This! - Audio Comedy - BBC Radio 2 \n1 x 60 Minute Episodes - 128Kbps - Mp3 - Slimoo\n\n\nSean Lock looks at the life of a man who is as popular today as he ever was, and who is still finding new fans via the wonders of the internet. In a magical mix of Tommy from the archives, as well as new interviews, Radio 2 celebrates the career of a unique force in British comedy.\n\nFrom his early days and the first magic set, to the health problems and the fateful last television appearance, the programme looks back at his rollercoaster life. Sean Lock looks at how much of the comic's outward persona was a deliberate barricade [some friends have said they never really got to know the real Tommy] and how he found it difficult to be taken seriously because people started to laugh the moment he spoke.\n\nTommy broke every rule in the comedy book, he told jokes no other comedian would get away with, and he based his act around getting things wrong. In doing so he secured his place in our hearts forever. Eric Morecambe said he wouldn't go on stage after Cooper; Spike Milligan said his face was a call for help; and Bob Monkhouse called him an aggravated assault on the funny bone - what more indication of comedy genius do you need?\n\nThe programme features a host of new interviews with people who knew and loved him including Michael Parkinson, Ronnie Corbett, Barry Cryer, Sheila Steafal, Jimmy Cricket, John Miles (the man who looks after Tommy's estate), Royston Mayoh (producer and director, who worked on The Tommy Cooper Hour) and David Ball (from the Magic Circle, and Tommy's bank manager!).\n\n\nTommy Cooper: Just Like This!\n\n\n\nAudio Format    : MP3\nDuration        : 54mn 1s\nBit rate mode   : Constant\nBit rate        : 128 Kbps\nChannel(s)      : 2 channels\nSampling rate   : 44.1 KHz\nResolution      : 16 bits\n\n\n[","torrent":{"xt":"urn:btih:db7a2abdaf76ff7b96a2fe822f28df3c9fa3891b","amp;dn":"Radio+2+Comedy+Season+-+Tommy+Cooper+Just+Like+This%21+-+Audio+Com","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db7a2abdaf76ff7b96a2fe822f28df3c9fa3891b","infoHashBuffer":{"type":"Buffer","data":[219,122,42,189,175,118,255,123,150,162,254,130,47,40,223,60,159,163,137,27]},"announce":[],"urlList":[]}}