{"title":"PAC-MAN Championship Edition DX+","uid":8975285,"size":303388551,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:de3549dde3edc50efad443e023fdad6f76830830&amp;dn=PAC-MAN+Championship+Edition+DX%2B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"globeplus","files":-1,"time":1380417313,"description":"Hi Pacman fans ...\n\nPlay the new edition of the Pacman Championship...\n\nFILE INFO : NOTHING RIPPED and no extraction at all !!! just run the prepared executable and start playing ...\n\n\nGAMEPLAY\n\nPac-Man Championship Edition DX builds upon the gameplay of Pac-Man Championship Edition, in which players control Pac-Man as he travels through a maze collecting dots and avoiding ghosts, which can be eaten by collecting power pellets. Collecting all the dots on one side of the maze makes a fruit appear on the other side, which adds a new layout of dots on that side and so on. The game's speed increases as the player gets more points, and drops when the player loses a life. DX introduces a new type of ghost which sleeps in a stationary spot on the maze until Pac-Man moves past it and begins to follow him. By passing several sleeping ghosts, they form a large rainbow-colored trail which can offer massive bonus points once Pac-Man is able to get a power pellet and eat them. Some ghosts may also have additional power pellets which can prolong the powered up state if eaten in time. Getting close enough to the regular ghosts turns them rainbow coloured and they may also be added to the trail. A slow-motion effect automatically kicks in whenever a ghost gets too close to Pac-Man, offering players the chance to make a last-minute attempt to avoid being killed. Players can also use a limited supply of 'bombs' which return all the ghosts to the centre of the maze, though lowers the dot multiplier and game speed.\n\n\n\n* enjoy ... ","torrent":{"xt":"urn:btih:de3549dde3edc50efad443e023fdad6f76830830","amp;dn":"PAC-MAN+Championship+Edition+DX%2B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de3549dde3edc50efad443e023fdad6f76830830","infoHashBuffer":{"type":"Buffer","data":[222,53,73,221,227,237,197,14,250,212,67,224,35,253,173,111,118,131,8,48]},"announce":[],"urlList":[]}}