{"title":"Ice Lakes v1.2","uid":14947768,"size":355690066,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:de7d860ae7fead85ba460f67073663d01a905e91&amp;dn=Ice+Lakes+v1.2&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dauphong","files":1,"time":1466071428,"description":"About This Game\r\nIce Lakes is an ultimate ice fishing game with a sandbox approach to wintertime fishing. Rare subject, stunning graphics, realistic physics, fish behavior system, wide selection of fishing gear, single and multiplayer with different game modes in the various locations around the world, changing season, day time and weather conditions that also affect fish behavior makes Ice Lakes the ultimate ice fishing simulator.\r\nGame Features\r\n\r\n    Single player\r\n    Multiplayer up to 32 players (Online and LAN)\r\n    Dedicated servers (alpha version)\r\n    15 competition modes\r\n    14 tournaments\r\n    Over 20 fish species\r\n    12 open world maps\r\n    Extensive statistics about everything\r\n    Character customization\r\n    Rod movement. Lure the fish to take a bait by rod movement\r\n    Changing weather and time of day\r\n    Change of seasons (fall, winter, spring)\r\n    Fish behavior engine. A fish AI and swarm system controlling each species\r\n    Fishing equipment. Learn and master the use of dozens of jigs, rods, augers, baits and lures \r\n\r\nGame Description\r\nIn this game players can roam freely in the beautiful open world maps and explore river, pond and lake locations in diverse environments. Dare to go deeper into the wild where no fisherman has gone before and find the biggest catches. All maps are playable both in single player and multiplayer modes.\r\n\r\nFinding the best fishing spots by learning the depth maps and bottom topology of each location is fun, but requires patience and dedication. Nothing wins the expectation of finding the best location or catching the biggest fish from each lake.\r\n\r\nThe real excitement starts when it is time to throw fishing lines into the water and start fishing! The right equipment for right conditions are as essential as is mastering the location. The realistic fish behavior system, fish AI and fish swarms for over 20 fish species makes this game a lifelike fishing experience. Fishing gear can be chosen from a wide selection of different jigs, rods, augers and baits. A perfect combination of equipment for different species depends on the season, but especially weather and daytime conditions. Controlling a rod and a jig in the water in a right way and at the right depth in Ice Lakes is a skill of its own. Rod and jig physics guarantees that fish react authentically to player's actions.\r\n\r\nFishing independently without time limits or competitors makes Ice Lakes a relaxing game to play and tune your fishing skills in the comfort of your home. On the other hand, lengthy tournaments and very customizable single competitions will test the player's skills and knowledge, but will reward them with new equipment and limitless fame.\r\nFuture development\r\nAfter the release the development of Ice Lakes will continue and is improved based on the wishes of the community. Moreover, the game will get free content updates including more maps, game modes, fish species, equipment and more. We will also continue improving the online multiplayer with near future plans on releasing a separate dedicated server and adding support for community arranged tournaments","torrent":{"xt":"urn:btih:de7d860ae7fead85ba460f67073663d01a905e91","amp;dn":"Ice+Lakes+v1.2","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de7d860ae7fead85ba460f67073663d01a905e91","infoHashBuffer":{"type":"Buffer","data":[222,125,134,10,231,254,173,133,186,70,15,103,7,54,99,208,26,144,94,145]},"announce":[],"urlList":[]}}