{"title":"Donald Bloxham - The Great Game of Genocide [2005][A]","uid":9948342,"size":4542305,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e05c3e23bcbba66c13c54f2e914ad15d9a322aa3&amp;dn=Donald+Bloxham+-+The+Great+Game+of+Genocide+%5B2005%5D%5BA%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anette14","files":-1,"time":1397351041,"description":"Description\nProduct details\nBook Title: The Great Game of Genocide: Imperialism, Nationalism, and the Destruction of the Ottoman Armenians\nBook Author: Donald Bloxham (Author)\nPaperback: 352 pages\nPublisher: OUP Oxford (26 July 2005)\nLanguage: English\nISBN-10: 0199226881\nISBN-13: 978-0199226887\n\nBook Description\nPublication Date: 26 July 2005\nThe Great Game of Genocide addresses the origins, development and aftermath of the Armenian genocide in a wide-ranging reappraisal based on primary and secondary sources from all the major parties involved. Rejecting the determinism of many influential studies, and discarding polemics on all sides, it founds its interpretation of the genocide in the interaction between the Ottoman empire in its decades of terminal decline, the self-interested policies of the European imperial powers, and the agenda of some Armenian nationalists in and beyond Ottoman territory. Particular attention is paid to the international context of the process of ethnic polarization that culminated in the massive destruction of 1912-23, and especially the obliteration of the Armenian community in 1915-16. The opening chapters of the book examine the relationship between the great power politics of the 'eastern question' from 1774, the narrower politics of the 'Armenian question' from the mid-nineteenth century, and the internal Ottoman questions of reforming the complex social and ethnic order under intense external pressure. Later chapters include detailed case studies of the role of Imperial Germany during the First World War (reaching conclusions markedly different to the prevailing orthodoxy of German complicity in the genocide) the wartime Entente and then the uncomfortable postwar Anglo-French axis; and American political interest in the Middle East in the interwar period which led to a policy of refusing to recognize the genocide. The book concludes by explaining the ongoing international denial of the genocide as an extension of the historical 'Armenian question' with many of the same considerations governing modern European-American-Turkish interaction as existed prior to the First World War.\n\nReviewS\n&quot;...deeply researched and well written; Bloxham is an especially engaging stylist.&quot; Norman M. Naimark, Holocaust and Genocide Studies, Vol. 21, No. 2\n\n&quot;The best discussion on the topic is now Donald Bloxham, The Great Game of Genocide : Imperialism, Nationalism, and the Destruction of the Ottoman Armenians&quot; Nicholas Doumanis, Historical Journal\n\n&quot;...a detailed &amp; sophisticated account..This first class work offers much new material and is probably the most detailed and complex account in English of these terrible events.&quot; William Rubinstein, The Times Higher\n\nAbout the Author\nDonald Bloxham is currently Lecturer in Twentieth-Century History at the University of Edinburgh. Previously he was a Leverhulme Special Research Fellow at the University of Southampton and Academic Research Director of the Holocaust Educational Trust.\n","torrent":{"xt":"urn:btih:e05c3e23bcbba66c13c54f2e914ad15d9a322aa3","amp;dn":"Donald+Bloxham+-+The+Great+Game+of+Genocide+%5B2005%5D%5BA%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e05c3e23bcbba66c13c54f2e914ad15d9a322aa3","infoHashBuffer":{"type":"Buffer","data":[224,92,62,35,188,187,166,108,19,197,79,46,145,74,209,93,154,50,42,163]},"announce":[],"urlList":[]}}