{"title":"Hodgepodge, miscellaneous, remnants. leavings (Eclipse)","uid":9001912,"size":1404361170,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:e17cfdbcba894e202810e882d8177310f5875c4e&amp;dn=Hodgepodge%2C+miscellaneous%2C+remnants.+leavings+%28Eclipse%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Ichthypod_Crane","files":45,"time":1380959091,"description":"The ECUP wakes up with a mouth full of face and a receipt for the wrong kind of Bath Salts, with Eclipse Odds and Ends!\n\nThe Eclipse Comics Upload Project begins to wind down, leaving me with bits and pieces that just don't fit anywhere else. One-offs, graphic novels, collections, trading cards(!) - that sort of thing. So I plopped them into a folder called 'Odds and Ends', and here we are. Too many items to list completely, so here's some highlights:\n\nBlandman (a parody of Sandman)\nBrought to Light - Alan Moore and Bill Sienkiewicz team up for a history of CIA shenanigans\nFloyd Farland: Citizen of the Future - early Chris Ware effort\nHembeck: The Best of Dateline - remember him?\nHouse of Usher - adapted by Richard Corben\nPigeons from Hell - Scott Hampton covers Robert E. Howard\nReal Love - Best of Simon &amp; Kirby Romance Comics 40s-50 - nuff said\nAllan W. Eckert's Tecumseh! - with beautiful Timothy Truman art\nThe Hobbit - adapted by Charles Dixon with painted David Wenzel art\nThe Price - a Metamorphosis Odyssey book by Jim Starlin\nTrue Crime Trading Cards Series 002 - Serial Killers &amp; Mass Murderers - awwwww yeah\n\nAND SO MUCH MORE!!!\n\nSeriously, there's a lot more. Like, a metric shit-tonne maybe.\n\nAs usual, I would like to elucidate my undying gratitude to the creative teams and the scanners! Gather it, give it!\n\n\n\nYour penumbral second chance for this upload is 'The Magic Flute' by P. Craig Russell! This three-volume adaptation of Mozart's opera was released in 1990 with your typical stunning Russell artwork. That wily veteran of the Torrent Wars, LeonardTSpock, RESTORED this and uploaded it a few months back, in July to be exact. Though you touch yourself FAR too often, and probably haven't called your Mom in forever, I will grant you access to it if you click below:\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/8668274/P_Craig_Russell_-_The_Magic_Flute_(Restored)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/8668274/P_Craig_Russell_-_The_Magic_Flute_(Restored)&lt;/a&gt;\n\nNow go do, that voodoo, that you do, so wellllllllllllllllll!","torrent":{"xt":"urn:btih:e17cfdbcba894e202810e882d8177310f5875c4e","amp;dn":"Hodgepodge%2C+miscellaneous%2C+remnants.+leavings+%28Eclipse%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e17cfdbcba894e202810e882d8177310f5875c4e","infoHashBuffer":{"type":"Buffer","data":[225,124,253,188,186,137,78,32,40,16,232,130,216,23,115,16,245,135,92,78]},"announce":[],"urlList":[]}}