{"title":"Steve Lehman Quintet - On Meaning (2007)","uid":5926330,"size":296162500,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e24a7cbce766f931c4b730ef44b0d655748fcc19&amp;dn=Steve+Lehman+Quintet+-+On+Meaning+%282007%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mariorg","files":-1,"time":1288609266,"description":"Pi Recordings: Pi25 &lt;a href=&quot;\nhttp://pirecordings.com/album/pi25&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://pirecordings.com/album/pi25&lt;/a&gt;\n\n* Steve Lehman: alto saxophone\n* Jonathan Finlayson: trumpet\n* Chris Dingman: vibraphone\n* Drew Gress: bass\n* Tyshawn Sorey: drums\n\nHomepage: &lt;a href=&quot;\nhttp://www.stevelehman.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.stevelehman.com/&lt;/a&gt;\n\nReview\n~~~~~ &lt;a href=&quot;\nhttp://www.allmusic.com/album/on-meaning-r1209518&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/album/on-meaning-r1209518&lt;/a&gt;\nby Thom Jurek\nSaxophonist and composer Steve Lehman is one of those new breeds of contemporary\nmusicians. As a jazzman he's played with everyone from Vijay Iyer to Dave\nBurell. He's studied with both Jackie McLean and Anthony Braxton, and recorded a\nhandful of records as a leader or co-leader; he is a Fulbright scholar and has\ntaught in Paris. His album titles -- like this one -- sound like the titles of\ndoctoral dissertations: Demian as a Posthuman, anyone? All of that said, Lehman\ncould throw down on the horn and write some exciting music for a band that makes\nit spark and fire. Chris Dingman on vibes, Drew Gress on bass, drummer Tyshawn\nSorey (who nails all kinds of breakbeats in this set), and trumpeter Jonathan\nFinlayson work with Lehman's alto in scattering post-bop notions off a wall\nfilled with tough new vanguard tricks, but which are all kept in tight rein by\nthe compositions themselves. While these tunes don't exactly sing, they can and\ndo swing, in places. In others they scatter, punch, kick, and dart here and\nthere at a moment's notice, sometimes quicker, sometimes slower. Themes like\nthat of the title track juxtapose thematic constructions and taut melodic\ninvention along several planes at once in a metonymic manner -- it's not a long,\nsingle line in linear horizontal fashion, but in linear fashion, period, using\nall the referents of what came before for what comes after. The vibes add both\ncolor and punch the rhythm section, as well as act as a melodic extension of\nthree different themes put into play by Lehman and Finlayson. &quot;Open Music,&quot;\nintroduced by some stellar snare work by Sorey and Finlayson, creates a series\nof contrapuntal lines that Gress comes in to play between as a balancing\nact. The horns don't enter for almost a minute and then scalar counterpoint in\ncall and response becomes the beginning of a linguistic exercise that actually\nspits fire, an uneasy tension and mild dissonance that leads into the frame of a\ntune that gets worked out in the spaces between the various lyric themes being\nstated. Quite impressive, and Sorey is all killer on the kit, keeping it not\nonly moving, but flowing, jumping off, coming back, and then further pushing\nFinlayson to put more and more chime on that vibe.\n\nOther tracks, such as &quot;Check This Out,&quot; have deep, furrowed knotty lines for the\nfront line to play, with a kind of opaque harmonic terrain employed by\nFinlayson. Gress takes all this in stride and he and Sorey keep it pushing,\nmaking sure this somewhat academic music doesn't get bogged down in its\nsophistication and braininess. As the improvisation makes clear here, and\nvirtually everywhere else on this fine album, the language of jazz and its\ntradition is the great equalizer. Lehman chooses to use it in the compositions\nthemselves, sure, but more than this the players are all free to use and\nreference all parts of it; they speak to one another through history, space, and\ntime as well as in the immediacy of dynamic and often frenetic communication. On\nMeaning is enjoyable on a purely physical level for the engagement of the\nplayers and the action, of which there is plenty, but the sense of sheer\nmusicality at work here is often breathtaking. Perhaps the biggest plus for the\nlistener is that while the intellectual and technical acumen here is rigorously\nhigh, the way this set comes off is immediate, live, as if the studio weren't\neven part of the proceedings.","torrent":{"xt":"urn:btih:e24a7cbce766f931c4b730ef44b0d655748fcc19","amp;dn":"Steve+Lehman+Quintet+-+On+Meaning+%282007%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e24a7cbce766f931c4b730ef44b0d655748fcc19","infoHashBuffer":{"type":"Buffer","data":[226,74,124,188,231,102,249,49,196,183,48,239,68,176,214,85,116,143,204,25]},"announce":[],"urlList":[]}}