{"title":"Aerosmith - Classics Live Complete (resequenced and expanded by","uid":9088693,"size":645158927,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:e39a80f0de9dfb38859416c086e13027446568dc&amp;dn=Aerosmith+-+Classics+Live+Complete+%28resequenced+and+expanded+by+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"}{eywood","files":29,"time":1382548761,"description":"Classics Live always seemed incomplete to me, especially as two separate albums.  Even when they compiled the two onto one CD they never did anything to make it seem like one show, even going so far as to leave the bonus studio song in between the two live albums.\n\n--A little deviation here about box sets.  I never keep box sets intact.  I always get rid of previously released material, then take the unreleased songs and add them to the ends of the albums that they were recorded with or near.  Pandora's Box was no different.  The loose live tracks there are now added to this album.  \n\nSo here is CL resequenced into an order that I felt sounded like a real Aerosmith setlist (this is all my feeling here; no actual setlists were used because this material was recorded over a ten year period across several tours), and expanded with the extra songs.  Major Barbra is also removed because it threw the whole live album thing off.\n\nThe tracklist and recording dates are as follows:\n\n01. Back In The Saddle (Orpheum Theater, Boston, MA 12/31/84)\n02. Draw The Line (Orpheum Theater, Boston, MA 12/31/84)\n03. Same Old Song And Dance (Orpheum Theater, Boston, MA 12/31/84)\n04. Last Child (Orpheum Theater, Boston, MA 12/31/84)\n05. Kings And Queens (Boston Music Hall, Boston, MA 3/28/78)\n06. Sweet Emotion\n07. Adam's Apple (Indianapolis, IN 7/4/77)\n08. Three Mile Smile (Orpheum Theater, Boston, MA, 2/14/84)\n09. Reefer Headed Woman (Orpheum Theater, Boston, MA, 2/14/84)\n10. Lord Of The Thighs (Orpheum Theater, Boston, MA, 2/14/84)\n11. I Wanna Know Why (Texxas Jam, Cottonbowl, Dallas, TX 7/4/78)\n12. Big 10 Inch Record (Texxas Jam, Cottonbowl, Dallas, TX 7/4/78)\n13. Mama Kin (Orpheum Theater, Boston, MA, 2/14/84)\n14. Walk This Way (Orpheum Theater, Boston, MA 12/31/84)\n15. Movin' Out (Orpheum Theater, Boston, MA 12/31/84)\n16. Write Me A Letter\n17. Dream On (Capital Center, Largo, MD 11/9/78)\n18. Train Kept a' Rollin' (Orpheum Theater, Boston, MA, 2/14/84)\n19. Let The Music Do The Talking (Centrum, Worcester, MA 3/12/86)\n20. Toys In The Attic (Orpheum Theater, Boston, MA 12/31/84)","torrent":{"xt":"urn:btih:e39a80f0de9dfb38859416c086e13027446568dc","amp;dn":"Aerosmith+-+Classics+Live+Complete+%28resequenced+and+expanded+by+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e39a80f0de9dfb38859416c086e13027446568dc","infoHashBuffer":{"type":"Buffer","data":[227,154,128,240,222,157,251,56,133,148,22,192,134,225,48,39,68,101,104,220]},"announce":[],"urlList":[]}}