{"title":"Charlie Parker - Jam Session 1952 Rem. 1990 TQMP [FLAC]","uid":4737725,"size":230233344,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e4e51722ad3401678d39d69a4a8a8400e38f4e65&amp;dn=Charlie+Parker+-+Jam+Session+1952+Rem.+1990+TQMP+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Breezin","files":11,"time":1235389729,"description":"Quotes from amazon: (avg. 5 star rating :)\n\n&quot;If you play the saxophone, THIS IS A MUST HAVE ALBUM! If you like the saxophone this is a really, really should have album. Norman Granz produced many of his JATP (Jazz at the Philharmonic) titles featuring top names. This recording is akin to those. Johnny Hodge's solo on Funky Blues is featured above in the recording and it is so great! I can't believe that the listing on this CD doesn't talk about having Parker, Hodges, Carter, Ben Webster, Flip Phillips, Charlie Shavers and an All-Star rhythm section. BTW, there are really only FOUR (4) tracks on this CD. One of them is a medley of the ballads, each player being featured on a tune.&quot;\n\n&quot;This album comes as a pleasant surprise on several levels. I thought my collection of Charlie Parker recordings was as complete as it needed to be--most of the Dial and Savoy masters and alternate takes, lots of air shots, the fabled solos on &quot;Embraceable You&quot; and &quot;Night in Tunisia,&quot; and of course the historic Massey Hall concert, later billed as the &quot;World's Greatest Jazz Concert.&quot; But as impressive as all those recordings are, they distance the listener in ways that may fuel the cult aura surrounding Bird and contribute to his legendary status but hardly atone for my inability to see and hear him performing live. The truncated solos of the 78 rpm recordings, the very &quot;lo fi&quot; audio, the predictable bebop repertory all served to provoke and tantalize as much as satisfy curiosity about his genius.\n&quot;Jam Session&quot; is the only album I've heard that presents Charlie Parker in familiar company with room to stretch out and with microphones capable of capturing the moment with the versimilitude expected by today's listeners. Supported by Oscar Peterson and Ray Brown and sharing solo space with 4 progenitors of the saxophone, all of whom would ironically outlive him, Bird sounds both relaxed and in control, a musician who doesn't need to prove anything to anybody, but just playing for the fun of it. It's a rare, humanizing glimpse of a legend who proves no less mortal than his bandmates.&quot; \n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project me and my fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at:  &lt;a href=&quot;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&lt;/a&gt;\n\nPlease feel free to join the TQMP project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n\nYou can find all TQMP uploads at: www.thepiratebay.se (Simply use the TQMP searchtag :)\n\nContact: &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;9efcecfbfbe4f7f0def2f7e8fbb0f0f2&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n\nGreetings to ya'all from the Breezin Dutchman! d:)","torrent":{"xt":"urn:btih:e4e51722ad3401678d39d69a4a8a8400e38f4e65","amp;dn":"Charlie+Parker+-+Jam+Session+1952+Rem.+1990+TQMP+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4e51722ad3401678d39d69a4a8a8400e38f4e65","infoHashBuffer":{"type":"Buffer","data":[228,229,23,34,173,52,1,103,141,57,214,154,74,138,132,0,227,143,78,101]},"announce":[],"urlList":[]}}