{"title":"Droid 2: The Missing Manual (2011)","uid":6540732,"size":13730250,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e508168766e429d8f01f4a3d5fab4edd91199938&amp;dn=Droid+2%3A+The+Missing+Manual+%282011%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"theLEAK","files":-1,"time":1310676866,"description":"The Missing Manual. The book that should have been in the box from Preston Gralla. He is the author of more than 30 books, including Internet Annoyances, PC Pest Control, and Windows XP Hacks, Second Edition, and co-author of Windows XP Cookbook. As an award-winning author and technology expert, Preston has written articles for major national newspapers and magazines and has also appeared on several TV and radio programs.\n\nReady to unleash the Droid 2? This entertaining guide helps you take full command of Motorolas sleek new device to get online, shop, find locations, keep in touch, and much more. Every page is packed with useful information you can put to work right away, from setup to troubleshooting, with lots of valuable tips and tricks along the way.\n\nFeatures:\n\n+ Get organized. Sync your contacts, calendar, and email with your Google Calendar and Outlook accounts.\n+ Go online. Make your phone a portable hotspot or a modem to get your laptop online.\n+ Be productive. Use Google docs to create and edit documents, spreadsheets, and presentations.\n+ Play music. Purchase music from Amazon and sync your Droid 2 with Windows Media Player.\n+ Capture photos and video. Edit your photos and share everything you shoot-instantly.","torrent":{"xt":"urn:btih:e508168766e429d8f01f4a3d5fab4edd91199938","amp;dn":"Droid+2%3A+The+Missing+Manual+%282011%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e508168766e429d8f01f4a3d5fab4edd91199938","infoHashBuffer":{"type":"Buffer","data":[229,8,22,135,102,228,41,216,240,31,74,61,95,171,78,221,145,25,153,56]},"announce":[],"urlList":[]}}