{"title":"Pilger-Hidden Agendas(Burma,Vietnam,Australia,South Africa,Indon","uid":4567738,"size":2439972,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e524c57a88c4e89ae1c83050d44666b4e1bc602c&amp;dn=Pilger-Hidden+Agendas%28Burma%2CVietnam%2CAustralia%2CSouth+Africa%2CIndon&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"red_gonzo","files":1,"time":1228937737,"description":"This is John Pilger&amp;#039;s monumental book Hidden Agendas (1998) which strips away the layers of deception, dissembling language and omission that prevent us from understanding how the world really works and what sinister agendas lie behind world events. From the invisible corners of Tony Blair&amp;#039;s New Britain to Burma, Vietnam, Australia, South Africa and the illusions of the &amp;#039;media age&amp;#039; - power has its own agenda. Unchallenged, it operates to protect its interests with a cynical disregard for people - shaping, and often devastating, millions of lives. This hefty collection of dispatches and essays concerns the so called &quot;slow news&quot;. In author&amp;#039;s words, &quot;slow news&quot; consists of stories that unfold in the shadows of fast-breaking, world-shaking events, but fail to register in a mass media dominated by infotainment stories. John Pilger is one of those few writers and public figures who have the tenacity, courage and intelligence to see the world beyond the comfort zone of CNN and dare to expose events and people that other journalists will simply not touch. The readers will be taken around the world and in each of the countries he visits he calmly and rationally exposes the self serving hypocracy of power. Pilger looks again for the truth behind Orwellian officialdom in Great Britain, the US, South Africa, Indonesia, and, most notably, Burma. This nation, very rich in natural resources, descended into unbelievable poverty under the dictatorship of the crazed New Win, 1962-88, and has since been taken over by a much worse regime of military gangsters who have plundered the country with the cooperation of transnational corporations. An railroad and an oil pipeline is being built there with slave labor (even with child labor) but the resolute dissident democratically elected president Aung San Suu Kyi still hangs on. Pilger makes a clear and disturbing case that US management of the media in the Gulf War covered up one-quarter of a million deaths, most of them civilian. He strikes home the most convincingly when he takes on British arms merchants, and he does so by sticking to numbers and actual quotations from officials. He attacks the British media, from the BBC to Rupert Murdoch, whose headquarters at Wapping in England, he calls &quot;a cultural Chernobyl&quot;. His accounts of the newly democratized South Africa and Vietnam&amp;#039;s deprivations under World Bank-imposed strictures remind us that globalization does not lift all boats. In Vietnam, after years of barbaric American bombing and embargo because of its opposition to their friends Pol Pot and Deng Xiaoping in the 80&amp;#039;s, the neoliberal program in place since 1986 has risen the number of people in absolute poverty to seventy percent, along with sharp rises in child malnutrion and the other usual maladies of globalization. Pilger interviews Vietnamese who are still strong even as conditions become worse in their country, such as doctors at hospitals who are suffering severe shortages, as a result of the cutting off of government funding and the astronomical expenses required to import the equipment from foreign corporations, to treat the most basic diseases and injuries. He also interviews a couple of foreign tycoons who have rushed in to take advantage of the very cheap and repressed workforce who labor under some of the worst conditions in the world. Finally Pilger ends in South Africa, where the end of political apartheid in fact has brought the extension of economic apartheid with the black population sinking into even greater poverty on their bantustans, denied most of the basic social services the Mandela government had promised them in 1994. By unravelling the hidden histories of contemporary events, Pilger allows us to read between the lines of world events. He also celebrates the eloquent defiance and courage of those who resist oppression and give us hope for the future. Tenaciously researched and written with passion and wit, Hidden Agendas will definetly change the way you see the world. 650 pages, some pictures. A must read for everyone.\n","torrent":{"xt":"urn:btih:e524c57a88c4e89ae1c83050d44666b4e1bc602c","amp;dn":"Pilger-Hidden+Agendas%28Burma%2CVietnam%2CAustralia%2CSouth+Africa%2CIndon","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e524c57a88c4e89ae1c83050d44666b4e1bc602c","infoHashBuffer":{"type":"Buffer","data":[229,36,197,122,136,196,232,154,225,200,48,80,212,70,102,180,225,188,96,44]},"announce":[],"urlList":[]}}