{"title":"Gothic 3 With all updates to Enhanced Edition","uid":5148346,"size":4581491691,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e63077d2b0156b90e81e10ab47d47350bd2d8842&amp;dn=Gothic+3+With+all+updates+to+Enhanced+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"RageWarrior666","files":-1,"time":1257406568,"description":"First and Foremost this as a copy of my own leagl Gothic 3 Disc, so be thankful, and \nsecondly all the updates are from worldofgothic.com, I do not claim ownership because\nI didn't make them, I just downloaded them and put them all in one folder.\n\nNow that that's out of the way, asuming you already have or at least know where to get\na virtual drive emulator, here are the instructions.\n\n\n\n1.Mount the Gothic III.iso file, not the .dvd file using virtual drive emulator such as,\ndaemon tools or magicdisc, if autorun dosen't come up just open the disc via my computer, \nand launch the setup.exe, and install it to wherever you want (default is C:/program files).\nafter it completes it will try to install Microsoft Visual c++ 2005 Redistributable, if you\nhave vista or windows 7 it might say it failed to install driver because it's outdated, \njust click ignore, it will then ask if you want to install directX, odds are you already \nhave a better version so click no. When prompted make sure to deselect &quot;check internet for \nupdates&quot; (because I've invluded them), and click finished, if the autorun pops up again \njust click quit.\n\n2.Unmount the Gothic III.iso\n\n3.Go to the update folder I provided, I Renamed the patches with numeral order so just run \nthem in order from 1-5. In case you don't know what I mean, run them in this order:\n\n1-Gothic3_RelUp_EUR\n2-Gothic3_patch108\n3-Gothic3_patch109\n4-Gothic3_patch112\n5-Gothic_3_Community_Patch_v1.73_Int_Full\n\n(the fith one is the doosy, it has all the community patches from worldofgothic.com in one, \nbut it is the best one bringing it up to Enhanced Edition, For full info check out \nworldofgothic.com or find out by playing)\n\n4.Play game and enjoy, no crack required, keep in mind if the game runs slow, it's not an\ninstallation problem, gothic 3 needs tremendous ram, and even if you meet the specs it's a \nhuge game and you'll probably have to tweak the settings, I'll write some reccomended \nsettings below, they might reduce the graphic quality a bit but the game shaould run much\nbetter. please also note that if you find graphic errors, this is a perfectly clean \ninstallation, so try my reccomended settings below, but if you have errors still, it could\nbe a hardware issue, the gothic franchise are not known for auomatic compatability, you\nmight have to do a bit of tweaking to get it to work as I said, and if my settings don't\nwork for you, there are plenty of forums and guides on the internet that will be more \nhelpful than me. These are known issues, but anyway hopefully that won't be a problem, and \nenjoy the game. \n\n\nReccomended dettings:\n\nClick Options:\n\nDetails:\n\nDistance(High detail): Low\nDistance(Low detail): off\nResource cache: Medium\nObject detail:Medium\nShader quality: 1.4 (depending on what your graphic card supports, 1.4 is lowest so should\nbe supported by any graphic card)\nTexture quality: Medium\nTexture Filtering: Anisotropic\nVegitation Quality: Off\nVegitation View Range: Low\nShadow quality: Off\nLens flare: Off\nDepth of field: Off\nRim lighting: Off\nAnti-Aliasing: Off\nSoft Water/ Particles: Off\n\n(notice I have all of the extra features set to off and low, the game still looks great,\njust not as pretty as it's full potential, but the game runs much better, after that it's\nup to your computer)\n\nVideo: Leave as is, just make sure the Resolution is set to the same as your regular screen\nresolution. \n\nAudio: Set volume controls to your preference, I reccomend subtitles as they are very \nhelpful during gameplay, and speakers should be set according to your setup, leave default\nunless you have surround sound or something like that and set accordingly.\n\nControls: Leave default for now and configure as needed\n\nDifficulty: your preference, Easy is of course the basic setting, Medium increases enemy\nhit points, damage, and battle intellegence to higher levels, Hard does the same as medium\nbut to even higher levels (hardcore gamers ONLY). \n\nAlternative A.I.: Is something I strongly reccomend as it fixes MANY problems with the A.I.\nof followers (So they don't get stuck on edges or fall of cliffs as often). And it fixes\nthe target locking problems (target locking is when beasts such as wolves, etc. would \nattack you repeatedly making any action impossible, I remember one time i defeated a whole \nvillage of orcs, then got killed by one wolf because of target locking I was unable to \nattack. Anyway Alternative A.I. fixes that, cheers). It also makes enemys more intellegent \nproviding an even balance.\n\nAlternative Blending:\n\nWhat alternative blending does is somehow (not sure exactly) alter the way you level up\nand learn skills, originally your character could master everything and become nearly\ngodlike, but with alternative blending on you become more selective, and\nspecialize in areas, such as Hunting Skills to pick off enemies before they reach you.\nOr One-handed and or Two-handed weapon mastery for high powered close combat, possibly \nusing a shield in junction with One-handed weapons, or later mastering Duel-Weilding.\nOr of course there are magic class skills as well, Innos (fire and holy spells), Adanos\n(Water and Nature Spells), Beliar (Pretty much all dark magic).\n\nSo Whether you wannabe a Master Hunter killing enemies from afar, A Hardened Fighter \nSlahsing through foes with whirling blades, or a brooding mage bending the fabrics of \nwill and arcane, it's up to you.\n\nOr if you'd rather gradually become a master at everything, then leave off alternative\nblending.\n\nNote that once you start a game with or without alternative blending, it's set, you can't \nchange it, you'll have to start a new game in order to change it. But don't worry it won't \ndelete your old game if you start a new one. You'll just have a different set of saved \ngames.\n\n__________________________________________________________________________________________\n\n\nAs long as you followed these instructions it should be installed perfectly, so please \ndon't leave neagative comments asking for further instructions or help, because I already\ngave you all the info I have, so look for forums or guides if you have any problems.\n\n-RageWarrior666\n \n","torrent":{"xt":"urn:btih:e63077d2b0156b90e81e10ab47d47350bd2d8842","amp;dn":"Gothic+3+With+all+updates+to+Enhanced+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e63077d2b0156b90e81e10ab47d47350bd2d8842","infoHashBuffer":{"type":"Buffer","data":[230,48,119,210,176,21,107,144,232,30,16,171,71,212,115,80,189,45,136,66]},"announce":[],"urlList":[]}}