{"title":"Lee Strobel  - The Case For Faith(Christian movie)","uid":5436343,"size":772968004,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e6b0343486fa5087e2984a868c6f4e23fceb644c&amp;dn=Lee+Strobel++-+The+Case+For+Faith%28Christian+movie%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ab3br","files":1,"time":1268764245,"description":"A journalist investigates the toughest objections to Christianity...\n\nDespite the compelling historical evidence, many people grapple with serious concerns about faith in God.\nIn The Case For Faith, journalist Lee Strobel investigates two of the most emotional objections to Christianity. Barriers to faith confronted by believers and skeptics alike: Why is Jesus the only way to God? And how could a loving God exist if there is evil and suffering in the world?\n\nIn The Case for Faith, the second in a series of three DVDs based on Lee Strobel's books, Strobel turns his tenacious investigative skills to the most persistent emotional objections to belief - the eight &quot;heart&quot; barriers to faith. The Case for Faith, based on Lee Strobel's Gold Medallion-winning book, is for those who may be feeling attracted to Jesus but who are faced with intellectual barriers standing squarely in their path.  For Christians, it will deepen their convections and give them fresh confidence in discussing Christianity with their most skeptical friends.\n\nThis film includes interviews with scholars, theologians, and ministry leaders including Joni Eareckson Tada, N.T. Wright, Ben Witherington, Greg Koukl, and Rick Warren. Each reaches beyond intellectual arguments to touch the depths of the human heart.\nThe Case For Faith is a powerful Biblical apologetic for anyone who has ever experienced doubt or uncertainty about God. It is an honest message of hope and spiritual clarity in a world where faith is tested on a daily basis.\n &lt;a href=&quot;\nhttp://www.christiancinema.com/catalog/product_info.php?products_id=2420&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.christiancinema.com/catalog/product_info.php?products_id=2420&lt;/a&gt;\n\nUploaded by Abraham \n","torrent":{"xt":"urn:btih:e6b0343486fa5087e2984a868c6f4e23fceb644c","amp;dn":"Lee+Strobel++-+The+Case+For+Faith%28Christian+movie%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e6b0343486fa5087e2984a868c6f4e23fceb644c","infoHashBuffer":{"type":"Buffer","data":[230,176,52,52,134,250,80,135,226,152,74,134,140,111,78,35,252,235,100,76]},"announce":[],"urlList":[]}}