{"title":"HISTORY OF POP AND ROCK MUSIC - part 532","uid":9175222,"size":918555359,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:e71b523acd20fdef68efe1fcead2a7041afc6569&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+532&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zlatkopupovac","files":-1,"time":1384137205,"description":" \n\n                      PART  532\n\n\n\n          MUNGO JERRY  -  Mighty Man  (1970)\n          MUNGO JERRY  -  Lady Rose   (1971)\n          MUNGO JERRY  -  Baby Jump  (1973) - Ragnarock Festival\n          MUNGO JERRY  -  Alright, Alright, Alright  (1973) - Ragnarock Festival\n          MUNGO JERRY  -  Open Up  (1973) - Ragnarock Festival\n\n\n\n\n          Mungo Jerry is a British rock group whose greatest success was in the early 1970s, though they have continued throughout the years with an ever-changing line-up, always fronted by Ray Dorset. Their name was inspired by the poem &quot;Mungojerrie and Rumpelteazer&quot;, from T. S. Eliot's Old Possum's Book of Practical Cats. Mungo Jerry came to prominence in 1970 after their performance at the Hollywood Festival at Newcastle-under-Lyme, Staffordshire on 23 May, which was their first gig under this name. Their first single, &quot;In The Summertime&quot;, the first maxi-single in the world, released on 22 May, entered the UK charts at No. 13 and the following week went straight to No.1.Mungo Jerry made their first trip to the United States in September 1970. On their return Mike Cole was fired and replaced by John Godfrey, who played bass on their second UK maxi-single, &quot;Baby Jump&quot;, which also topped the UK chart in March 1971. The third UK single, another maxi, &quot;Lady Rose&quot;, also in 1971, was also set to become another UK No. 1. Mungo Jerry's hits continued through to 1976 with &quot;Open Up&quot; (Top Twenty in Europe); &quot;Alright Alright Alright&quot; (a rewrite of an old French hit for Jacques Dutronc, and again a major hit worldwide reaching the Top 3 in the UK); &quot;Wild Love&quot;; &quot;Long Legged Woman Dressed in Black&quot;; &quot;Hello Nadine&quot; (European hit and Top Five in Canada); and &quot;It's a Secret&quot; (European hit). You Don't Have to Be in the Army to Fight in the War&quot; gave Mungo Jerry another hit.\n          &quot;Baby Jump&quot; is a popular song by Mungo Jerry.  Written by the group's lead vocalist and guitarist Ray Dorset and produced by Barry Murray, it was the band's second UK No. 1 single, reaching the top for two weeks in March 1971. The song originally entered at #32 and dropped out of the chart due to lack of sales data because of a national postal strike, but re-entered two weeks later at #14. Like the group's debut single, &quot;In the Summertime,&quot; it was a maxi-single playing at 33 rpm.\n          &quot;Lady Rose&quot; is a popular song and hit single by Mungo Jerry. Written by the group's lead vocalist Ray Dorset and produced by Barry Murray, it was the band's third single. The song entered the UK charts at #30 in May 1971 and reached #5 in June finally leaving the chart in August 1971. Like the group's debut single, ","torrent":{"xt":"urn:btih:e71b523acd20fdef68efe1fcead2a7041afc6569","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+532","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e71b523acd20fdef68efe1fcead2a7041afc6569","infoHashBuffer":{"type":"Buffer","data":[231,27,82,58,205,32,253,239,104,239,225,252,234,210,167,4,26,252,101,105]},"announce":[],"urlList":[]}}