{"title":"Waiting for You by Shey Stahl (Waiting for You #1)","uid":8871613,"size":674171,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e8a5d5f59fd3def02e346a7cacb9261763586b02&amp;dn=Waiting+for+You+by+Shey+Stahl+%28Waiting+for+You+%231%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"420weedman","files":1,"time":1378079390,"description":"Bailey Gray is tired of her perfectly planned life. Everything about her life has been organized and lived out to the expectations set of her parents. She is the class valedictorian, has perfect grades, the perfect friends, a perfect boyfriend, basically perfect life...or so everyone thought. That's when she realizes the path planned isn't always the path chosen. \n\nOn graduation day she makes a decision. One that changes everything she thought she knew about her intended future.\n\nOn a whim, she runs away with the town rebel, Dylan Wade, in search of the unknown.\n\nDylan Wade isn't looking to run away from anything.\n\nHe knows what he wants as he's been waiting on it for years.\n\nOn a journey to find the unknown, they discover a friendship they once knew along the open highway and have not a care in the world. Between the yellow and white lines of the heated summer asphalt, a spark draws them together as Dylan's past and Bailey future try to ripe them apart.\n\nCould it be that Dylan and his GTO are exactly what her perfectly planned life needs?\nGenre: Romance","torrent":{"xt":"urn:btih:e8a5d5f59fd3def02e346a7cacb9261763586b02","amp;dn":"Waiting+for+You+by+Shey+Stahl+%28Waiting+for+You+%231%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8a5d5f59fd3def02e346a7cacb9261763586b02","infoHashBuffer":{"type":"Buffer","data":[232,165,213,245,159,211,222,240,46,52,106,124,172,185,38,23,99,88,107,2]},"announce":[],"urlList":[]}}