{"title":"Metal Guitar, With Alexi Laiho of Children of Bodom Level 1,2","uid":4850871,"size":5996778354,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:e9bbaffa4206ba8ceb3f68a7f4bac166e76e74bd&amp;dn=Metal+Guitar%2C+With+Alexi+Laiho+of+Children+of+Bodom+Level+1%2C2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"djkevincr","files":47,"time":1239867852,"description":"A true virtuoso, Alexi Laiho from Children of Bodom is known for his incredible six string momentum and melodic speed. In Level 1 he will challenge you to expand your mind and you own guitar mastery. Learn Single note heavy riffs used to create songs and his favorite scales used to create melodic and shredding leads. He shares with you his personal tricks for speed picking, pick harmonics and right hand tapping! Alexi will teach you chord voicings he uses to create powerful guitar progressions and a whole lot more. The powerful backing tracks included put you at the center of your own metal band! This program is not for the faint of heart!\n\n\nAlexi Laiho is a highly acclaimed guitarist and front man of metal band Children of Bodom. He has emerged as modern guitar hero whose virtuosity is inspiring a new a generation of guitarist who want to excel at playing. In Level 2 Alexi encourages you to find the balance between technique and attitude. He walks you through many of his leads in their entirety and teaches you his mastery of sweep picking and some of the most advanced arpeggios every written. Learn to create two part harmony guitar sections, play syncopated rhythms and more in the master class with the man who inspiring a new generation of players.\n\nJust a heads up for those with limited bandwidth who want this: the videos are also on the dvd in .m4v format in the files called Level 1AL-21.cab &amp; Level 2AL-11.cab, which total only 429mb. Set your client to download just those files, then right click on them and choose 'extract'.\n\nAlso, there are no tabs included in a seperate file, but they do show them on the screen when they play the backing track.\n\nANYONE WHO HAS METAL METHOD METAL RIFFOLOGY PLEASE SHARE WITH ME","torrent":{"xt":"urn:btih:e9bbaffa4206ba8ceb3f68a7f4bac166e76e74bd","amp;dn":"Metal+Guitar%2C+With+Alexi+Laiho+of+Children+of+Bodom+Level+1%2C2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9bbaffa4206ba8ceb3f68a7f4bac166e76e74bd","infoHashBuffer":{"type":"Buffer","data":[233,187,175,250,66,6,186,140,235,63,104,167,244,186,193,102,231,110,116,189]},"announce":[],"urlList":[]}}