{"title":"Cardinal - Cardinal [1994] [FLAC]","uid":8108213,"size":176675047,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e9e8dcdb495e0f35b16bcff5530626ea568018a6&amp;dn=Cardinal+-+Cardinal+%5B1994%5D+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":12,"time":1360124180,"description":"MOJO Magazine: Buried Treasure &quot;Album That Time Forgot.&quot;\n\n\nArtist: Cardinal\nRelease: Cardinal\nDiscogs: 1485778\nReleased: 1994-10-11\nLabel: Flydaddy Records\nCatalog#: FLY004\nFormat: FLAC / Lossless / Log (100%) / Cue / CD\nCountry: US\nStyle: Pop, Rock, Alternative Rock\n\nTracklisting:\n\n01. If You Believe In Christmas Trees\n02. Last Poems\n03. Big Mink\n04. You've Lost Me There\n05. Public Melody #1\n06. Dream Figure\n07. Tough Guy Tactics\n08. Angel Darling\n09. Singing To The Sunshine\n10. Silver Machines\n\nThe sole album from the Richard Davies/Eric Matthews pairing achieved something close to legend status in a few short years, at least among those taken by the fusion of guitar pop with orchestrations. Although the combination isn't that groundbreaking to begin with -- everyone from the Left Banke to Burt Bacharach had already tried something similar 30 years previous, for a start -- Cardinal is still definitely enjoyable while not, in fact, being greater than the sum of its parts. \n\nWhile Matthews is a brilliant arranger, playing everything from harpsichord to trumpet and marimba, it's Davies' songs that carry the day, which a cursory review of Matthews' solo work versus Davies' makes clear. Regardless, together the two did achieve unexpectedly sharp heights. \n\nThe recruited backing band, including, of all people, drummer/co-producer Thee Slayer Hippy from Portland punk legends Poison Idea, keeps everything moving well enough, while the two chief figures happily eschew the prevailing grunge fallout of 1994 for something else entirely. Davies' quietly impassioned, slightly dry singing avoids both whispery vagueness and trying to sweat too much, perfectly matched by Matthews' fun, killer interpretations. \n\nMatthews gets moments of slightly lugubrious and breathy lead singing at points, most notably on his own solo composition &quot;Dream Figure,&quot; while the duet with Davies on &quot;You're Lost Me There&quot; is enjoyably low-key and mysterious. While Davies' lyrics are generally clever enough, they're also easy to avoid concentrating on in favor of the experience as a whole. \n\nFull-on cult appeal arrives in the form of &quot;Singing to the Sunshine,&quot; a cut from the self-titled album by the late-'60s group Mortimer. Other strong numbers include the clever time signature shifts throughout &quot;Tough Guy Tactics&quot; and the closing drama of &quot;Silver Machines.&quot;\n &lt;a href=&quot;\nhttp://dickthespic.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/&lt;/a&gt;","torrent":{"xt":"urn:btih:e9e8dcdb495e0f35b16bcff5530626ea568018a6","amp;dn":"Cardinal+-+Cardinal+%5B1994%5D+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9e8dcdb495e0f35b16bcff5530626ea568018a6","infoHashBuffer":{"type":"Buffer","data":[233,232,220,219,73,94,15,53,177,107,207,245,83,6,38,234,86,128,24,166]},"announce":[],"urlList":[]}}