{"title":"The Pumps &amp; Orphan - The Very Best Of [2006][320 KBPS]","uid":11144382,"size":137052983,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ea823ba35193b10eda5cab416df8dd8768c75a83&amp;dn=The+Pumps+%26amp%3B+Orphan+-+The+Very+Best+Of+%5B2006%5D%5B320+KBPS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LameDuck69","files":17,"time":1412223461,"description":"The Pumps &amp; Orphan - It's A Miracle They're Still Alive: The Very Best Of [2006]\n\n\n\n\n01. Coffee With The Queen  \n02. Lonely At Night  \n03. Rockstar  \n04. What Kinda Love Is This  \n05. Out Of Control  \n06. Miracle  \n07. Bust The TV  \n08. Open Up The Skies  \n09. Let Me Love You  \n10. Success  \n11. Think It Over  \n12. Irish Song  \n13. Saved By The Bell  \n14. The Pumps Are Back  \n\n\n\n\n\n320 KBPS [CBR]\n\nCover Art\n\n\n\n\n\n\nFrom Web:\n\n\n\nTaking their name from a random pick in a Winnepeg phone book, the Pumps formed in early 1978 and centered around friends Chris Burke-Gaffney on vocals and bass, lead guitarist Lou Petrovich and drummer Terry Norman Taylor.  Within a few months, Brent Diamond joined on keyboards.  The four of them, sans Pertrovich, actually had roots going back to high school, when they played with future Harlequin guitarist Glen Willows in &quot;Max Damien&quot;.\n\nPlaying in front of whatever local audience they could find, they quickly developed a following because of their live shows, full of energy and superb musicianship that seldom, if ever, had people leave unsatisfied.  Before long they were doing shows on the western Canadian &quot;B&quot; circuit.  All the while they were writing their own music, incorporating the songs into the live shows.\n\nFrank Welpert became the bands manager, who subsequently turned his friend Bob Ansell onto them.  Ansell was the national promotions manager for Polygram, and signed the band to an international recording deal in 1979, then whisked them off to Le Studio in Morin Heights, Quebec, for four months of recording sessions.\n\nWith famed British producers Phil Chapman and Jon Astley behind the board, &quot;Gotta Move&quot; was in the stores by March, 1980.  Over the next six months, 3 singles found their way to FM radio playlists across the country,&quot;Success&quot;, 'Bust The T.V.&quot; (a shot at mindless programs, many of which were considered pop culture icons like &quot;Charlie's Angels&quot; &amp; &quot;Dukes Of Hazard&quot;), and the Beatlesque &quot;Coffee With The Queen&quot;.  The album blossomed with some of the freshest sound of the time.  But for the most part hard and heavy power pop riffs weren't chart friendly, especially stateside (U.S.), and none made a particularly huge impression.\n\nStill, the live shows became legendary, as they continued to win over fans across the country and in various belts in the U.S. opening for the likes of Styx, Streetheart, Prism, Triumph and AC/DC for the next year and a half.\n\nBut problems with Polygram shelved a second album, and the band was eventually cut from the label's roster.  Petrovich left the group, and the remaining members found a new guitarist and resurfaced as &quot;Orphan&quot; releasing a pair of albums through 1983-1985 to minimal chart success.  Following the band's demise, Burke-Gaffney then dabled in other projects for a few years, including writing/producing/managing for &quot;Chantal Kreviazuk&quot; and &quot;McMaster and James&quot;, and opening CBG Entertainment. In the early 90's he teamed up with old Pumps drummer Terry Taylor for the short-lived group &quot;The Dead Beat Honeymooners&quot;, and their one album in 1992.\n\nIn the late 90's, The Pumps reformed to play a benefit show at The Convention Center in Winnipeg to an overwhelminly positive response.  It wasn't long before the second Orphan lineup (Burke-Gaffney, Diamond, Taylor &amp; McGovern) decided to make a permanent part-time gig out of playing together billed as &quot;The Pumps &amp; Orphan&quot;.  The best of those two groups made it to a Vatikan Records compilation disc in 2006 called &quot;It's A Miracle They're Still ALive&quot; with the new tracks &quot;The Pumps Are Back&quot;, &quot;Let Me Love You&quot; and &quot;Rock Star&quot;.","torrent":{"xt":"urn:btih:ea823ba35193b10eda5cab416df8dd8768c75a83","amp;dn":"The+Pumps+%26amp%3B+Orphan+-+The+Very+Best+Of+%5B2006%5D%5B320+KBPS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea823ba35193b10eda5cab416df8dd8768c75a83","infoHashBuffer":{"type":"Buffer","data":[234,130,59,163,81,147,177,14,218,92,171,65,109,248,221,135,104,199,90,131]},"announce":[],"urlList":[]}}