{"title":"JulesJordan - Chloe Amour (Chloe Amour Is Ready For The Biggest","uid":15206334,"size":387138936,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:eb7b7b6ea4bc28dfbd5e220ad95505a37008bf47&amp;dn=JulesJordan+-+Chloe+Amour+%28Chloe+Amour+Is+Ready+For+The+Biggest+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xxxlavalxxx","files":2,"time":1467627792,"description":"Welcome Chloe Amour to JulesJordan! There's a proper way to make a hot, tight girl like Chloe feel at home and MANDINGO is happy to usher her into the field here. Lucky fuckers, watch this bikini babe show that hard body off. Shot in 4K and in stunning light, her beauty is unreal. There's not a flaw on her and if you can improve on perfection, it's by showcasing some major talent in the cock-sucking department. It's not easy to take the BIGGEST COCK ON THE PLANET but Chloe manages to fit a good amount of that BBC inside her pouty mouth and down her slippery throat. She works that pole slimed up and doesn't miss an inch, including sucking those balls with such vigor and excitement, you'll feel it. She's so wet while sucking cock that his gigantic dick eases inside for her to take. She's filled up in no time with the cock that's almost as big as she is. Mandingo delivers a swift pounding, with Chloe covered in her own spit and juices, letting her suck her own taste off and re-entering her wet, tight hole. She rides this massive black stallion too, taking as much of his fat, black cock as she physically can. She looks just as beautiful taking a fat load as she does in the beginning tease - give a fat, sticky welcome to Chloe Amour!\r\nCategories: Big Cocks, Black, Blondes, Deep Throat, Facial, Interracial, Natural, Tattoo\r\n \nhttp://imgdone.com/viewer.php?file=99316758452855901059.jpg\r\n \nhttp://imgdone.com/viewer.php?file=09578822073414184992.jpg","torrent":{"xt":"urn:btih:eb7b7b6ea4bc28dfbd5e220ad95505a37008bf47","amp;dn":"JulesJordan+-+Chloe+Amour+%28Chloe+Amour+Is+Ready+For+The+Biggest+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb7b7b6ea4bc28dfbd5e220ad95505a37008bf47","infoHashBuffer":{"type":"Buffer","data":[235,123,123,110,164,188,40,223,189,94,34,10,217,85,5,163,112,8,191,71]},"announce":[],"urlList":[]}}