{"title":"Living Scriptures - Extra Episodes","uid":7064249,"size":480413858,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ec2e7a83b91a519aa73d04b1103ead4ebc9945cb&amp;dn=Living+Scriptures+-+Extra+Episodes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"suckshuncup","files":2,"time":1330459131,"description":"This torrent contains two Living Scripture animations: \nThe Savior in America\nand\nTo The Promised Land\n\nThe other excellent Living Scriptures Collection torrent here on TPB has many other animations:  &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/4149007/LIVING_SCRIPTURES_COLLECTION&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/4149007/LIVING_SCRIPTURES_COLLECTION&lt;/a&gt;\n\nHowever, in this collection, \\&quot;The Savior in America\\&quot; file is corrupt and cannot play beyond a few minutes -- therefore, I\\'ve decided to create an avi of that episode from my personal Living Scriptures DVD collection, and one other episode missing from that collection.  I\\'m thankful that the world may have free access to this important material for teaching children gospel truths.  \n\n\nThe Book of Mormon is true.  Both the Bible and the Book of Mormon are scripture written by inspired prophets of Almighty God.  The Book of Mormon is a miraculous spiritual history of Christian societies on the American continent, recorded by humble, righteous men who lived and experienced the events.  It spans 1000 years of ancient history of the American continent and testifies of Christ\\'s reality and divinity more powerfully than anything in the Bible, with the possible exception of the Gospels of Matthew, Mark, Luke, and John.  Joseph Smith, the man chosen by God in the early 1800\\'s to dedicate his life to translating, publishing and evangelizing the Book of Mormon throughout the world, was viciously threatened and attacked throughout the course of his life, then brutally murdered by a mob in the middle of the night at the age of 39.  To this day he remains a polarizing figure, soliciting either great admiration or disdainful contempt, and not much inbetween.  \n\n","torrent":{"xt":"urn:btih:ec2e7a83b91a519aa73d04b1103ead4ebc9945cb","amp;dn":"Living+Scriptures+-+Extra+Episodes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec2e7a83b91a519aa73d04b1103ead4ebc9945cb","infoHashBuffer":{"type":"Buffer","data":[236,46,122,131,185,26,81,154,167,61,4,177,16,62,173,78,188,153,69,203]},"announce":[],"urlList":[]}}