{"title":"Hitman 2","uid":6799293,"size":1401622905,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:ecfb838280c04998bf958e26418cc67692fbcb1a&amp;dn=Hitman+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"itsme_16","files":3,"time":1320594879,"description":"Hitman 2 for PS2\n\nthis is an original rip from the original DVD of hitman 2, so it should work. but you need to have a chip modded on your ps2 in order to play backup games burned on DVDs. If you want to learn more about these mods just google em' out.\n\nthis is just a rip so if you really want the original game, then buy them.\n\njust burn .iso file using ImgBurn or DVD Decrypter at 4x speed (i prefer using these two because they never disappoint and always get the job done, and best of all it's free) \n\nuse DVD-R for burning (Verbatim,BenQ, Sony)\n\nWorks well on a chip modified ps2 or ps2 emulator for pc gaming \n\nPlease SEED! to keep the torrent healthy. \n\nI'll be seeding everyday!\n\nGame Description:\n\nHitman 2 features mission-based gameplay. On each level, the main character, known only as 47, is given a set of objectives to complete. Most levels require the assassination of one or more people. However, how missions are completed is up to the player, and there are almost always a variety of ways to complete missions. Instead of simply running and gunning through the mission, one can set sneaky traps, like poisoning a drink, to terminate the target in silence. Once again, it's up to the player to decide how he or she will kill the target.\n\nEnjoy!","torrent":{"xt":"urn:btih:ecfb838280c04998bf958e26418cc67692fbcb1a","amp;dn":"Hitman+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ecfb838280c04998bf958e26418cc67692fbcb1a","infoHashBuffer":{"type":"Buffer","data":[236,251,131,130,128,192,73,152,191,149,142,38,65,140,198,118,146,251,203,26]},"announce":[],"urlList":[]}}