{"title":"MAFIA III Incl Update 1 PC Game","uid":15999166,"size":23954479104,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ed0a57b0b1b4ade648a8b1caa4a7cd4a31ffb798&amp;dn=MAFIA+III+Incl+Update+1+PC+Game&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":6,"uploader":"kiperaim","files":1,"time":1476103849,"description":"About This Game\r\nIt’s 1968 and after years of combat in Vietnam, Lincoln Clay knows this truth: family isn’t who you’re born with, it’s who you die for. Now back home in New Bordeaux, Lincoln is set on escaping a criminal past. But when his surrogate family, the black mob, is betrayed and wiped out by the Italian Mafia, Lincoln builds a new family on the ashes of the old and blazes a path of military-grade revenge through those responsible. Intense gun fights, visceral hand-to-hand combat, white knuckle driving and street smarts will all be needed. But with the right crew, tough decisions and some dirty hands, it’s possible to make it to the top of the city's underworld. \r\n\r\nNEW BORDEAUX, A REIMAGINED 1968 NEW ORLEANS:\r\nA vast, diverse and seedy open world ruled by the mob and corrupt officials and richly detailed with the sights, sounds and emotionally-charged social atmosphere of the era.\r\nAN UNINTENDED AND LETHAL ANTI-HERO:\r\nBe Lincoln Clay, an orphan and Vietnam veteran hell bent on revenge against the Italian Mafia for the brutal slaughter of the black mob, the closest thing to family he’s ever had.\r\nREVENGE YOUR WAY:\r\nChoose your own personal play-style, from brute force and blazing guns to stalk-and-kill tactics as you use Lincoln’s military training and gathered intel to tear down the Italian Mafia.\r\nA NEW FAMILY ON THE ASHES OF THE OLD:\r\nBuild a new criminal empire in your own unique way by deciding which of your lieutenants you reward, and which you betray…\r\n\r\nMafia III because patch 1.01 is now available for download. This patch includes 30, 60, and unlimited frames-per-second options on PC. To select your framerate, just head to the display menu in-game. Just make sure to tailor the framerate settings to the power of your machine. This patch also includes improvements to keyboard remapping, so head to the controls menu to check out the options. Note: this patch resets keyboard mapping to default, so any changes you made to the controls previously will need to be customized after installing the patch. \r\n\r\n\r\nSystem Requirements\r\nMINIMUM: \r\nOS: Windows 7 64-bit \r\nProcessor: Intel I5-2500K, AMD FX-8120 \r\nMemory: 6 GB RAM \r\nGraphics: 2GB of Video Memory &amp; NVIDIA GeForce GTX 660, AMD Radeon HD7870 \r\nStorage: 50 GB available space \r\nSound Card: DirectX Compliant Sound card \r\nAdditional Notes: Windows 8.1 users may need additional Windows Update files: Please Click here for information","torrent":{"xt":"urn:btih:ed0a57b0b1b4ade648a8b1caa4a7cd4a31ffb798","amp;dn":"MAFIA+III+Incl+Update+1+PC+Game","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed0a57b0b1b4ade648a8b1caa4a7cd4a31ffb798","infoHashBuffer":{"type":"Buffer","data":[237,10,87,176,177,180,173,230,72,168,177,202,164,167,205,74,49,255,183,152]},"announce":[],"urlList":[]}}