{"title":"The Mammoth Book of Tasteless Jokes - Mantesh","uid":7453110,"size":2678680,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:eded9d9383bcfac0ae4ea6856778719677239aa8&amp;dn=The+Mammoth+Book+of+Tasteless+Jokes+-+Mantesh&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MANTESH","files":3,"time":1342581592,"description":" &lt;a href=&quot;http://ecx.images-amazon.com/images/I/51iLQFvdLnL._SS500_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://ecx.images-amazon.com/images/I/51iLQFvdLnL._SS500_.jpg&lt;/a&gt;\n\n[\n\nThe Mammoth Book of Tasteless Jokes\n\n\nPublisher: Robinson Publishing\nE. Henry Thripshaw\nEnglish\n2010 \nISBN: 1849010552 \n512 Pages \nPDF \n2.55 MB\n\nThis is the ultimate collection of tasteless and sick jokes that just shouldn't be told. More than 3,000 off-colour jokes, covering every taboo from sex and death to race and disability, this book leaves no stone unturned in its search for the most dubious jokes known to humanity. Why exactly do we like to laugh at jokes that are cruel, heartless and downright wrong? And more to the point, who cares so long as they make us laugh? Twice as funny, twice as outrageous, twice as shocking. From Anne Frank's drum kit to the correct use of wheelchairs, this is a fantastic new collection of bad taste and political incorrectness. If you even think about reading it you're a monster; if you buy it you're going straight to hell. It includes gems such as these: My father is in a coma. He's just living the dream. Why don't cannibals eat divorced women? Because they're very bitter. What do you do if a pit bull mounts your leg? Fake an orgasm. How do you stop a politician from drowning? Shoot him before he hits the water. The Beatles have reformed and have brought out a new album. It's mostly drum and bass. I went to see my friend's new baby. They asked me if I wanted to wind him. I thought that was a bit harsh so I just gave him a dead leg instead. Remember, a doggy is not just for Christmas. It's a great position all year round.\n\n","torrent":{"xt":"urn:btih:eded9d9383bcfac0ae4ea6856778719677239aa8","amp;dn":"The+Mammoth+Book+of+Tasteless+Jokes+-+Mantesh","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eded9d9383bcfac0ae4ea6856778719677239aa8","infoHashBuffer":{"type":"Buffer","data":[237,237,157,147,131,188,250,192,174,78,166,133,103,120,113,150,119,35,154,168]},"announce":[],"urlList":[]}}