{"title":"Call.of.Duty.Ghosts.Deluxe.Edition.Repack-z10yded","uid":9152697,"size":31356607493,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ee30a0df0437916f0dc6476632f640416f826a52&amp;dn=Call.of.Duty.Ghosts.Deluxe.Edition.Repack-z10yded&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Taker009","files":29,"time":1383724187,"description":"Call.of.Duty.Ghosts.Deluxe.Edition.Repack-z10yded\n\nYear: 2013\nPublication Type: RiP | z10yded\nTablet: enclosing | RELOADED + RamFix\nVersion: 1.0.0.1\nLanguage:  RUS, ENG\nSound language:  RUS, ENG\n\nGame information: \n\nWelcome to the Call of Duty: Ghosts, a new page of the famous \ngame series of all time. For the first time in the history of the series, \nplayers will take part in the battle on the side of the weaker side, and \nwill not fight for freedom and rights, and for the sake of survival. Ten \nyears after the devastating event, the boundaries of the United States \nand the global balance of power changed. In this harsh reality, the officers \nof an elite unit &quot;Ghosts&quot; to challenge the new global force, equipped with \nthe latest technology and applying for world domination. New universe Call \nof Duty: For the first time the series, players will take part in the battle \non the side of the weaker side, when the enemy is superior, not only by the \nnumber of trunks, but also on the technological equipment. Players will be \nintroduced to new characters and brand new to the Call of Dutu location.\n\nGame Features\n\nDrawing a new generation advanced technology, uniting incredibly realistic characters, \nstunning locations, advanced lighting, and special effects worthy of the best Hollywood \nblockbuster.\n\nUnique experience: for the first time in the history of the series, players will take part in the battle on the side of the weaker side, when the enemy is superior, not only by the number of trunks, but also on the technological equipment.\n\nThe development of a multi-user game: With the updated engine Call of Duty: Ghosts will change your ideas about modes of multiplayer games. The dynamically changing maps you will encounter earthquakes, floods, and other events that could affect the strongest terms the tactics and strategy of the fight. And the advanced character editor allows players to create a truly unique fighters.\n\nSystem requirements:\n\nOperating system: Windows  7 64-Bit, Windows 8  64-Bit \nProcessor: Intel  Core 2 Duo E8200 2.66 GHz or AMD  Phenom  X3 8750 2.4 GHz \nMemory: 6 GB \nVideo: Nvidia  GeForce  GTS 450 or ATI  Radeon  HD 5870 with 1024 MB \nSound Card: Compatible with DirectX Â® 11 \nHard drive space: 30 GB\nStarting: Install and play.\n\nRepack Features \n\nThe release is based on the Call of Duty - Ghosts Deluxe Edition \nRemoved multiplayer and localization except Russian and English / no recoded \nIntegrated RamFix for games on computers with at least 6 GB of RAM \nOf these files can not shake the fact that you do not need: \nVersion 1.0.0.1 \nInstallation time ~ 15 minutes \nThe release of z10yded","torrent":{"xt":"urn:btih:ee30a0df0437916f0dc6476632f640416f826a52","amp;dn":"Call.of.Duty.Ghosts.Deluxe.Edition.Repack-z10yded","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee30a0df0437916f0dc6476632f640416f826a52","infoHashBuffer":{"type":"Buffer","data":[238,48,160,223,4,55,145,111,13,198,71,102,50,246,64,65,111,130,106,82]},"announce":[],"urlList":[]}}