{"title":"Arumba's Keyboard Shortcut - Crusader Kings II mod","uid":10792887,"size":25293,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ee520a746792d5a05dccb93dfde9065fb714317e&amp;dn=Arumba%27s+Keyboard+Shortcut+-+Crusader+Kings+II+mod&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Nimbleton","files":-1,"time":1408270725,"description":"Arumba's Keyboard Shortcuts + Interface Adjust\n\n\nExtract 7zip file to your 'C:Users [user] Documents Paradox Interactive Crusader Kings II mod' folder\n\n\nKeyboard Shortcuts + Interface Adjust: \nInterface Adjust: Adjusts the character selection GUI so that it does not overlap with the character interface. \n\nKeyboard Shortcuts: \nThis adds 11 shortcuts to the game: &quot;z&quot;,&quot;x&quot;,&quot;c&quot;,&quot;v&quot;,&quot;b&quot;,&quot;n&quot;,&quot;m&quot;,&quot;,&quot;,&quot;.&quot;,&quot;/&quot;,&quot;l&quot; \n\nz raises levy directly from any county you have control over \nz also toggles siege interface while selecting a province or army in an enemy province. \nz also sends units to the left side of an army or ship balancing screen, each press sends the bottom listed unit left. press and hold for rapid rebalancing \nz will 'cancel' or 'go to' on event windows (such as disband troops, or after a siege/battle has completed) \nz will go to the previous holding in demesne \n\nx dismisses the currently selected levy (army or ship), *capital* &quot;x&quot; will dismiss ALL selected levies or ships \n\nc raises ships directly from any county you have control over \nc assaults holdings when you have an army/county is selected that allows for assaulting \nc Confirms diplomacy interactions, and will 'ok' event windows (such as disband troops) \n\nv embarks the currently selected levy into a ship that is IN port in that province \nv also selects all armies inside boats if a ship is selected \nv also will close one army at a time while having multiple armies selected. The two previously mentioned shortcuts take priorty. This shortcut is ideal for raiding with multiple armies as a viking. (v selects armies, right click all onto a county, press v, right click onto another county, repeat.) \nv will create a new vassal from the holding screen of minor owned baronies \n\nb merges selected levies or ships, so long as they are in the same zone or province (naturally.) If you have a single army/shipgroup the &quot;b&quot; key will open the new unit interface (ship/army rebalancing) \nb also sends units to the right side of an army or ship balancing screen, each press sends the bottom listed unit right. press and hold for rapid rebalancing \nb will go to the next holding in demesne \nb is also back button for the main interfaces \n\nn selects the trade port screen on coastal provinces \n\nm selects the normal holdings screen \n\nl toggles looter status for pagan armies \n\n, opens the ledger, and closes the ledger \n\n. opens the find characters interface, and also closes it \n\n/ opens the find title interface \n\n################################################################################ \nTo manually alter keybindings, download notepad++ from www.ninite.com and install \nuse notepad++ to 'search in files', select the mod folder as the directory \nsearch for: Shortcut = &quot; \n(leave the quotations open) \nthis will pull up all the shortcuts listed in the mod files. \ndoubleclick on the bottom of the screen through each of the results until you see the &quot;guiButtonType =\t{&quot; that looks like what you want. \nyou can alter or remove any of the options that say &quot;shortcut = &quot;x&quot;&quot; to your liking \nThere is some trial and error to this if you are not experienced with the layout of the game files. Just play with it, you'll figure it out. \n################################################################################ ","torrent":{"xt":"urn:btih:ee520a746792d5a05dccb93dfde9065fb714317e","amp;dn":"Arumba%27s+Keyboard+Shortcut+-+Crusader+Kings+II+mod","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee520a746792d5a05dccb93dfde9065fb714317e","infoHashBuffer":{"type":"Buffer","data":[238,82,10,116,103,146,213,160,93,204,185,61,253,233,6,95,183,20,49,126]},"announce":[],"urlList":[]}}