{"title":"Railworks TS2016 DTG  Arriva Trains Wales DMU Pack Add-On","uid":14288570,"size":150396312,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ee7e73c3edb4028edb693782e3a9ca48868aaea1&amp;dn=Railworks+TS2016+DTG++Arriva+Trains+Wales+DMU+Pack+Add-On&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TS2015","files":1,"time":1460417455,"description":"The perfect accompaniment to the new South Wales Coastal route for Train Simulator is this Arriva Trains Wales DMU Pack, containing the Class 143 and Class 158. \r\n\r\nThe British Rail Class 143 is a diesel multiple unit, part of the Pacer family of trains introduced between 1985 and 1986. They originally worked in the North-East of England but were later transferred to Wales and South-West England. Based on a Walter Alexander bus body, the ‘Nodding Donkey’ was introduced to the rail network in the mid-1980s and is well known for its unsophisticated bouncy ride and meagre seating, faithfully recreated in this model. \r\n\r\nThe Class 158 was introduced by British Rail in 1989 as part of the programme to replace ageing heritage DMUs still in service. With an aluminium body, the DMU was dubbed the ‘Express Sprinter’ as it was designed to accelerate rapidly between stations, making it ideal for stopping services where new tighter timetables could now be introduced. With a top speed of 90mph and comfortable interior furnishings, it was also intended to be capable of handling longer services with ease. \r\n\r\nThe Arriva Trains Wales DMU Pack for Train Simulator contains both the Class 143 and Class 158 in Arriva Trains Wales livery. \r\n\r\n\r\nTHIS ADDON WILL NOT WORK ON LEGIT TRAIN SIMUALTOR 2016!!!","torrent":{"xt":"urn:btih:ee7e73c3edb4028edb693782e3a9ca48868aaea1","amp;dn":"Railworks+TS2016+DTG++Arriva+Trains+Wales+DMU+Pack+Add-On","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee7e73c3edb4028edb693782e3a9ca48868aaea1","infoHashBuffer":{"type":"Buffer","data":[238,126,115,195,237,180,2,142,219,105,55,130,227,169,202,72,134,138,174,161]},"announce":[],"urlList":[]}}