{"title":"Pirate Alley [2013] Stephen Coonts mobiepub INFERNO","uid":8496572,"size":2128566,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:eea0e10fe090f25bd154a379bfb3baaea00e97f7&amp;dn=Pirate+Alley+%5B2013%5D+Stephen+Coonts+mobiepub+INFERNO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"V3nom","files":11,"time":1369161792,"description":"[code]Pirate Alley by Stephen Coonts\n\nFormat: mobi/epub\nGenre: Action/Adventure\nPrint Length: 320 pages\nRelease Date: 7 May 2013\n\nGrafton and Carmellini are back and joined by the Navy SEALs to battle terrorists on the high seas in this action-packed tale by New York Times bestseller Stephen Coonts\n\nA luxurious vacation cruise to the exotic locales of the Red Sea and the Gulf of Aden turns into a nightmare for passengers and crew when their ship is suddenly attacked and captured by a band of bloodthirsty Somali pirates. An initial rescue mission ends in failure; the decks are covered in blood. Unless they are paid a ransom of $200 million dollars within seven days, the pirates threaten to execute all their hostages. But information gleaned from a captured Al Qaeda operative indicates that there is a far more dangerous conspiracy afoot.\n\nOnce the ransom is paid, Islamic militants intend to swoop in and slaughter the passengers in an orgy of terror, hoping to provoke a massive American military response that will set the Muslim world aflame. Jake Grafton is assigned to negotiate with the brutal pirate chief while his right hand man, Tommy Carmellini, and a team of CIA and Navy SEAL operatives mount an undercover operation to save the hostages and keep the U.S. from being maneuvered into a murderous war.\n\nAuthor:\n\nStephen Coonts is the author of 14 New York Times bestsellers, the first of which was the classic flying tale, FLIGHT OF THE INTRUDER.\n\nBorn in 1946, Stephen Paul Coonts grew up in Buckhannon, West Virginia, a coal-mining town of 6,000 population on the western slope of the Appalachian mountains. He majored in political science at West Virginia University, graduating in 1968 with an A.B. degree. Upon graduation he was commissioned an Ensign in the U.S. Navy and began flight training in Pensacola, Florida.[/code]","torrent":{"xt":"urn:btih:eea0e10fe090f25bd154a379bfb3baaea00e97f7","amp;dn":"Pirate+Alley+%5B2013%5D+Stephen+Coonts+mobiepub+INFERNO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eea0e10fe090f25bd154a379bfb3baaea00e97f7","infoHashBuffer":{"type":"Buffer","data":[238,160,225,15,224,144,242,91,209,84,163,121,191,179,186,174,160,14,151,247]},"announce":[],"urlList":[]}}