{"title":"Gay - WilliamHiggins - Jarmil &amp; Tibor | HD 23.Nov","uid":9239736,"size":522521844,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:eea1a1bf22970a1e2d1a690c1c09d04074cb4b4c&amp;dn=Gay+-+WilliamHiggins+-+Jarmil+%26amp%3B+Tibor+%7C+HD+23.Nov&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"DavidL0ng","files":1,"time":1385239294,"description":"Jarmil Sladky and Tibor Rysavy are a pair of great looking guys. We matched them up for this scene. We join them as Jarmil is oiling Tibor's body, and as he does so he lowers the front of the underwear to reveal a lovely cock. Tibor pushes his shorts down further so he is completely naked, and Jarmil loses his too. They kiss and touch, with their cocks getting nice and hard. Jarmil goes down and sucks on Tibor's big cock. It is nice and thick and fills his mouth, the lips closed tightly around the head. Jarmil sucks it and licks the thick shaft, as Tibor's hand holds his head in place. Jarmil stands again and Tibor kisses him before dropping to his knees and taking that engorged cock in his mouth. He sucks it for a while before they move to the sofa, with Jarmil sucking again. He loves that big, throbbing cock of Tibor's. Having sucked some more Jarmil moves on top of Tibor so that they can 69. After some real hot sucking Tibor gives up his ass to Jarmil's hard cock. That dick works in and out of Tibor's tight hole and he moans as he feels the thrusting. When they change position Tibor sits down on Jarmil's cock and rides it, as his own thick hard meat sways, and his balls bounce. He really works his ass up and down Jarmil's shaft, loving every inch of it. Tibor then lays down and, legs up to his head, takes that big dick again. Jarmil fucks him with long, deep strokes, stretching that hole real good. Tibor wanks himself as he takes that cock and soon creams over his belly. Jarmil continues to fuck that hot ass until he is ready to blow, then pulls out and shoots his hot cum over Tibor. He leans forward and kisses him again to end a lovely scene.\n\nSize: 522521844 bytes (498.32 MiB), duration: 00:20:26, avg.bitrate: 3410 kb/s\nAudio: aac, 44100 Hz, stereo, s16, 108 kb/s (eng)\nVideo: h264, yuv420p, 1280x720, 3292 kb/s, 25.00 fps(r) (eng)\n\n\nScreen :  &lt;a href=&quot;\nhttp://jollypix.net/?v=529045cd38.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://jollypix.net/?v=529045cd38.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://jollypix.net/?v=williamhig.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://jollypix.net/?v=williamhig.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:eea1a1bf22970a1e2d1a690c1c09d04074cb4b4c","amp;dn":"Gay+-+WilliamHiggins+-+Jarmil+%26amp%3B+Tibor+%7C+HD+23.Nov","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eea1a1bf22970a1e2d1a690c1c09d04074cb4b4c","infoHashBuffer":{"type":"Buffer","data":[238,161,161,191,34,151,10,30,45,26,105,12,28,9,208,64,116,203,75,76]},"announce":[],"urlList":[]}}