{"title":"Drogas y cerebro - 01 Cocaina y Estimulantes [DVDRip][Spanish]","uid":7016635,"size":529321720,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ef40f4bc70c3cc373b530ee66355bb791b018f70&amp;dn=Drogas+y+cerebro+-+01+Cocaina+y+Estimulantes+%5BDVDRip%5D%5BSpanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"virana","files":-1,"time":1328687659,"description":"\nDocumental - Drogas y cerebro - Serie documental que consta de 5 capÃƒÂ­tulos.\n\n\n\nCuando las drogas se apropian de nuestra consciencia, nuestro cerebro se descontrola y el sistema nervioso se acelera. Ã‚Â¿CÃƒÂ³mo actÃƒÂºan las drogas?, Ã‚Â¿por quÃƒÂ© nos volvemos adictos?, Ã‚Â¿por quÃƒÂ© es tan duro dejarlo?. Estas son algunas de las cuestiones a las que intenta responder esta serie documental coproducida por Arte, que cuenta con la experiencia y el testimonio de cientÃƒÂ­ficos, psiquiatras y sociÃƒÂ³logos. Hay que tener en cuenta que sin los estudios sobre algunas drogas, muchos aspectos cruciales del mecanismo de nuestro cerebro aun serÃƒÂ­an un enigma y algunos tratamientos no existirÃƒÂ­an. En el futuro, la obesidad y la anorexia podrÃƒÂ­an ser tratadas con un medicamento derivado de la marihuana, y el Alzheimer con pÃƒÂ­ldoras de nicotina. Este documental observa y analiza los efectos de la droga, legal e ilegal, sobre nuestro cerebro. Y cuenta con cientÃƒÂ­ficos, psiquiatras y sociÃƒÂ³logos que nos guiarÃƒÂ¡n mÃƒÂ¡s allÃƒÂ¡ de las puertas de la percepciÃƒÂ³n, y viajaremos al interior de nuestra mente. La serie analiza el cannabis, el tabaco, el alcohol, los esteroides, los ansiolÃƒÂ­itcos, las drogas de diseÃƒÂ±o y cÃƒÂ³mo afectan a nuestro cerebro.\nLa serie consta de cinco episodios:\n\n1. Cocaina y estimulantes\nCocaÃƒÂ­na y estimulantes. En el cerebro, la cocaÃƒÂ­na y las anfetaminas producen determinados efectos relacionados con el placer, los ÃƒÂºltimos estudios han mejorado la comprensiÃƒÂ³n de algunos de estos efectos, por ejemplo el tratamiento de la hiperactividad con un determinado tipo de anfetamina. El programa indaga en las ÃƒÂºltimas investigaciones.\n","torrent":{"xt":"urn:btih:ef40f4bc70c3cc373b530ee66355bb791b018f70","amp;dn":"Drogas+y+cerebro+-+01+Cocaina+y+Estimulantes+%5BDVDRip%5D%5BSpanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef40f4bc70c3cc373b530ee66355bb791b018f70","infoHashBuffer":{"type":"Buffer","data":[239,64,244,188,112,195,204,55,59,83,14,230,99,85,187,121,27,1,143,112]},"announce":[],"urlList":[]}}