{"title":"NewWorld2013","uid":7948222,"size":446747572,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:ef9515b9fbff6cbd9e7596371f4e3cd9a5eaf882&amp;dn=NewWorld2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"RamDawg","files":59,"time":1356190812,"description":"There is the 25,625 year &quot;Galactic Day&quot; and the 5,125 year &quot;Long Count&quot;(Great Cycle). Both of these are set to END and RESTART on the Winter Solstice of 2012 (11:00 UST Dec. 21, 2012): \n\nLet's start with the &quot;Galactic Day&quot;. As we travel around the Milky Way galaxy, it is my understanding that we do not remain at a constant distance nor at the same orientation in relation to the black hole at its center; a black hole the Maya refer to as the supreme creator, &quot;HUNAB KU&quot;. Instead, we move closer and further from this black hole. As we move in closer, we simultaneously become aligned with the Milky Way's equator or &quot;The Tree of Life&quot; as the Maya call it. Upon doing so, we may become exposed to &quot;HUNAB KU's&quot; opposing magnetic forces which would cause our Sun to eject intense solar flares and Earth to experience a magnetic pole reversal (Pole Shift). In the years that we have been furthest away from ,&quot;HUNAB KU&quot;, we have been dense low vibrating energy and have been experiencing our dark spiritual years: These years have been part of the &quot;Galactic Night&quot;. As we move closer, we become higher vibrating energy and spiritually enlightened beings: These years pertain to the &quot;Galactic Day&quot;. We are currently in transition from Night to Day. The complete cycle takes 25,625 years; approximately the same as what modern science has calculated and named &quot;The Precession Of The Equinox Cycle&quot;. ","torrent":{"xt":"urn:btih:ef9515b9fbff6cbd9e7596371f4e3cd9a5eaf882","amp;dn":"NewWorld2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef9515b9fbff6cbd9e7596371f4e3cd9a5eaf882","infoHashBuffer":{"type":"Buffer","data":[239,149,21,185,251,255,108,189,158,117,150,55,31,78,60,217,165,234,248,130]},"announce":[],"urlList":[]}}