{"title":"Blender 3D Cookbook (2015).pdf Gooner","uid":12305848,"size":37328387,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:eff85e1f73e27e43254a43d07cc7b110cca437f1&amp;dn=Blender+3D+Cookbook+%282015%29.pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1440800508,"description":"Publisher: Packt Publishing - ebooks Account (July 2015)\nLanguage: English\nISBN-10: 1783984880\nISBN-13: 978-1783984886\n\nBuild your very own stunning characters in Blender from scratch\n\nAbout This Book\n\nEstablish the basic shape of a character with the help of templates, and complete it by using different Blender tools\nGain an understanding of how to create and assign materials automatically, working in both the Blender Internal engine as well as in Cycles\nFamiliarize yourself with the processes involved in rigging, skinning, and finally animating the basic walk-cycle of the character\n\nWho This Book Is For\n\nThis book is aimed at the professionals that already have good 3D CGI experience with commercial packages and have now decided to try the open source Blender and want to experiment with something more complex than the average tutorials on the web.\n\nHowever, it's also aimed at the intermediate Blender users who simply want to go some steps further.\n\nIt's taken for granted that you already know how to move inside the Blender interface, that you already have 3D modeling knowledge, and also that of basic 3D modeling and rendering concepts, for example, edge-loops, n-gons, or samples.\n\nIn any case, it's also possible for a keen beginner to follow this book, by combining it with the manual on the BlenderWiki or preceding it with a basic Blender UI tutorial on the web.\n\nThe keyboard/mouse shortcuts for the operations in the recipes are, at least in all the more relevant cases, indicated in brackets.\n\nWhat You Will Learn\n\nCreate a basic mesh depicting the character's overall shape and mood in a few simple steps\nUse your sculpting skills to carve the character features from the mesh\nFind the best possible flow for your edge-loops to enhance the character features and for the best possible range of deformation\nPaint your character to enhance the surface's details\nMix both the Blender Internal and Cycles rendering engines in order to render materials as quickly as possible.\n\nIn Detail\n\nThis book will take you on a journey to understand the workflow normally used to create characters, from the modeling to the rendering stages using the tools of the last official release of Blender exclusively.\n\nThis book helps you create a character mesh and sculpt features, using tools and techniques such as the Skin modifier and polygon merging. You will also get a detailed, step-by-step overview of how to rig and skin your character for animation, how to paint textures and create shaders, and how to perform rendering and compositing. With the help of this book, you will be making production-quality 3D models and characters quickly and efficiently, which will be ready to be added to your very own animated feature or game","torrent":{"xt":"urn:btih:eff85e1f73e27e43254a43d07cc7b110cca437f1","amp;dn":"Blender+3D+Cookbook+%282015%29.pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eff85e1f73e27e43254a43d07cc7b110cca437f1","infoHashBuffer":{"type":"Buffer","data":[239,248,94,31,115,226,126,67,37,74,67,208,124,199,177,16,204,164,55,241]},"announce":[],"urlList":[]}}