{"title":"It's Not About the Shark: How to Solve Unsolvable Problems","uid":12864183,"size":1731070,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f17a6eeece0166c78afeb312c4f224f11d7c7c3a&amp;dn=It%27s+Not+About+the+Shark%3A+How+to+Solve+Unsolvable+Problems&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TopShelfBook","files":3,"time":1448774540,"description":"It's Not About the Shark: How to Solve Unsolvable Problems | PDF | MOBI\r\n\r\nIt's Not About the Shark opens the door to the groundbreaking science of solutions by turning problems―and how we solve them―upside down. When we have a problem, most of us zero in, take it apart, and focus until we have it solved. David Niven shows us that focusing on the problem is exactly the wrong way to find an answer. Putting problems at the center of our thoughts shuts down our creative abilities, depletes stamina, and feeds insecurities. It's Not About the Shark shows us how to transform our daily lives, our work lives, and our family lives with a simple, but rock-solid principle: If you start by thinking about your problems, you'll never make it to a solution. If you start by thinking about a solution, you'll never worry about your problems again.\r\n\r\nThrough real-life examples and psychology research, David Niven shows us why:\r\n\r\n*Focusing on the problem first makes us 17 times less likely to find an answer\r\n*Being afraid of a problem is natural: we're biologically primed to be afraid\r\n*Finding a problem creates power – which keeps you from finding a solution\r\n*Working harder actually hides answers\r\n*Absolute confidence makes you less likely to find the answer\r\n*Looking away from a problem helps to see a solution\r\n*Listening only to yourself is one of the best ways to find an answer\r\n\r\nCombining hard facts, good sense, and a strong dose of encouragement, David Niven provides fresh and positive ways to think about problem solving.\r\n\r\n**PLEASE SEED**","torrent":{"xt":"urn:btih:f17a6eeece0166c78afeb312c4f224f11d7c7c3a","amp;dn":"It%27s+Not+About+the+Shark%3A+How+to+Solve+Unsolvable+Problems","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f17a6eeece0166c78afeb312c4f224f11d7c7c3a","infoHashBuffer":{"type":"Buffer","data":[241,122,110,238,206,1,102,199,138,254,179,18,196,242,36,241,29,124,124,58]},"announce":[],"urlList":[]}}