{"title":"trojan hunter with uppdate","uid":4314806,"size":18179834,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f2b45dfbd328cd535afadf7c8c6ba73f848af96d&amp;dn=trojan+hunter+with+uppdate&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"romelanda","files":3,"time":1217017186,"description":"TrojanHunter 5.0 searches for and removes trojans from your system. With an easy-to-use Scanner and a Guard that scans in the background TrojanHunter is a must-have complement to your virus scanner.\nThe Beast trojan, employing modern stealth techniques actually injects itself into other processes. TrojanHunter is the only scanner capable of cleaning process-injecting trojans. \n\nFeatures:\n* High-speed file scan engine capable of detecting modified trojans\n* Memory scanning for detecting any modified variant of a particular build of a trojan\n* Registry scanning for detecting traces of trojans in the registry\n* Inifile scanning for detecting traces of trojans in configuration files\n* Port scanning for detecting open trojan ports\n* The Advanced Trojan Analyzer, an exclusive feature of TrojanHunter, is able to find whole classes of trojans using advanced scanning techniques\n* TrojanHunter Guard for resident memory scanning - detect any trojans if they manage to start up\n* LiveUpdate utility for effortless ruleset updating via the Internet\n* Process list giving details about every running process on the system, including the path to the actual executable file\n* Accurate removal of all detected trojans - even if they are running or if the trojan has injected itself into another process\n* Built-in netstat viewer\n* Right click scanning\n* Extensive help files \n\n","torrent":{"xt":"urn:btih:f2b45dfbd328cd535afadf7c8c6ba73f848af96d","amp;dn":"trojan+hunter+with+uppdate","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2b45dfbd328cd535afadf7c8c6ba73f848af96d","infoHashBuffer":{"type":"Buffer","data":[242,180,93,251,211,40,205,83,90,250,223,124,140,107,167,63,132,138,249,109]},"announce":[],"urlList":[]}}