{"title":"En eeuwig zingen de bossen Het geslacht Bjorndal (Part1) 2Lions-","uid":5627833,"size":4404686801,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:f336d9b2427ab2c1ed505c2ffb61b45564527def&amp;dn=En+eeuwig+zingen+de+bossen+Het+geslacht+Bjorndal+%28Part1%29+2Lions-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Pioen","files":-1,"time":1276549271,"description":"Und Ewig Singen die WÃƒÂ¤lder (1959) \nAlternatieve titels: En Eeuwig Zingen de Bossen, Beyond Sing the Woods \n\nEn eeuwig zingen de bossen is de verfiming van het eerste deel van het beroemde boek &quot;Het geslacht Bjorndal&quot;.\nOorspronkelijk bestond het boek uit drie delen maar voor de films hebben ze het verhaal ingekort in twee films: \nDeel 1 En eeuwig zingen de bossen, en\nDeel 2 Winden waaien om de rotsen.      \n\n \n  En Eeuwig Zingen de Bossen (Aka Und Ewig Singen die WÃƒÂ¤lder - 1959)\nVerfilming van de gelijknamige roman van Trygve Gulbranssen, een familiesage die zich afspeelt te midden van imposante Noorse landschappen.\n\nBoer Dag senior (Frobe), heeft twee zoons Tore en Dag junior (Felmy en Hansen). Terwijl Tore zijn oogappel is, veracht hij de rustige Dag. Ook met zijn buurman leeft Boer Dag senior op voet van oorlog. De spanningen lopen hoog op.\n\nEgnlish\n\nFor centuries, the Norwegian BjÃƒÂ¶rndal family has been gaining wealth and prestige, painstakingly conquering farm land on nature to make their estate BjÃƒÂ¶rndal the envy of all the region, while their proud rivals, the noble von Gall family on the castle Borkland, lost fortune. The BjÃƒÂ¶rndal patriarch Dag Sr., scarred in the face during a bear kill, has two sons: his fierce first-born favorite Tore shares his love for taunting the von Galls, while the gentle Dag Jr. rather enjoys the silence of the forest. When Tore seems to court the equally proud and stubborn Elisabeth von Gall, she makes her military suitor Lt. Margas challenge him to a duel- Tore, armed only with his coach whip, is pierced by his saber and his corps carried away by the river; now Elisabeth turns away from him. Even a month later Dag Sr. refuses to believe the missing Tore must be dead. Hunting the last bear, Dag Jr. loses his rifle and is badly wounded killing the beast with his knife; Adelheid and her father, retired royal guards Major Barre, friends of the von Galls, witness this, bring him home and are invited to stay at BjÃƒÂ¶rndal, where Adelheid nurses him and slips out Tore's fate to Dag Sr.; she and Dag Jr. fall in love. Even when her father confesses the mortgaged castle estate is near financial ruin, Elisabeth refuses to consider finding a rich husband as Margas, who just died, could have been. At Christmas, Dag Sr. invites Adhelheid to stay indefinitely, and she persuades him to attend church for the first time since the death of his wife ThÃƒÂ©rÃƒÂ¨se, 20 years earlier- there he springs the lovers to marry. In Spring Dag Sr. has a major wood contract for the English mines, which can only be fulfilled with the castle's cooperation; the von Galls finally learn the BjÃƒÂ¶rndals have bought all their debts. Elisabeth refuses the logs customary passage by the river trough the castle estate so father BjÃƒÂ¶rndal chooses, at great expense and inhuman effort, to create an alternative route, even if it kills a workman to Dag Jr. disgust which even makes him leave to become a sailor, and forecloses on the castle- the proud Elisabeth rather sets fire to it and burns in it. Only the next Christmas Dag Sr. learns from von Gall that Elisabeth secretly loved Tore; trying to reach his meanwhile returned son and Adelheid, the old man catches a fatal cold in the snow, and dies after learning he has a newborn grandson, Tore.\n\n\n\n\nOostenrijk\nDrama\n92 minuten\n\ngeregisseerd door Paul May\nmet Gert FrÃƒÂ¶be, HansjÃƒÂ¶rg Felmy en Joachim Hansen\n\nFormaat: DVD5 (digitaal geremasterd)\nTaal: Duits\nOndertitel: Nederlands\nCover: Ja\n \nSpotinformatie \nCategorie : Beeld \nFormaat : DVD5 \nBron : Retail\n \nOndertitels : Nederlands (Hardcoded)\n \nGenre : Drama\n \nWeblink : &lt;a href=&quot; http://www.kino.de/kinofilm/und-ewig-singen-die-waelder/trailer/1973.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.kino.de/kinofilm/und-ewig-singen-die-waelder/trailer/1973.html&lt;/a&gt; \nWeblink : &lt;a href=&quot; http://www.moviemeter.nl/film/15975&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.moviemeter.nl/film/15975&lt;/a&gt;\nWeblink : &lt;a href=&quot; http://www.imdb.com/title/tt0053393&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.imdb.com/title/tt0053393&lt;/a&gt;\n\n*****************************************\n\nBrought to you by \nPioen\n\n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n\n\n\n\n2Lions the site to be for all your Dutch MOVIES and more\n\n******************************************\n\n\nDON T HIT AND RUN Niet gelijk afhaken als de FILM binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\n\n \n \n \n","torrent":{"xt":"urn:btih:f336d9b2427ab2c1ed505c2ffb61b45564527def","amp;dn":"En+eeuwig+zingen+de+bossen+Het+geslacht+Bjorndal+%28Part1%29+2Lions-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f336d9b2427ab2c1ed505c2ffb61b45564527def","infoHashBuffer":{"type":"Buffer","data":[243,54,217,178,66,122,178,193,237,80,92,47,251,97,180,85,100,82,125,239]},"announce":[],"urlList":[]}}