{"title":"(Blues) Salty Dog - Steel to Steel","uid":6313653,"size":123017199,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f5646b1ddfc807ae714405ca0f71b9eb027643ce&amp;dn=%28Blues%29+Salty+Dog+-+Steel+to+Steel&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"nightissuchproximity","files":-1,"time":1302624808,"description":"Styles: Acoustic Blues, Country Blues\nReleased: 1999\nLabel: Independent\nFile: mp3@320K/s\nSize: 112.5 MB\nTime: 49:08\nArt: full\n\n1. Walking Blues - 5:15\n2. Annie Crab - 3:56\n3. (Medley) Heaven Sittin Down / Pallet on your Floor - 7:22\n4. Blues for Madison - 3:58\n5. What Happened to my Shoes - 3:32\n6. Mistreated Blues - 3:48\n7. Robbed Again - 2:41\n8. Lonesome Dog Blues - 4:46\n9. Ragged and Dirty - 3:28\n10. Don't you mind People rinning in your Face - 2:27\n11. Medley - 7:48\n\n\nPersonnel:\nSteve Plater: guitars, dobro, mandolin, banjo, stomp-box, fiddle, harmonica, vocals\nMarion Turner: vocals, guitar, harmonica, mandolin, washboard, tub bass, percussion\nIan Phillips: washboard percussion, vocal\n\nSalty Dog play a myriad of blues and roots styles, from the urban blues of Chicago to the blues and cajun of the Delta and across to the bluegrass of Kentucky. They traverse the timeline from the 1920's to the 1980's and pay deep respect to the legends such as Robert Johnson, Mississippi Fred McDowell, Sleepy John Estes, John Hurt, Son House, Doc Watson and many more. They also throw a few of their own compositions into the mix to good effect.\n\nThe band varies in size depending upon the needs of their gigs, however the core of the band has remained Steve Plater and Marion Turner. Steve is widely recognised as one of the finest blues guitarists in the country, though he is also a multi-instrumentalist and singer of note. Steve's well-known passion for all forms of blues music shows through loud and clear. Marion is a dynamic stage performer who combines harmonica with a rich and powerful voice, and is a talented multi-instrumentalist in her own right.\n\nThe year 2000 was a watershed year for Salty Dog, with Steve winning the Vic/Tas Blues Awards Male Artist of the Year and Marion winning the corresponding Female Artist of the Year for the second year running. Steve's musicianship combined with Marion's energetic and heartfelt vocals also took Salty Dog to the Vic/Tas 2000 Band of the Year award. Since then, Salty Dog have progressed as a duo, growing their reputation as a hard-working and energetic band through almost non-stop touringi across Victoria and interstate. Reward for their efforts came in 2002 at the National Blues Awards when Salty Dog took out the Band of the Year award.\n\n\n","torrent":{"xt":"urn:btih:f5646b1ddfc807ae714405ca0f71b9eb027643ce","amp;dn":"%28Blues%29+Salty+Dog+-+Steel+to+Steel","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5646b1ddfc807ae714405ca0f71b9eb027643ce","infoHashBuffer":{"type":"Buffer","data":[245,100,107,29,223,200,7,174,113,68,5,202,15,113,185,235,2,118,67,206]},"announce":[],"urlList":[]}}