{"title":"The Beatles - 1964-08-22 - Empire Stadium, Vancouver, BC, Canada","uid":7642044,"size":137447035,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f5cbcf1adcc05d7fc9f44b05cd654f0927e78ce8&amp;dn=The+Beatles+-+1964-08-22+-+Empire+Stadium%2C+Vancouver%2C+BC%2C+Canada&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"TUFF_GONG","files":15,"time":1347805486,"description":"I didn't see this show on Dimeadozen, either in active or dead torrents, so I thought I'd share. \n\nThis is the Beatles playing at the Empire Stadium in Vancouver, BC, Canada, on August 22, 1964, during their first full-length North American tour. \n\nThe recording comes from a radio broadcast at the time. The tape eventually found its way into collectors' circles, and now it comes to you. \n\nThis is from the non-official Purple Chick release of &quot;Seattle Down Now&quot;. I didn't share that full disc because there's some officially-released stuff on it, and the rest (particularly the Seattle show) is of unlistenable sound quality. \n\nThe presumed lineage would be: \nAM broadcast &gt;&gt; ? Gen tape &gt;&gt; Silver Disc &gt;&gt; FLAC. \n\nBut I don't know Purple Chick's lineage for certain--there may be more generations between the tape and their disc (and I don't know if the tape was reel-to-reel or cassette or what). Either way, it sounds as good as it ever will. I'd give it about an 8.5 out of 10 on sound quality. \n\nThe show itself is probably my favorite Beatles concert from 1964. The crowd gets really rowdy, and the emcee has to come on stage to scold them to stand back, otherwise, &quot;kids are gonna get crushed&quot;. The Beatles' press officer Derek Taylor joins in at one point as well, pleading with the crowd to stand back. And then the Beatles have to go right back to their set! (And even encourage them to &quot;clap your hands and stomp your feet&quot;!) \n\nNone of this has ever been released officially in any form. For the mods: It was broadcast once, live, by a local Vancouver radio station, long before the advent of pay radio. PM me if you have questions. \n\nEnjoy! Here's the tracklist: \n\n01 - Intro \n02 - Twist and Shout \n03 - You Can't Do That \n04 - All My Loving \n05 - She Loves You \n06 - Things We Said Today \n07 - Roll Over Beethoven \n08 - Can't Buy Me Love \n09 - If I Fell \n10 - Boys \n11 - A Hard Day's Night \n12 - Long Tall Sally \n\nInformation text file and md5 checksum file also included. \n\nEdit: Corrected lineage (thanks, EZ). \n\nAlso thanks to everyone who provided background details behind the recording--I was unaware of most of it! \n\nAnd, for those looking for artwork, this is part of a larger bootleg (that includes some banned material as well as some other atrocious-sounding stuff) so I don't have anything just for this show. But here's the artwork for the bootleg: \n\n","torrent":{"xt":"urn:btih:f5cbcf1adcc05d7fc9f44b05cd654f0927e78ce8","amp;dn":"The+Beatles+-+1964-08-22+-+Empire+Stadium%2C+Vancouver%2C+BC%2C+Canada","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5cbcf1adcc05d7fc9f44b05cd654f0927e78ce8","infoHashBuffer":{"type":"Buffer","data":[245,203,207,26,220,192,93,127,201,244,75,5,205,101,79,9,39,231,140,232]},"announce":[],"urlList":[]}}