{"title":"DOS For Dummies, 3rd Edition","uid":12568252,"size":5766281,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f6738754de2cdaad773a3c1bcad9e6b0818eb664&amp;dn=DOS+For+Dummies%2C+3rd+Edition&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mdusanjay","files":1,"time":1444811136,"description":"DOS For Dummies, 3rd Edition by Dan Gookin\r\n\r\nOverview: The book that changed the way computer books are written and marketed has come out in a third edition. By and large, it's the same as the previous edition (advances in MS-DOS have not been numerous), but there is some new information here. Further, DOS for Dummies remains an entertaining book and if you use DOS, it's the book you want to assist you.\r\nThe basic idea of this book is that you can identify a problem you're having with your computer, ranging from how to turn the thing on to how to back up only the files that have changed since the last backup. You can then turn to the relevant section--the table of contents is very detailed--read a few pages, carry out some procedure, and move on to the next problem. You'll find sections on hardware, file management, text editing, and software installation. Later chapters deal with troubleshooting.\r\n\r\nThe newest material in this release of DOS for Dummies deals with DOS 6.22 and the DOS-like shell that you can use under Windows 95 and Windows 98. For users of the latest versions of Windows, Gookin demonstrates some relevant procedures. But most of the coverage deals with DOS itself and programs that are designed to run under DOS. There's even stuff about WordStar here (it's a little-known fact of history that the Rosetta stone was written with WordStar)","torrent":{"xt":"urn:btih:f6738754de2cdaad773a3c1bcad9e6b0818eb664","amp;dn":"DOS+For+Dummies%2C+3rd+Edition","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6738754de2cdaad773a3c1bcad9e6b0818eb664","infoHashBuffer":{"type":"Buffer","data":[246,115,135,84,222,44,218,173,119,58,60,27,202,217,230,176,129,142,182,100]},"announce":[],"urlList":[]}}