{"title":"Britten: A Ceremony of Carols [Original Recording Reissued]","uid":10600376,"size":333503222,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f77798b9c2bd757f219c35c7ff3811bc16c24cf5&amp;dn=Britten%3A+A+Ceremony+of+Carols+%5BOriginal+Recording+Reissued%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"magneez","files":4,"time":1405913492,"description":"FLAC + CUE\nno scans\n\nrandom amazon review:\n\n\nThe works of Benjamin Britten on this recording were originally recorded in 1972 and 1974 and have been transferred from vinyl to CD, remastered in 1987, and still remain as fine as any recordings subsequent to these mysteriously beautiful works. In particular the 'Ceremony of Carols' for treble voices and harp recorded in King's College allows the procession and recession to 'feel' like an entry and exit - very atmospheric. The harpist for this recording is the famous Welsh harpist Osian Ellis and gives his role a more important sound than other harpists on other recordings.\n\nThe other works on this recording include the joyous 'Hymn to St. Cecilia' for unaccompanied chorus, the festival cantata 'Rejoice in the Lamb' which happens to include among the soloists the now famous James Bowman, countertenor!, the 'Te Deum in C' and 'Jubilate Deo' both with organist James Lancelot and the far too rarely heard 'Missa Brevis in D'. The choir is up to its usual high standards as are the two conductors Sir David Willocks (Ceremony of Carols, Hymn to St Cecelia, Missa Brevis) and Philip Ledger (Te Deum, Jubilate Deo and Rejoice in the Lamb). The acoustics of the chapel add greatly to the joy of this very special recording. Grady Harp, December 10","torrent":{"xt":"urn:btih:f77798b9c2bd757f219c35c7ff3811bc16c24cf5","amp;dn":"Britten%3A+A+Ceremony+of+Carols+%5BOriginal+Recording+Reissued%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f77798b9c2bd757f219c35c7ff3811bc16c24cf5","infoHashBuffer":{"type":"Buffer","data":[247,119,152,185,194,189,117,127,33,156,53,199,255,56,17,188,22,194,76,245]},"announce":[],"urlList":[]}}