{"title":"RESIDENT-EVIL....DVDrip(vice)","uid":4981429,"size":372728238,"categoryP":"video","categoryS":"handheld","magnet":"?xt=urn:btih:f7932e7522be88237dc4b299d45c44117e289a58&amp;dn=RESIDENT-EVIL....DVDrip%28vice%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"vicerock","files":-1,"time":1246331183,"description":"RESIDENT EVIL DVDrip.....PSP...IPOD....MP4\n\nResolution    : 368X208 (Wide Screen)\n              : 320X240 (Full Screen)\n\nVideo Codec   : MPEG4\nVideo Bitrate : 448 Kbps\nAudio Codec   : AAC\nAudio Bitrate : 64 Kbps\n\nThe film begins in The Hive, a top-secret genetic research facility owned by the Umbrella Corporation located deep beneath Raccoon City. A technician loads vials of blue and green liquid into a secured case, then tosses one blue vial onto the floor inside a lab, exits and seals the room. The vial breaks and the facility's security system, the Red Queen detects possible infection, and in response, seals the Hive and kills everyone inside.\n\nElsewhere, a woman known only as &quot;Alice&quot; (Milla Jovovich) (though she is not named onscreen) awakens in an empty mansion with amnesia. She finds a picture showing that she is married; other clues, like concealed automatic weapons, suggest she is not a simple housewife. After she steps outside the mansion door, a man yanks her back inside; the two are immediately seized by a group of commandos. The man, Matthew (known as Matt throughout the film) Addison, identifies himself as a police officer, but the commandos handcuff him regardless. The team opens a mirror-door to an underground train station. While taking a route to the Hive underground train station, the team discovers an unconscious man, known as Spence (James Purefoy). Alice recognizes him as the man in the wedding photograph. Questioning reveals that he also suffers from amnesia. When the train arrives at the Hive, the commandos prepare to breach the Hive.\n\nThe &quot;One&quot;, as he is called, is the head of the commandos and explains that Alice, Spence, and the commandos, are employees of the Umbrella Corporation, and it was Umbrella that sent the team to investigate why the Red Queen killed all the Hive staff. The computer has characteristics of a person, such as a gender (female). She is responsible for releasing a nerve gas in the mansion which has caused Alice and Spence's amnesia. The crew find their way to the Dining Hall B up to the Queen's chamber. However, as the bulk of the team attempt to disable the Red Queen, four of them are trapped in the corridor leading to the Queen's Chamber and are torn apart by a laser tripped when the Queen's door was opened. This leaves Alice , Spence, Kaplan, J.D., Rain (Michelle Rodriguez) and Matt as the only survivors. Alice and Kaplan shut the Queen down, but in doing so open the doors of the facility, releasing the undead staff and experiments from the laboratories in which they were imprisoned. A battle between commandos and flesh-eating zombies commences. Rain becomes infected after receiving multiple bite wounds, and a battle ensues in which Matt and Alice are separated and J.D. is eaten alive by zombies. Kaplan, Rain and Spence remain in the control room in front of Red Queen's chamber. When Alice and Matt were together in another facility of the Hive, they talked together and Alice discovers that Matt was not a police officer, and used the title as a cover in his goal to help take down the Umbrella Corporation. Matt, with the help of his sister, Lisa, unsuccessfully attempts to smuggle a sample of the T-Virus, the cause of the undead. Matt believes this to be the fault of Lisa's contact, who supposedly betrayed her. Throughout the film Alice has flashbacks, showing herself as Lisa's contact, but Alice is not fully aware of her role in the events.\n\nPLEASE....SEED....AND....ENJOY....THANKS","torrent":{"xt":"urn:btih:f7932e7522be88237dc4b299d45c44117e289a58","amp;dn":"RESIDENT-EVIL....DVDrip%28vice%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f7932e7522be88237dc4b299d45c44117e289a58","infoHashBuffer":{"type":"Buffer","data":[247,147,46,117,34,190,136,35,125,196,178,153,212,92,68,17,126,40,154,88]},"announce":[],"urlList":[]}}