{"title":"Winrod-Adam Weishaupt-Human Devil(1969)","uid":4932797,"size":136324,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f81fbef6a4b7f470841447a9b3234b90be6f3f21&amp;dn=Winrod-Adam+Weishaupt-Human+Devil%281969%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"red_gonzo","files":1,"time":1244075867,"description":"This is Gerald B. Winrod's amazing booklet Adam Weishaupt - A Human Devil (1969) which provides basic coverage of Adam Weishaupt's Illuminati order, Freemasonry, the French revolution and who was behind it. Disorders, revolutions, economic convulsions and political upheavals do not happen by chance. They result from careful planning. Under the surface, unknown to good people, there are constant plots, schemes, tricks and intrigues. Hidden forces continue their subterranean activities until they reach a boiling point, then an explosion takes place on the surface. The rank and file of people are caught off their guard. There comes a devastating outburst in which lives are lost, property is destroyed and human development is retarded (sounds familliar?). Not until the storm breaks do the sleeping masses awaken, yawn, stir themselves and look about at the wreckage and carnage, after it is too late to help matters. International conspirators always find it to their advantage to lull the people to sleep until they can get their plots developed so far that nothing can stop them. A man in a stupor is harmless. The despoilers have a way of keeping the popular mind befuddled and drugged, under the influence of their opiates. It is a rare thing for an awakening to take place in time to avert a crisis. Propaganda is a powerful weapon in the hands of wicked men. Yet the thinking of a whole nation may become warped in a comparatively short time, on some particular question, by a bombardment of ideas released from carefully planned and timed sources. By degrees these ideas sink into the mass mind and a community is moulded accordingly. Then the people take the things they have been taught for granted, little suspecting that, parrot-like, they are merely chattering about false notions which have been insinuated into their mental processes. Thus designing leaders find it possible to bring wreck and ruin upon a country by pulling wires from behind the scenes. They are able to produce cross currents and create class hatreds, keeping themselves and their true purposes concealed from the public gaze. The average person lives on the surface and neither cares, nor knows how, to inform himself about hidden evils which may be lurking in the shadows. Try to tell him the unpleasant truth and warn him of what is about to take place, and he is liable to do what the farmer did when he saw a giraffe for the first time, cry out angrily, &quot;I don't believe it!&quot; Secret societies, sometimes founded upon high ideals and lofty precepts, are frequently prostituted by men of evil genius who get control of them for their own private gain and selfish use. Because there is always an element of mystery associated with a lodge, it becomes a convenient cloak and an ideal means for secret operations, when taken over by subversive influences. It will be shown in this treatise that certain conspirators have used secret societies in the past as practical vehicles for boring under the surface. Thus, destructive causes, set in motion long ago, are still producing catastrophic effects in the world. Two revolutions of comparatively recent times, loom up in the thinking of every student of history. The French and the Russian revolution. Neither of these outbreaks was produced primarily for economic and political reasons in order to relieve the suffering of the poor and middle classes of people. Peaceful means could have been found for adjusting whatever abnormal conditions there may have been existing at the respective periods in which these two storms occurred. It was not necessary to spill an ocean of blood. The fact is that both of these revolutions resulted from secret, under-cover planning so that a certain system, an invisible empire, a hidden organization, could advance its evil interests. The fundamental purpose was to produce an onslaught against Christianity and the moral and social systems which it had produced on the earth. 50 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:f81fbef6a4b7f470841447a9b3234b90be6f3f21","amp;dn":"Winrod-Adam+Weishaupt-Human+Devil%281969%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f81fbef6a4b7f470841447a9b3234b90be6f3f21","infoHashBuffer":{"type":"Buffer","data":[248,31,190,246,164,183,244,112,132,20,71,169,179,35,75,144,190,111,63,33]},"announce":[],"urlList":[]}}