{"title":"The Aleppo Codex - A True Story of Obsession, Faith, and the Pur","uid":7819452,"size":1727307,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f88b6dfbab1d1d68392f015a5aa36dc679936426&amp;dn=The+Aleppo+Codex+-+A+True+Story+of+Obsession%2C+Faith%2C+and+the+Pur&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":".xtend.","files":-1,"time":1352759440,"description":"The Aleppo Codex: A True Story of Obsession, Faith, and the Pursuit of an Ancient Bible by Matti Friedman\nAlgonquin Books | 2012 | ISBN: 1616200405 | English | 320 pages | EPUB + MOBI | 0.80 MB + 0.95 MB\n\n\nIn an age when physical books matter less and less, here is a thrilling story about a book that meant everything. This true-life detective story unveils the journey of a sacred text-the tenth-century annotated bible known as the Aleppo Codex-from its hiding place in a Syrian synagogue to the newly founded state of Israel. Based on Matti Friedman's independent research, documents kept secret for fifty years, and personal interviews with key players, the book proposes a new theory of what happened when the codex left Aleppo, Syria, in the late 1940s and eventually surfaced in Jerusalem, mysteriously incomplete.The codex provides vital keys to reading biblical texts. By recounting its history, Friedman explores the once vibrant Jewish communities in Islamic lands and follows the thread into the present, uncovering difficult truths about how the manuscript was taken to Israel and how its most important pages went missing. Along the way, he raises critical questions about who owns historical treasures and the role of myth and legend in the creation of a nation.","torrent":{"xt":"urn:btih:f88b6dfbab1d1d68392f015a5aa36dc679936426","amp;dn":"The+Aleppo+Codex+-+A+True+Story+of+Obsession%2C+Faith%2C+and+the+Pur","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f88b6dfbab1d1d68392f015a5aa36dc679936426","infoHashBuffer":{"type":"Buffer","data":[248,139,109,251,171,29,29,104,57,47,1,90,90,163,109,198,121,147,100,38]},"announce":[],"urlList":[]}}