{"title":"The Connells...Boylan Heights(1987)[FLAC]","uid":6872758,"size":267320837,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f8e2416f55caaa8ca60e6adf1aa29fca29dc927b&amp;dn=The+Connells...Boylan+Heights%281987%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"dickspic","files":15,"time":1323324151,"description":" &lt;a href=&quot;http://image.allmusic.com/00/amg/cov200/drd600/d604/d60482g29lc.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://image.allmusic.com/00/amg/cov200/drd600/d604/d60482g29lc.jpg&lt;/a&gt;\n\nBoylan Heights [1987]TVT RecordsTVT-2540\n\n[img]http://i128.photobucket.com/albums/p180/SonAfterDark/tracklistlatest.png[/img]\n\n\t1\t\tScotty's Lament\t -Connells\t3:24\n\t2\t\tChoose a Side\t -Connells\t3:44\n3\t\tTry\t -Connells, Townsend\t3:17\n4\t\tJust Like Us\t -Connells, MfcMillan\t3:28\n5\t\tIf It Crumbles\t -Connells\t3:43\n6\t\tPawns\t -Connells, MacMillan\t3:24\n7\t\tOver There\t -Connells\t3:29\n8\t\tElegance\t-Connells, MacMillan\t3:40\n9\t\tHome Today\t-Huntley\t3:28\n10\t\tOTÃ‚Â²\t -Connells\t2:52\n11\t\tI Suppose\t-Connell\t4:50\n\nBoylan Heights, the Connells' second album, shows a great improvement over its predecessor. With help from producer Mitch Easter, the band effectively combines Southern rock's jangly guitars with Celtic influences. One of the more distinctive, though generally overlooked, college rock albums of the late '80s.\nThe Raleigh, North Carolina-based jangle pop outfit the Connells formed in the spring of 1984. Fronted by guitarist Mike Connell and his brother, bassist David, the first incarnation of the group also featured vocalist Doug McMillan and drummer John Schultz, who was soon replaced by former Johnny Quest percussionist Peele Wimberley. In late 1984, the quartet recorded a four-song demo. After one of the tracks, &quot;Darker Days,&quot; was selected to appear on the North Carolina compilation More Mondo, the Connells' ranks expanded with the addition of singer/guitarist George Huntley, who made his debut on a March 1985 session co-produced by Don Dixon. \n\nWith the help of the band's friend Ed Morgan, the resulting demo made its way to the offices of the British label Demon, which agreed to fund the recording of additional tracks to complete a full-length LP. Darker Days was released in Europe by Demon in 1985, and when Morgan returned to the U.S., he formed his own label, Black Park, to issue the album domestically. After the low-budget videos for the tracks &quot;Seven&quot; and &quot;Hats Off&quot; garnered MTV airplay, the Connells won a contract with the TVT label prior to entering producer Mitch Easter's Drive-In Studios to record 1987's brooding, more assured Boylan Heights, which featured the superb single &quot;Scotty's Lament.&quot; \n\nThe edgier Fun and Games followed in 1989, and a year later, the group resurfaced with One Simple Word, scoring an alternative radio hit with the single &quot;Stone Cold Yesterday.&quot; After a three-year tour that saw the Connells add keyboardist Steve Potak to their lineup in 1991, they finally returned to the studio to begin work on 1993's Ring, highlighted by the singles &quot;Slackjawed&quot; and &quot;74-75,&quot; a major hit throughout Europe. After another three-year hiatus, the Connells issued 1996's Weird Food &amp; Devastation, released concurrently with Huntley's solo debut, Brain Junk. The group returned in 1998 with Still Life, and after ending their relationship with the TVT label, self-released Old-School Dropouts in 2001 on Black Park Records.\n\ncd ripped by EAC\n\nplease seed\n &lt;a href=&quot;\nhttp://dickthespic.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/&lt;/a&gt;","torrent":{"xt":"urn:btih:f8e2416f55caaa8ca60e6adf1aa29fca29dc927b","amp;dn":"The+Connells...Boylan+Heights%281987%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8e2416f55caaa8ca60e6adf1aa29fca29dc927b","infoHashBuffer":{"type":"Buffer","data":[248,226,65,111,85,202,170,140,166,14,106,223,26,162,159,202,41,220,146,123]},"announce":[],"urlList":[]}}