{"title":"The Kept: A Novel (2014) James Scott (multi) ","uid":9549242,"size":1941488,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f8f8ec15151821bef716697815b785c051c7a861&amp;dn=The+Kept%3A+A+Novel+%282014%29+James+Scott+%28multi%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"7","files":-1,"time":1391205138,"description":"\nThe Kept: A Novel By James Scott\n\n\nFormat: mobi/epub/azw3\nLength: 368 pages\nGenre: Suspense/Thriller/Historical\nDate: 7 January 2014\n\nSet in rural New York state at the turn of the twentieth century, James Scott makes his literary debut with The Kept--a propulsive novel reminiscent of the works of Michael Ondaatje, Cormac McCarthy and Bonnie Jo Campbell.\n\nIn the winter of 1897, Elspeth Howell treks across miles of snow and ice to the isolated farmstead in upstate New York where she and her husband have raised their five children. Her midwife's salary is tucked into the toes of her boots, and her pack is full of gifts for her family. But as she crests the final hill, and sees her darkened house and a smokeless chimney, immediately she knows that an unthinkable crime has destroyed the life she so carefully built.\n\nHer lone comfort is her twelve-year-old son, Caleb, who joins her in mourning the tragedy and planning its reprisal. Their long journey leads them to a rough-hewn lake town, defined by the violence both of its landscape and of its inhabitants. There Caleb is forced into a brutal adulthood, as he slowly discovers truths about his family he never suspected, and Elspeth must confront the terrible urges and unceasing temptations that have haunted her for years. Throughout it all, the love between mother and son serves as the only shield against a merciless world.\n\nAn Amazon Best Book of the Month, January 2014.\n\nAuthor:\n\nJames Scott was born in Boston and grew up in upstate New York. He holds a BA from Middlebury College and an MFA from Emerson College. His fiction has appeared in Ploughshares, One Story, American Short Fiction, and other publications.","torrent":{"xt":"urn:btih:f8f8ec15151821bef716697815b785c051c7a861","amp;dn":"The+Kept%3A+A+Novel+%282014%29+James+Scott+%28multi%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8f8ec15151821bef716697815b785c051c7a861","infoHashBuffer":{"type":"Buffer","data":[248,248,236,21,21,24,33,190,247,22,105,120,21,183,133,192,81,199,168,97]},"announce":[],"urlList":[]}}