{"title":"You Tube Downloader Android","uid":6945468,"size":812044,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:f90f88c8f1c42cfa5cc535368d38b69e436d8115&amp;dn=You+Tube+Downloader+Android&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"cad40","files":1,"time":1326208563,"description":"The name &quot;YouTube Downloader&quot; is terribly misleading because the program, in fact, downloads a whole lot more than just YouTube videos. On the developer's site, you can find an extensive list of additional supported sites including Facebook and Vimeo. This wide net of support easily pushes YouTube Downloader to the top of its category.\nWhen you find a video you'd like to download, copy the URL of the video page and open YouTube Downloader. From there, you'll notice that the program automatically pastes the URL into the appropriate field. Choose your desired Download quality (Best Available is a nice option) and your destination folder, then hit Download. Once your download is finished, hit the Play tab to watch. The Convert tab lets you export to a different file format for playing elsewhere, and gives you a convenient mini editor for making minor alterations before your export. You can change video volume (or remove audio altogether) and splice footage by setting specific start and end times.\nOne thing that disappointed us was the absence of a one-step download-and-convert function in the free version. If you want the one-step convenience, you'll have to upgrade to Pro ($19.90), which also gives you the capability of downloading multiple videos at once. Also, it would've been nice to be able to name files before downloading them, but that's certainly not a deal-breaker.\nFor online video enthusiasts looking to download non-copyrighted or personally owned videos, YouTube Downloader appears to be a near-perfect tool. Sure it's missing a few minor conveniences, but its simplicity and the fact that it casts such a wide net of support for online video sites make it virtually unbeatable.\n\n\nRead more: YouTube Downloader - Free software downloads and software reviews - CNET\n\n\n\n\nI know this is free in market but for my tablet and some other devices it dosent show up in market saying it wont run on your device but it does work on them","torrent":{"xt":"urn:btih:f90f88c8f1c42cfa5cc535368d38b69e436d8115","amp;dn":"You+Tube+Downloader+Android","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f90f88c8f1c42cfa5cc535368d38b69e436d8115","infoHashBuffer":{"type":"Buffer","data":[249,15,136,200,241,196,44,250,92,197,53,54,141,56,182,158,67,109,129,21]},"announce":[],"urlList":[]}}