{"title":"Cartoon Network Titles","uid":4894906,"size":2329764225,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:fa81ce01abe0d32c7dee3d1d8042ed5ad95984c8&amp;dn=Cartoon+Network+Titles&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"brodahisou","files":-1,"time":1242258664,"description":"Collection of all the scanned issues of Cartoon Network anthology comic books published by DC Comics. It began publishing in June 1997 as Cartoon Network Presents, but has since changed its title to Cartoon Network Starring and Cartoon Cartoons, restarting at issue #1 each time, before taking on its current name, Cartoon Network Block Party, in September 2004.\n\nCartoon Network Presents consisted of stories based on other Hanna-Barbera properties. These were mainly billed as Cartoon All-Stars. Much of the stories featured in these issues featured crossovers between the various shows. Stories based on the shows in the Toonami programming block and new shows Dexter's Laboratory, Cow and Chicken, and Space Ghost: Coast to Coast were also abundant in this title. Notably, Cartoon Network Presents marked the last new comic book title to feature the classic Hanna-Barbera characters (excluding Scooby-Doo). Its run ended after two years.\n\nIn July 1999, the comic was restarted as Cartoon Network Starring. Though it followed the same formula as its predecessor, the comic shifted focus away from the older cartoons that had been featured previously, instead focusing on the network's original programming, the Cartoon Cartoons. In this title, The Powerpuff Girls and Johnny Bravo made their comic debuts.\n\nIn January 2001, the comic book restarted at issue #1 once again, this time having the same title as the name given for the shows it was based on. Unlike the previous incarnations, though, the issues now featured stories based on multiple shows rather than just one show per issue. Under the title Cartoon Cartoons new shows were featured in the comic: I Am Weasel, Ed, Edd 'n Eddy, Courage the Cowardly Dog, and Sheep in the Big City at issue #1, and Grim and Evil and Codename: Kids Next Door made their comic debut in issue #14. In addition, following the cancellation of the its own comic book, new stories based on Dexter's Laboratory were added to this anthology in issue #17. The last issue of Cartoon Cartoons was published in August 2004.\n\nWith the revival of Johnny DC as a mascot, the Cartoon Network anthology comic was renumbered and retitled again to Cartoon Network Block Party. For the new incarnation the idea of multiple adventures in one comic was conceived. Now each comic either has 3 adventures on 3 different shows or occasionally only 2 adventures. In March 2006, The Powerpuff Girls were moved to this comic following their own comic book's cancellation, showing up in issue #19. Hi Hi Puffy AmiYumi was added in the 22nd issue in June, 2006. Foster's Home for Imaginary Friends and Camp Lazlo joined the block in the 25th issue.\n\nIn May 2006, Cartoon Network Action Pack!, a new anthology title, began publication. This one features stories based on of Cartoon Network's action-oriented shows, including Samurai Jack, Megas XLR, The Life and Times of Juniper Lee, and Ben 10 and The Secret Saturdays.\n\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:fa81ce01abe0d32c7dee3d1d8042ed5ad95984c8","amp;dn":"Cartoon+Network+Titles","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa81ce01abe0d32c7dee3d1d8042ed5ad95984c8","infoHashBuffer":{"type":"Buffer","data":[250,129,206,1,171,224,211,44,125,238,61,29,128,66,237,90,217,89,132,200]},"announce":[],"urlList":[]}}