{"title":"Peter F Hamilton collection 4 audiobooks","uid":8899512,"size":3319442815,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:faa36e61e495d5fb3cc6c12c74c6a7eb8d06920f&amp;dn=Peter+F+Hamilton+collection+4+audiobooks&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":5,"uploader":"audio4","files":66,"time":1378782538,"description":"\nGeneral Information\n===================\nTitle:                  The Temporal Void\nAuthor:                 Peter F. Hamilton\nRead By:                John Lee\nCopyright:              2009\nAudiobook Copyright:    2009\nGenre:                  Sci-Fi\nPublisher:              Tantor Media\nSeries Name:            Void Trilogy\nPosition in Series:     2\n\nOriginal Media Information\n==========================\nMedia:                  MP3-CD\nSource:                 Rental\nCondition:              Very Good\n\nFile Information\n================\nNumber of MP3s:         34\nTotal Duration:         25:10:42\nTotal MP3 Size:         691.80\nParity Archive:         No\nEncoded With:           LAME\nEncoded At:             CBR 64 kbit/s 24000 Hz Joint Stereo\nID3 Tags:               Set, v1.1, v2.3\n\nBook Description\n================\nLong ago, a human astrophysicist, Inigo, began dreaming scenes from\nthe life of a remarkable human being named Edeard, who lived within\nthe Void, a self-contained microuniverse at the heart of the galaxy.\nThere, under the beneficent gaze of mysterious godlike entities, humans\npossessed uncanny psychic abilities, and Edeard's were the strongest\nof all. Equally strong was his determination to bring justice and freedom\nto a world terrorized by criminal violence and corruption.\n\nInigo's inspirational dreams, shared by hundreds of millions throughout\nthe galaxy-spanning gaiafield, gave birth to a religion---Living Dream.\nBut when the appearance of a Second Dreamer seemed to trigger the expansion\nof the Void---an expansion that is devouring everything in its path---the\nIntersolar Commonwealth was thrown into turmoil. With the adherents\nof Living Dream determined to set forth on a dangerous pilgrimage into\nthe Void, interstellar war threatens to erupt.\n\nWith time running out, the fate of humanity hinges on a handful of people.\nThere is Araminta, only now awakening to the unwelcome fact that she\nis the mysterious Second Dreamer---and to the dire responsibilities\nthat go with it; Inigo, whose private dreams hint at a darker truth\nbehind Edeard's legendary life; Paula Myo, the ruthless field operative\nof the Commonwealth, whose search for Araminta and Inigo is about to\nyield a most unpleasant surprise; and Justine, whose desperate gamble\nplaces her within the Void, where the godlike Skylords hold the power\nto save the universe...or destroy it.\n\n\nGeneral Information\n===================\nTitle............: The Dreaming Void                              \nAuthor...........: Peter F. Hamilton          \nRead By..........: John Lee              \nGenre............: Science Fiction            \nPublisher........: Tantor Media; Unabridged edition (June 1, 2008)\n\nOriginal Media Information\n==========================\nMedia............: 18 CDs\n\nFile Information\n================\nNumber of MP3s...: 18\nTotal Duration...: 22 hours 37 minutes\nTotal MP3 Size...: 765 MB            \nRipper...........: Exact Audio Copy\nEncoder..........: LAME 3.98.2          \nEncoder Settings.: ABR 80 kbit/s 44100 Hz Mono          \nID3 Tags.........: v1.1, v2.3 (includes embedded album art)\n\nBook Description\n\n\nIn the tradition of grand-scale SF sagas that explore the potential of human evolution, this densely plotted and intensely thought-provoking opener for Hamilton's Void trilogy takes place roughly 1,000 years after the events of 2006's Judas Unchained. Humankind in the 34th century has effectively conquered mortality, but many humans are still searching for existential transcendence, and a growing number believe the answer can be found inside the Void at the galactic center. Once thought to be an enormous black hole, the Void, which supposedly contains an entire micro-universe inside an impenetrable event horizon, slowly devours stars to sustain itself. If left unchecked, it will eventually consume the entire galaxy. When the technologically augmented telepath Inigo begins experiencing revelatory dreams, his shared visions ignite a mass pilgrimage to the Void, which some believe will trigger the apocalypse. Readers can expect big ideas and big story lines as well as big cliffhangers at the novel's conclusion.\n\n\n\nGeneral Information\n===================\nTitle............: The Evolutionary Void: Void Trilogy, Book 3\nAuthor...........: Peter F. Hamilton\nRead By..........: John Lee\nGenre............: Science Fiction\nPublisher........: Tantor\nYear.............: 2010\nUnabridged.......: Yes\nLanguage.........: English\n\nFile Information\n================\nNumber of MP3s...: 3\nTotal Duration...: 24 hours 46 minutes\nTotal MP3 Size...: 696 MB\nEncoder..........: LAME 3.98        \nEncoder Settings.: VBR~66 kbit/s 22500 Hz Mono          \n\n\nBook Description\n================\n\nAn innovator praised as one of the inventors of &quot;the new space opera,&quot; Peter F. Hamilton has also been hailed as the heir of such golden-age giants as Heinlein and Asimov. His star-spanning sagas are distinguished by deft plotting, engaging characters, provocative explorations of science and society, and soaring imaginative reach. Now, in one of the most eagerly anticipated offerings of the year, Hamilton brings his acclaimed Void trilogy to a stunning close.\n\nExposed as the Second Dreamer, Araminta has become the target of a galaxywide search by government agent Paula Myo and the psychopath known as the Cat, along with others equally determined to prevent---or facilitate---the pilgrimage of the Living Dream cult into the heart of the Void. An indestructible microuniverse, the Void may contain paradise, as the cultists believe, but it is also a deadly threat. For the miraculous reality that exists inside its boundaries demands energy---energy drawn from everything outside those boundaries: from planets, stars, galaxies...from everything that lives.\n\nMeanwhile, the parallel story of Edeard, the Waterwalker---as told through a series of addictive dreams communicated to the gaiasphere via Inigo, the First Dreamer---continues to unfold. But now the inspirational tale of this idealistic young man takes a darker and more troubling turn as he finds himself faced with powerful new enemies---and temptations more powerful still.\n\nWith time running out, a repentant Inigo must decide whether to release Edeard's final dream: a dream whose message is scarcely less dangerous than the pilgrimage promises to be. And Araminta must choose whether to run from her unwanted responsibilities or face them down, with no guarantee of success or survival. But all these choices may be for naught if the monomaniacal Ilanthe, leader of the breakaway Accelerator Faction, is able to enter the Void. For it is not paradise she seeks there, but dominion.\n\n\n\nGeneral Information\n===================\nTitle............: The Great North Road\nAuthor...........: Peter F. Hamilton\nRead By..........: John Lee\nGenre............: Science Fiction\nPublisher........: Tantor\nYear.............: 2010\nUnabridged.......: Yes\nLanguage.........: English\n\nFile Information\n================\nNumber of MP3s...: 6\nTotal Duration...: 36 hours 37 minutes\nTotal MP3 Size...: 1006 MB\nEncoder..........: LAME 3.98        \nEncoder Settings.: VBR~66 kbit/s 22500 Hz Mono          \n\n\nBook Description\n================\n\nA century from now, thanks to a technology allowing instantaneous travel across light-years, humanity has solved its energy shortages, cleaned up the environment, and created far-flung colony worlds. The keys to this empire belong to the powerful North family - composed of successive generations of clones. Yet these clones are not identical. For one thing, genetic errors have crept in with each generation. For another, the original three clone &quot;brothers&quot; have gone their separate ways, and the branches of the family are now friendly rivals more than allies.\n\nOr maybe not so friendly. At least that's what the murder of a North clone in the English city of Newcastle suggests to Detective Sidney Hurst. Sid is a solid investigator who'd like nothing better than to hand off this hot potato of a case. The way he figures it, whether he solves the crime or not, he'll make enough enemies to ruin his career. Yet Sid's case is about to take an unexpected turn: Because the circumstances of the murder bear an uncanny resemblance to a killing that took place years ago on the planet St. Libra, where a North clone and his entire household were slaughtered in cold blood.\n\nThe convicted slayer, Angela Tramelo, has always claimed her innocence. And now it seems she may have been right. Because only the St. Libra killer could have committed the Newcastle crime. Problem is, Angela also claims that the murderer was an alien monster.\n\nNow Sid must navigate through a Byzantine minefield of competing interests within the police department and the world's political and economic elite...all the while hunting down a brutal killer poised to strike again. And on St. Libra, Angela, newly released from prison, joins a mission to hunt down the elusive alien, only to learn that the line between hunter and hunted is a thin one.\n\n\n\nIf You Enjoyed This Upload, Click The Button Below To Give Me A Rep Point! A Little Thanks Goes A Long Way","torrent":{"xt":"urn:btih:faa36e61e495d5fb3cc6c12c74c6a7eb8d06920f","amp;dn":"Peter+F+Hamilton+collection+4+audiobooks","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"faa36e61e495d5fb3cc6c12c74c6a7eb8d06920f","infoHashBuffer":{"type":"Buffer","data":[250,163,110,97,228,149,213,251,60,198,193,44,116,198,167,235,141,6,146,15]},"announce":[],"urlList":[]}}