{"title":"Vivaldi - The Four Seasons + 3 Concertos For Violin &amp; Orchestra ","uid":6656693,"size":172091610,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:fb11e9d043defb5d712892e9bcad864f79bcede4&amp;dn=Vivaldi+-+The+Four+Seasons+%2B+3+Concertos+For+Violin+%26+Orchestra+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ConCQWZ","files":21,"time":1315346487,"description":"You're moaning to yourself, &quot;Yet another Four Seasons?&quot; But this disc, believe it or not, is actually worth hearing. Violinist Giuliano Carmignola and the Venice Baroque Orchestra use a slightly different scoring of Vivaldi's masterpiece, the 1996 Ricordi critical edition, and somehow unveil world premieres of three Vivaldi concertos. Their period-instrument performance of The Four Seasons is beautifully played and recorded. Andrea Marcon's conducting stretches the Adagio movements out, but the group makes up for lost time in some feverish Allegro sections. Carmignola's tone is impeccable and his playing sounds incredibly fresh throughout, even on this tried-and-true work. Does the ensemble's Italian background help their understanding of Vivaldi's music (as the liner notes surmise)? Probably not, but they've done their homework on these pieces, and they put plenty of drama into their performances. The violin concertos they dust off are impressive as well, especially for the deft fiddling required in RV 376 (Concerto in B-flat Major) and the pretty organ playing by Marcon. This is a great disc--no fancy gimmick, no scantily clad superstar on the cover; just spirited interpretations and wonderful music. --Jason Verlinde\n\nConCQWZ says : the best recording of the Four Seasons I ever had the opportunity to listen to!\n\nCD 1 of 1, mp3 320kbps","torrent":{"xt":"urn:btih:fb11e9d043defb5d712892e9bcad864f79bcede4","amp;dn":"Vivaldi+-+The+Four+Seasons+%2B+3+Concertos+For+Violin+%26+Orchestra+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb11e9d043defb5d712892e9bcad864f79bcede4","infoHashBuffer":{"type":"Buffer","data":[251,17,233,208,67,222,251,93,113,40,146,233,188,173,134,79,121,188,237,228]},"announce":[],"urlList":[]}}