{"title":"Rascal Flatts - Life Is A Highway","uid":4952757,"size":177373188,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:fb453c1cfee481c528eae069166f9524924d01e2&amp;dn=Rascal+Flatts+-+Life+Is+A+Highway&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1244971636,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Life Is a Highway&quot; is a song written by Tom Cochrane, from his 1991 album Mad Mad World. The song was Cochrane's most famous song, as it was a number one hit in his native Canada. The song also peaked at number six on the Billboard charts in the United States in 1992. The song has been covered and released by Chris LeDoux, Jerry Jeff Walker and Rascal Flatts.\n\nIn 2006, American country music band Rascal Flatts covered this song for the Disney/Pixar animated film Cars. The movie was released on June 9, 2006. The song sold a large quantity of digital downloads, leading to a top ten peak on the Hot 100. In addition, the cover was placed as a bonus track on later versions of the album Me and My Gang, and also was included on their Greatest Hits Volume 1. This version also won the &quot;Favorite Song from a Movie&quot; award at the 33rd People's Choice Awards. The instrumental of the Rascal Flatts' cover version was prominently featured in the Top Gear American special aired February 11, 2007.\n\nThe music video portrays the three band members pulling into a drive-in theater driving three vintage vehicles. The cars are allusive to three characters from the movie: Lightning McQueen, Doc Hudson and Mater. As the projector rolls, scenes from the Disney/Pixar movie Cars are shown as the band plays through the number.\n\nThe Rascal Flatts version subsequently became a hit on the US Hot 100 chart, where it peaked at #7. Even though it was not officially released to country radio, many country stations played the song as an album cut, overlapping with their then-current country single &quot;My Wish&quot;. The unsolicited country airplay brought &quot;Life Is a Highway&quot; to #18 on the country chart.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:fb453c1cfee481c528eae069166f9524924d01e2","amp;dn":"Rascal+Flatts+-+Life+Is+A+Highway","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb453c1cfee481c528eae069166f9524924d01e2","infoHashBuffer":{"type":"Buffer","data":[251,69,60,28,254,228,129,197,40,234,224,105,22,111,149,36,146,77,1,226]},"announce":[],"urlList":[]}}