{"title":"Chet Baker - 1956 - Picture of Heath (1998) FLAC","uid":8366523,"size":269858899,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:fb6d828efb74bed24bd98b2449acfeec1e0e0312&amp;dn=Chet+Baker+-+1956+-+Picture+of+Heath+%281998%29+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"eika256","files":-1,"time":1365785078,"description":"Chet Baker - 1956 - Picture of Heath (1998)\n\nThe seven sides that make up the all-star outing Picture of Heath (1961) might be familiar to fans of co-leads Chet Baker (trumpet) or Art Pepper (alto saxophone), as Playboys (1956). Perhaps owing to trademark-related issues with the men's magazine of the same name, Picture of Heath became the moniker placed on the 1961 Pacific Jazz vinyl re-release, as well as the 1989 compact disc. Regardless of the designation on the label, the contents gather selections recorded on October 31, 1956 -- the third encounter between Baker and Pepper. Backing Baker and Pepper are the sizable quartet of Carl Perkins (piano) [note: not to be confused with the '50s and '60s rockabilly star], Larance Marable (drums), Curtis Counce (bass), and Phil Urso (tenor sax). Although Pepper supplied &quot;Minor Yours&quot; and &quot;Tynan Time,&quot; the majority of the material can be traced to Heath Brothers trio member, Jimmy Heath (sax/flute), who was himself an acclaimed instrumentalist, composer, and arranger. The aggregate provide essential interpretations of his work, adding their own unique earmarks on to what is arguably the best and most playful interaction involving Baker and Pepper. Notable occurrences can be heard on &quot;Picture of Heath&quot; where Pepper sonically salutes Thelonious Monk, quoting recognizable passages from &quot;Rhythm-A-Ning&quot; on a number of occasions -- initially during a fierce exchange with Baker on the title track and then again prominently in the commencement of the aforementioned Pepper composition &quot;Tynan Time.&quot; One of the more striking elements coalescing the partnership between the combo's soloists is the seemingly innate abilities that Baker and Pepper share as they propel themselves through the limber lines of &quot;For Minors Only.&quot; The level of musicianship is evident as Counce, Perkins, and Marable effortlessly banter with youthful verve. Both the studied bop enthusiast and average jazz lover will find much to enjoy and revisit on Picture of Heath. (AllMusic, Lindsay Planer)\n\nTrack list:\n1. Picture of Heath\n2. For Miles and Miles\n3. C.T.A.\n4. For Minors Only\n5. Minor Yours\n6. Resonant Emotions\n7. Tynan Time\n\nPersonnel:\nArt Pepper (Performer, Sax (Alto))\nCarl Perkins (Piano)\nChet Baker (Main Performer, Trumpet)\nCurtis Counce (Bass)\nLarance Marable (Drums)\nPhil Urso (Sax (Tenor))\n\nEnjoy and share!","torrent":{"xt":"urn:btih:fb6d828efb74bed24bd98b2449acfeec1e0e0312","amp;dn":"Chet+Baker+-+1956+-+Picture+of+Heath+%281998%29+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb6d828efb74bed24bd98b2449acfeec1e0e0312","infoHashBuffer":{"type":"Buffer","data":[251,109,130,142,251,116,190,210,75,217,139,36,73,172,254,236,30,14,3,18]},"announce":[],"urlList":[]}}