{"title":"The Rides - Can't Get Enough [2013][EAC,log,cue. FLAC]","uid":9079994,"size":362470462,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:fbd51a53406f21261e35290e1075702b24c52fe7&amp;dn=The+Rides+-+Can%27t+Get+Enough+%5B2013%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":14,"time":1382372666,"description":"Artist:The Rides\nRelease: Can't Get Enough\nReleased: 2013\nLabel: 429 Records\nCatalog#: FTN17940\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry:USA\nStyle: Blues,Rock\n\n\n01. Roadhouse 5:07\n02. That's A Pretty Good Love 2:51\n03. Don't Want Lies 4:41\n04. Search And Destroy 2:28\n05. Can't Get Enough 6:13\n06. Honey Bee 7:17\n07. Rockin' In The Free World 6:09\n08. Talk To Me Baby 3:46\n09. Only Teardrops Fall 4:53\n10. Word Game 4:48\n\nRock was still in the wake of the ornate studio excess that followed the release of the Beatles' Sgt. Pepper's Lonely Hearts Club Band (not every band was the Beatles, unfortunately) when Super Session came out in 1968. A loose album of rock and blues jams featuring Al Kooper and Mike Bloomfield on one side of the LP and Kooper and Stephen Stills on the other side, with a rhythm section of Harvey Brooks on bass and Eddie Hoh on drums tying both sides together, it has held up amazingly well over the years. So here we are in the 21st century and Stills, former Electric Flag member Barry Goldberg (who played electric piano on the 1968 album), and the now-not-so-young-anymore guitar wiz Kenny Wayne Shepherd have formed a sort of super trio in the hopes of recapturing some of the magic of that original super session. The million-dollar question is, do they indeed actually recapture the feel? The million-dollar answer is, no, they don't. But that isn't an indictment of Can't Get Enough, really. The Rides are a competent hard rock-blues group, and Stills, as a guitar player, has always been at his best when he has another guitar player to support and feed off of, and there are plenty of blazing electric guitar leads and tradeoffs here. Curiously, though, particularly given Stills' proven ability as a songwriter, what there isn't here is any striking new material. The best cuts are covers, including versions of Muddy Waters' &quot;Honey Bee,&quot; the Stooges' &quot;Search and Destroy,&quot; and Neil Young's &quot;Rockin' in the Free World&quot; (none of these stray far from the original song templates), but the original material, written jointly by Stills, Goldberg, and Shepherd, seems tired and weary, more riffs than songs. Yeah, there are electric guitars everywhere, and this is a nice-sounding band, but, given the caliber of the talent, it would seem the songs should be better instead of just bounce-offs for guitar pyrotechnics.","torrent":{"xt":"urn:btih:fbd51a53406f21261e35290e1075702b24c52fe7","amp;dn":"The+Rides+-+Can%27t+Get+Enough+%5B2013%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fbd51a53406f21261e35290e1075702b24c52fe7","infoHashBuffer":{"type":"Buffer","data":[251,213,26,83,64,111,33,38,30,53,41,14,16,117,112,43,36,197,47,231]},"announce":[],"urlList":[]}}