{"title":"Julie Silver (Cum Beggars / Double Penetration / 2004)","uid":9790647,"size":642027520,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:fc7b7bd65dc313f7ce5167ee31d9c7a28ac9c5fa&amp;dn=Julie+Silver+%28Cum+Beggars+%2F+Double+Penetration+%2F+2004%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"FluxXxu","files":1,"time":1395241381,"description":"Julie Silver (Cum Beggars / Double Penetration / 2004)\n\nUp next we have a pretty Euro blond who I've seen a few times. Here we start with a good floor shot looking up to Julie who is in a black skirt and bra along with a white mesh shirt over the bra. We watch as Julie rocks back and forth letting her hands lift her skirt then run her hands over her pussy and tits. Julie also lets her ass get some screen lovin before she lies down to play with her pussy, very nice close shots here. Then Julie gets busy taking off her clothes and we get to see her tits pop out befor she is joined by two cocks which she immediatlely goes after. Julie does a good job going in between those cocks taking them balls deep. Mick and his buddy get to fondle and finger her before the sex starts. You see Julie ride hard in cowgirl, do P2M, then get banged in doggie with some ass fingering. You see a giant black butt plug used to pry her ass open and you watch Julie fart the plug out to everyone's amusement and she does this more than once. A nice sized gape is shown from these toys being used, then one is left in her pussy while Mick fucks her ass doggiestyle, then his buddy also gets to tap that ass from behind. There are shots of her ass gaping along with further anal highlights in a cowgirl dp-- some nice double dick sucking, then it's on to a standing cowgirl for Miss Silver along with the standing dp. Up next there is a good fast reverse cowgirl dp for Julie, some shadows right at the area where the dicks are going into her holes and the scene closes with both loads being jerked into Julie's mouth, she shows the spunk off then it's down the hatch.\n\nGonzo, Anal, Double Penetration, Toys, Oral, Blowjob, PornStars\n\nScreens:\n &lt;a href=&quot;\nhttp://www.244pix.com/viewer.php?file=ijap7hb7hx0t.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.244pix.com/viewer.php?file=ijap7hb7hx0t.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.244pix.com/viewer.php?file=3apvn0gwnoxm.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.244pix.com/viewer.php?file=3apvn0gwnoxm.jpg&lt;/a&gt;\n","torrent":{"xt":"urn:btih:fc7b7bd65dc313f7ce5167ee31d9c7a28ac9c5fa","amp;dn":"Julie+Silver+%28Cum+Beggars+%2F+Double+Penetration+%2F+2004%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc7b7bd65dc313f7ce5167ee31d9c7a28ac9c5fa","infoHashBuffer":{"type":"Buffer","data":[252,123,123,214,93,195,19,247,206,81,103,238,49,217,199,162,138,201,197,250]},"announce":[],"urlList":[]}}