{"title":"Star Trek Starfleet Command Gold Edition (GOG)","uid":11983286,"size":288725854,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:fddc032173c3e21493b56e2e95b9e4a2b16578fc&amp;dn=Star+Trek+Starfleet+Command+Gold+Edition+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"-Virtus-","files":5,"time":1433286994,"description":"== About the game:\nBased on a strategy board game, Star Fleet Battles, Star Trekâ„¢: Starfleet Command Gold Edition puts you in the captain's chair of a frigate. Each successful mission gains you prestige and furthers your career. Experience a 30 year campaign that can take you as far as becoming a Rear Admiral in control of a task force including Destroyers, Heavy Cruisers, and Dreadnoughts.\nDiscover uncharted Nebulae, maneuver through dense asteroid fields and belts or battle at the fringe of a black hole. The different types of terrain require commanders to exercise additional caution and skill. Maneuver to keep your target within the arc of your weapons, but remember that these are massive ships and you will have to plan ahead. Between campaign missions refit and repair your ships at Starbase. Recruit new officers or send your trainees back into the officer pool to earn additional prestige. \n\n\n== Features:\nCommand over 50 unique campaign missions generated by the Dynaverse engine, or reenact classic scenarios from the original series.\nPledge allegiance in the Klingon Empire, the United Federation of Planets, the Romulan Star Empire, the Hydran Kingdom, the Gorn Confederation or the Lyran Star Empire.\nGold Edition features an additional 3 new Federation missions, 3 new Klingon missions, 10 new Hydran missions 7 new Gorn missions, 3 new Romulan missions, and more!\n\n\n== Version:\nFirst GOG release or GOG setup 2.0.0.1 from June 2, 2015 \n\n\n== Instructions:\nIt's a GOG version, just launch setup\nClick options to chose location and accept EULA, install \nPlay - Enjoy - Seed - give me what I need\nSpeed! Yeah!\n\n\n== System Requirements:\nCPU: 1.8 GHz Processor \nGPU: DirectX 7 compatible, DX9 recommended\nRAM: 512MB (1 GB recommended)\nOS: Windows XP / Vista / 7 / 8\nHDD: 2 GB available space\n\n\n\n             If you enjoyed the game then share with others by seeding!\n                   Support game development and buy the game!\n\n\n\nGame made by \nInterplay Entertainment","torrent":{"xt":"urn:btih:fddc032173c3e21493b56e2e95b9e4a2b16578fc","amp;dn":"Star+Trek+Starfleet+Command+Gold+Edition+%28GOG%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fddc032173c3e21493b56e2e95b9e4a2b16578fc","infoHashBuffer":{"type":"Buffer","data":[253,220,3,33,115,195,226,20,147,181,110,46,149,185,228,162,177,101,120,252]},"announce":[],"urlList":[]}}