{"title":"Kami Garcia, Margaret Stohl Beautiful Chaos (BC Book 3)","uid":8679352,"size":934230062,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:fe400422a7790120889df39efb8a3bc305a6659f&amp;dn=Kami+Garcia%2C+Margaret+Stohl+Beautiful+Chaos+%28BC+Book+3%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"katelynor","files":2,"time":1373663296,"description":"Ethan Wate thought he was getting used to the strange, impossible events happening in Gatlin, his small Southern town. But now that Ethan and Lena have returned home, strange and impossible have taken on new meanings. Swarms of locusts, record-breaking heat, and devastating storms ravage Gatlin as Ethan and Lena struggle to understand the impact of Lena's Claiming. Even Lena's family of powerful Supernaturals is affected - and their abilities begin to dangerously misfire. As time passes, one question becomes clear: What - or who - will need to be sacrificed to save Gatlin?\n\nFor Ethan, the chaos is a frightening but welcome distraction. He's being haunted in his dreams again, but this time it isn't by Lena - and whatever is haunting him is following him out of his dreams and into his everyday life. Even worse, Ethan is gradually losing pieces of himself - forgetting names, phone numbers, even memories. He doesn't know why, and most days he's too afraid to ask.\n\nSometimes there isn't just one answer or one choice. Sometimes there's no going back. And this time there won't be a happy ending.\n\n\n\nConverted using SoundTaxi 128kbps","torrent":{"xt":"urn:btih:fe400422a7790120889df39efb8a3bc305a6659f","amp;dn":"Kami+Garcia%2C+Margaret+Stohl+Beautiful+Chaos+%28BC+Book+3%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe400422a7790120889df39efb8a3bc305a6659f","infoHashBuffer":{"type":"Buffer","data":[254,64,4,34,167,121,1,32,136,157,243,158,251,138,59,195,5,166,101,159]},"announce":[],"urlList":[]}}