{"title":"The Christ-Myth Theory and Its Problems by Robert M. Price","uid":10178744,"size":4232864,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fe459334e2b93ca9dbb5d297570e804da6535fb3&amp;dn=The+Christ-Myth+Theory+and+Its+Problems+by+Robert+M.+Price&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LemonJ-Lo","files":-1,"time":1400459430,"description":"The Christ-Myth Theory and Its Problems (2011) by Robert McNair Price.pdf\n\nThe Christ-Myth theory ... &quot;Worse Than Atheism&quot;? New Testament scholar Robert M. Price, one of America's leading authorities on the Bible, has assembled in his book evidence that shows that almost the entire &quot;biography of Jesus&quot; is a conscious reworking of earlier literature.It is one thing to say &quot;There are no gods&quot; or &quot;Jesus was not a god, just a man.&quot; It is quite another thing to say &quot;Jesus of Nazareth never existed at all&quot; or that &quot;Christ is a myth.&quot; But scholars have been saying exactly that since at least 1793 when the Enlightenment scholar Charles Dupuis began to publish his 13-volume Origine de Tous les Cultes, ou Religion Universelle, which elucidated the astral origins not only of Christianity but of other ancient religions as well.\n\nNew Testament scholar Robert M. Price, one of America's leading authorities on the Bible, here summarizes much of the scholarship that has led him and a growing number of modern scholars to conclude that Christ -- a partial synonym for Jesus of Nazareth -- is mythical. Most usefully, Price has assembled evidence that shows that almost the entire &quot;biography of Jesus&quot; has been created from Greek Old Testament stories and themes and even incorporates motifs from Homer, Euripides, and perhaps Aesop. Because readers will have a hard time &quot;taking it on faith&quot; that the Jesus biography is merely a reworking of previous material, broad swaths of &quot;Old Testament&quot; context are quoted in association with each New Testament equivalent, so readers can judge for themselves whether or not Dr. Price's claim be true: the &quot;Live of Christ&quot; was not fulfillment of Old Testament prophecies; it was, rather, a conscious reworking of earlier literature.\n\n427 pages\nPublisher: American Atheist Press (August 1, 2011)\nLanguage: English\nISBN-10: 1578840171\nISBN-13: 978-1578840175","torrent":{"xt":"urn:btih:fe459334e2b93ca9dbb5d297570e804da6535fb3","amp;dn":"The+Christ-Myth+Theory+and+Its+Problems+by+Robert+M.+Price","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe459334e2b93ca9dbb5d297570e804da6535fb3","infoHashBuffer":{"type":"Buffer","data":[254,69,147,52,226,185,60,169,219,181,210,151,87,14,128,77,166,83,95,179]},"announce":[],"urlList":[]}}