{"title":"David O. Kennedy - Plants and the Human Brain [2014][A]","uid":10262717,"size":5129850,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fe4afb084b9603799da25533a597ffb0f4b4616a&amp;dn=David+O.+Kennedy+-+Plants+and+the+Human+Brain+%5B2014%5D%5BA%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anette14","files":-1,"time":1401484605,"description":"Description\nProduct Details\nBook Title: Plants and the Human Brain\t\nBook Author: David O. Kennedy (Author)\nHardcover: 400 pages\nPublisher: Oxford University Press (February 7, 2014)\nLanguage: English\nISBN-10: 019991401X\nISBN-13: 978-0199914012\n\n===================================================================================\nBook Description\nPublication Date: February 7, 2014\nWe're all familiar with the idea that plant-derived chemicals can have an impact on the functioning of the human brain. Most of us reach for a cup of coffee or tea in the morning, many of us occasionally eat some chocolate, some smoke a cigarette or take an herbal supplement, and some people use illicit drugs. We know a great deal about the mechanisms by which the psychoactive components of these various products have their effects on human brain function, but the question of why they have these effects has been almost totally ignored.\nThis book sets out to describe not only how, but more importantly why, plant- and fungus-derived chemicals have their effects on the human brain. The answer to this last question resides, in part, with the terrestrial world's two dominant life forms, the plants and the insects, and the many ecological roles the 'secondary metabolite' plant chemicals are trying to play; for instance, defending the plant against insect herbivores whilst attracting insect pollinators. The answer also resides in the intersecting genetic heritage of mammals, plants, and insects and the surprising biological similarities between the three taxa. In particular it revolves around the close correspondence between the brains of insects and humans, and the intercellular signaling pathways shared by plants and humans.\nPlants and the Human Brain describes and discusses both how and why phytochemicals affect brain function with respect to the three main groups of secondary metabolites: the alkaloids, which provide us with a host of poisons, a handful of hallucinogens, and most drugs of abuse (e.g. morphine, cocaine and nicotine); the phenolics, which constitute a significant and beneficial part of our natural diet; and the terpenes, a group of multifunctional compounds which provide us with the active components of cannabis and a multitude of herbal extracts.\n\n===================================================================================\nReviews\n&quot;This is an impressive book. ... I recommend reading it -- the writing is clear, lucid, and engaging. If you don't believe me, just read the first two paragraphs -- you will be hooked!&quot; -- Dale Walters, Scotland's Rural College, Edinburgh\n\n&quot;This book is a scholarly masterpiece of David O. Kennedy. If you want to understand the pharmacological mode of action of the psychoactive natural products and their role in human history, Plants and the Human Brain, is fascinating read.&quot; -- Michael Wink, Professor of Pharmaceutical Biology, Heidelberg University, Germany\n\n===================================================================================\nAbout the Author\nDavid Kennedy is a Professor of Biological Psychology and the Director of the Brain, Performance and Nutrition Research Centre at Northumbria University in the UK. His own research centers around the effects of nutritional interventions, including plant derived chemicals, on human brain function.\n===================================================================================","torrent":{"xt":"urn:btih:fe4afb084b9603799da25533a597ffb0f4b4616a","amp;dn":"David+O.+Kennedy+-+Plants+and+the+Human+Brain+%5B2014%5D%5BA%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe4afb084b9603799da25533a597ffb0f4b4616a","infoHashBuffer":{"type":"Buffer","data":[254,74,251,8,75,150,3,121,157,162,85,51,165,151,255,176,244,180,97,106]},"announce":[],"urlList":[]}}