{"title":"Pornoromance {New 2014} XXX_DVDRip","uid":9620407,"size":1738601394,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:ff466bfa7e2f3b9a5c4c1c5b4a2d8106146020a5&amp;dn=Pornoromance+%7BNew+2014%7D+XXX_DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"m21wolf","files":2,"time":1392492501,"description":"Pornoromance {New 2014} XXX_DVDRip\n\nStarring: \n\nAsh Hollywood, James Deen, Juelz Ventura, Lia Lor, Maia Davis, Cherry Torn, Ramon, Tommy Pistol\n\nDescription: \n\nDirector and heartthrob James Deen is into romance of a very special kind. His latest release, Pornoromance, explores the elements of his passion: rough, beastly hard-core sex, fluid exchange, throat fucking, female ejaculation, breath control, aggressive foot worship, choking and domination. All of this intense play is captured with a dreamy, classy, high-tone style of videography that makes the nasty action seem all the more perverse! Stunningly beautiful blonde model Ash Hollywood meets James for a sensuous encounter. He gags Ash with her own underthings and rams her hard in a filthy, frenetic date marked by messy kink. Next, pale, naturally busty Cherry Torn gets thoroughly manhandled by stud Toni Ribas. Toni shoves his fingers into her throat, making her drool, and brutally fucks her face. Slender, tattooed punk princess Maia Davis takes on Latin lover Ramon. He throat-bangs her until Maia's slobber coats his shaft. Ramon ruthlessly sodomizes and overpowers her, ultimately leaving her sticky and exhausted. Busty, athletic slut Juelz Ventura enjoys a romantic session of deep-throat abuse, spit swapping, slapping and sweaty anal pounding with Tommy Pistol. Gorgeous blonde Lia Lor is totally smitten with James. He lets Lia submissively rim his bunghole and worship his ball sack. Lia's hairy cunt gets ruthlessly fucked, and even penetrated by James toes; she explodes in several squirting orgasms! With five slutty beauties in over three hours of enchanting filth (plus behind-the-scenes footage on the DVD version), Pornoromance will keep fans falling in love every night.\n\nCover:\n &lt;a href=&quot;\nhttp://www.flickimg.com/aZb&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.flickimg.com/aZb&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.flickimg.com/aZx&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.flickimg.com/aZx&lt;/a&gt;\n\nThumbnail Screenshot:\n &lt;a href=&quot;\nhttp://www.flickimg.com/aSd&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.flickimg.com/aSd&lt;/a&gt;\n\nDownload, Seed &amp; Enjoy :)","torrent":{"xt":"urn:btih:ff466bfa7e2f3b9a5c4c1c5b4a2d8106146020a5","amp;dn":"Pornoromance+%7BNew+2014%7D+XXX_DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff466bfa7e2f3b9a5c4c1c5b4a2d8106146020a5","infoHashBuffer":{"type":"Buffer","data":[255,70,107,250,126,47,59,154,92,76,28,91,74,45,129,6,20,96,32,165]},"announce":[],"urlList":[]}}