{"title":"Night Ranger - Sister Christian (Live From NAAM) (2nafish)","uid":5691577,"size":189104132,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:ff987535a0c4bb5c8c38cd753c26a280915f2283&amp;dn=Night+Ranger+-+Sister+Christian+%28Live+From+NAAM%29+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1279067901,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Sister Christian&quot; is a power ballad by the hard rock band Night Ranger, which was second released on their album Midnight Madness. The song is their best-known hit, and the album it came from was very successful. It was ranked number 32 on VH1's 100 Greatest Songs of the 1980s. This song is slated to be in the upcoming rhythm game Rock Band 3.\n\nIt was written and sung by the band's drummer, Kelly Keagy, for his sister. It was the band's biggest hit, peaking at number five on the Billboard Hot 100.\n\nThe song is about Keagy's little sister, Christy. Keagy wrote the song at his apartment, near Divisadero and California streets in San Francisco, after he had just returned from a visit to his hometown of Eugene, Oregon. He had been struck at how fast his teenaged sister, 10 years younger than he, was growing up.\n\n&quot;After we started playing it a lot, Jack turned to me and said, 'What exactly are you saying?' &quot; Keagy recalled. &quot;He thought the words were Sister Christian, instead of Sister Christy, so it just stuck.&quot; He added that the real Christy was so mortified when the song came out she nearly changed her name.\n\nThe lyric, &quot;You're motoring. What's your price for flight? In finding Mr. Right?&quot; is the subject of much debate. The band stated in a VH-1 Behind the Music interview that the term &quot;motoring&quot; was synonymous with the term &quot;cruising.&quot; The term is most often used to describe driving around in a car slowly as a social experience, but can also be used to describe picking up people for casual sex. When Keagy visited his family he heard second hand about his sister cruising for a man to casually sleep with. After verifying this with her he was shocked and lamented how fast she was growing up. He then went back home and wrote &quot;Sister Christian&quot; about the experience. This song is sometimes incorrectly called, &quot;Motorin'&quot;, or &quot;Motorade&quot;.\n\nMidnight Madness is the second album from Night Ranger. The album contained the band's best known hit, &quot;Sister Christian,&quot; and therefore became the band's highest selling album, selling well over a million copies in the U.S.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:ff987535a0c4bb5c8c38cd753c26a280915f2283","amp;dn":"Night+Ranger+-+Sister+Christian+%28Live+From+NAAM%29+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff987535a0c4bb5c8c38cd753c26a280915f2283","infoHashBuffer":{"type":"Buffer","data":[255,152,117,53,160,196,187,92,140,56,205,117,60,38,162,128,145,95,34,131]},"announce":[],"urlList":[]}}