{"title":"100 Bullshit Jobs (2006) [FrankFoo]","uid":9910462,"size":3316077,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ffa45a051c2288bd0e61b32f19d1b8cc15e3302b&amp;dn=100+Bullshit+Jobs+%282006%29+%5BFrankFoo%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"FrankFoo2","files":-1,"time":1396887248,"description":"\n[b]100 Bullshit Jobs...And How to Get Them[/b]\nBy: Stanley Bing \nISBN: 0060734795 \nPublisher: Collins - 2006-05-01 \nHardcover | 320 Pages \n\n\nThe scholarly discipline of Bullshit Studies has blossomed in the last several years, fertilized by a number of critical works on the subject and the growing importance of the issue across a wide range of professions. \n\nNow, best-selling author and lifelong practitioner Stanley Bing enters the field with a comprehensive look at the many attractive jobs now available to those who are serious about their bullshit and prepared to dedicate their working life to it. \n\nWhat, Bing inquires, do a feng shui consultant, new media executive, wine steward, department store greeter, and Vice President of the United States have in common? \n\nWhat, too, are the actual duties performed by a McKinsey consultant? \n\nOther than sitting around making people nervous? \nCould that possibly be his core function? Likewise, what does an aromatherapist actually do, per se? \n\nSniff things and rub them on people, for big fragrant bucks? Is that all? \n\nThe answer in all cases is &quot;Yes.&quot; They all have bullshit jobs. \n\nThese few, of course, are just the beginning. \nAcross the length and breadth of this shrinking globe, skillful bullshit artists have secured pleasant, lucrative employment, and are enjoying themselves more than you are. \n\nIn virtually every occupation, from Advertising to Yoga Franchising, lucky individuals who &quot;work&quot; in these coveted positions enjoy the best lives imaginable -- they are paid well, they rarely break a sweat, and their professions are highly respected, because nobody really knows what they do. \n\nAt once funny, useful, and tolerably philosophical, this groundbreaking work takes a close look at 100 bullshit jobs -- the money they bring with them, the actual tasks and activities involved (if any), and famous and successful examples of each position, who will provide the neophyte with inspiration. \n\nMost crucially, Bing goes on to offer what others so far have not--a clear, concise strategy to help job-seekers at every level reach for that brass ring, knowing full well that it may be attached to the nose of a bull.\n\n","torrent":{"xt":"urn:btih:ffa45a051c2288bd0e61b32f19d1b8cc15e3302b","amp;dn":"100+Bullshit+Jobs+%282006%29+%5BFrankFoo%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ffa45a051c2288bd0e61b32f19d1b8cc15e3302b","infoHashBuffer":{"type":"Buffer","data":[255,164,90,5,28,34,136,189,14,97,179,47,25,209,184,204,21,227,48,43]},"announce":[],"urlList":[]}}